Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x9fa (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 27 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x75863): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x4ad7f): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x346e9): D:/Personal studies/ITI embedded/workspace/my_Code/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 6 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x61709): signed char
 <1><31>: Abbrev Number: 4 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x7c53): __uint8_t
    <36>   DW_AT_decl_file   : 3
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 6 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0x5d8be): unsigned char
 <1><44>: Abbrev Number: 6 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x4efa): short int
 <1><4b>: Abbrev Number: 4 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0x695b9): __uint16_t
    <50>   DW_AT_decl_file   : 3
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 6 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0x4142c): short unsigned int
 <1><5e>: Abbrev Number: 6 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x19f77): long int
 <1><65>: Abbrev Number: 4 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x3933e): __uint32_t
    <6a>   DW_AT_decl_file   : 3
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 6 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x4cc9d): long unsigned int
 <1><78>: Abbrev Number: 6 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x33d27): long long int
 <1><7f>: Abbrev Number: 6 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x2c305): long long unsigned int
 <1><86>: Abbrev Number: 28 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 6 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x464bd): unsigned int
 <1><94>: Abbrev Number: 4 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x7c55): uint8_t
    <99>   DW_AT_decl_file   : 4
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 4 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0x4b253): uint16_t
    <a5>   DW_AT_decl_file   : 4
    <a6>   DW_AT_decl_line   : 36
    <a7>   DW_AT_decl_column : 20
    <a8>   DW_AT_type        : <0x4b>
 <1><ac>: Abbrev Number: 4 (DW_TAG_typedef)
    <ad>   DW_AT_name        : (indirect string, offset: 0x32a90): uint32_t
    <b1>   DW_AT_decl_file   : 4
    <b2>   DW_AT_decl_line   : 48
    <b3>   DW_AT_decl_column : 20
    <b4>   DW_AT_type        : <0x65>
 <1><b8>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <b9>   DW_AT_type        : <0xac>
 <1><bd>: Abbrev Number: 16 (DW_TAG_array_type)
    <be>   DW_AT_type        : <0xac>
    <c2>   DW_AT_sibling     : <0xcd>
 <2><c6>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <c7>   DW_AT_type        : <0x8d>
    <cb>   DW_AT_upper_bound : 0
 <2><cc>: Abbrev Number: 0
 <1><cd>: Abbrev Number: 16 (DW_TAG_array_type)
    <ce>   DW_AT_type        : <0xac>
    <d2>   DW_AT_sibling     : <0xdd>
 <2><d6>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <d7>   DW_AT_type        : <0x8d>
    <db>   DW_AT_upper_bound : 1
 <2><dc>: Abbrev Number: 0
 <1><dd>: Abbrev Number: 18 (DW_TAG_structure_type)
    <de>   DW_AT_byte_size   : 40
    <df>   DW_AT_decl_file   : 5
    <df>   DW_AT_decl_line   : 264
    <e1>   DW_AT_decl_column : 9
    <e1>   DW_AT_sibling     : <0x152>
 <2><e5>: Abbrev Number: 2 (DW_TAG_member)
    <e6>   DW_AT_name        : (indirect string, offset: 0x628be): MODER
    <ea>   DW_AT_decl_file   : 5
    <ea>   DW_AT_decl_line   : 266
    <ec>   DW_AT_decl_column : 17
    <ec>   DW_AT_type        : <0xb8>
    <f0>   DW_AT_data_member_location: 0
 <2><f1>: Abbrev Number: 2 (DW_TAG_member)
    <f2>   DW_AT_name        : (indirect string, offset: 0x34278): OTYPER
    <f6>   DW_AT_decl_file   : 5
    <f6>   DW_AT_decl_line   : 267
    <f8>   DW_AT_decl_column : 17
    <f8>   DW_AT_type        : <0xb8>
    <fc>   DW_AT_data_member_location: 4
 <2><fd>: Abbrev Number: 2 (DW_TAG_member)
    <fe>   DW_AT_name        : (indirect string, offset: 0x29676): OSPEEDR
    <102>   DW_AT_decl_file   : 5
    <102>   DW_AT_decl_line   : 268
    <104>   DW_AT_decl_column : 17
    <104>   DW_AT_type        : <0xb8>
    <108>   DW_AT_data_member_location: 8
 <2><109>: Abbrev Number: 2 (DW_TAG_member)
    <10a>   DW_AT_name        : (indirect string, offset: 0x8198f): PUPDR
    <10e>   DW_AT_decl_file   : 5
    <10e>   DW_AT_decl_line   : 269
    <110>   DW_AT_decl_column : 17
    <110>   DW_AT_type        : <0xb8>
    <114>   DW_AT_data_member_location: 12
 <2><115>: Abbrev Number: 7 (DW_TAG_member)
    <116>   DW_AT_name        : IDR
    <11a>   DW_AT_decl_file   : 5
    <11a>   DW_AT_decl_line   : 270
    <11c>   DW_AT_decl_column : 17
    <11c>   DW_AT_type        : <0xb8>
    <120>   DW_AT_data_member_location: 16
 <2><121>: Abbrev Number: 7 (DW_TAG_member)
    <122>   DW_AT_name        : ODR
    <126>   DW_AT_decl_file   : 5
    <126>   DW_AT_decl_line   : 271
    <128>   DW_AT_decl_column : 17
    <128>   DW_AT_type        : <0xb8>
    <12c>   DW_AT_data_member_location: 20
 <2><12d>: Abbrev Number: 2 (DW_TAG_member)
    <12e>   DW_AT_name        : (indirect string, offset: 0x5bf65): BSRR
    <132>   DW_AT_decl_file   : 5
    <132>   DW_AT_decl_line   : 272
    <134>   DW_AT_decl_column : 17
    <134>   DW_AT_type        : <0xb8>
    <138>   DW_AT_data_member_location: 24
 <2><139>: Abbrev Number: 2 (DW_TAG_member)
    <13a>   DW_AT_name        : (indirect string, offset: 0x22b07): LCKR
    <13e>   DW_AT_decl_file   : 5
    <13e>   DW_AT_decl_line   : 273
    <140>   DW_AT_decl_column : 17
    <140>   DW_AT_type        : <0xb8>
    <144>   DW_AT_data_member_location: 28
 <2><145>: Abbrev Number: 7 (DW_TAG_member)
    <146>   DW_AT_name        : AFR
    <14a>   DW_AT_decl_file   : 5
    <14a>   DW_AT_decl_line   : 274
    <14c>   DW_AT_decl_column : 17
    <14c>   DW_AT_type        : <0x162>
    <150>   DW_AT_data_member_location: 32
 <2><151>: Abbrev Number: 0
 <1><152>: Abbrev Number: 16 (DW_TAG_array_type)
    <153>   DW_AT_type        : <0xb8>
    <157>   DW_AT_sibling     : <0x162>
 <2><15b>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <15c>   DW_AT_type        : <0x8d>
    <160>   DW_AT_upper_bound : 1
 <2><161>: Abbrev Number: 0
 <1><162>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <163>   DW_AT_type        : <0x152>
 <1><167>: Abbrev Number: 19 (DW_TAG_typedef)
    <168>   DW_AT_name        : (indirect string, offset: 0x6b984): GPIO_TypeDef
    <16c>   DW_AT_decl_file   : 5
    <16c>   DW_AT_decl_line   : 275
    <16e>   DW_AT_decl_column : 3
    <16e>   DW_AT_type        : <0xdd>
 <1><172>: Abbrev Number: 18 (DW_TAG_structure_type)
    <173>   DW_AT_byte_size   : 8
    <174>   DW_AT_decl_file   : 5
    <174>   DW_AT_decl_line   : 325
    <176>   DW_AT_decl_column : 9
    <176>   DW_AT_sibling     : <0x192>
 <2><17a>: Abbrev Number: 7 (DW_TAG_member)
    <17b>   DW_AT_name        : CR
    <17e>   DW_AT_decl_file   : 5
    <17e>   DW_AT_decl_line   : 327
    <180>   DW_AT_decl_column : 17
    <180>   DW_AT_type        : <0xb8>
    <184>   DW_AT_data_member_location: 0
 <2><185>: Abbrev Number: 7 (DW_TAG_member)
    <186>   DW_AT_name        : CSR
    <18a>   DW_AT_decl_file   : 5
    <18a>   DW_AT_decl_line   : 328
    <18c>   DW_AT_decl_column : 17
    <18c>   DW_AT_type        : <0xb8>
    <190>   DW_AT_data_member_location: 4
 <2><191>: Abbrev Number: 0
 <1><192>: Abbrev Number: 19 (DW_TAG_typedef)
    <193>   DW_AT_name        : (indirect string, offset: 0x77d9e): PWR_TypeDef
    <197>   DW_AT_decl_file   : 5
    <197>   DW_AT_decl_line   : 329
    <199>   DW_AT_decl_column : 3
    <199>   DW_AT_type        : <0x172>
 <1><19d>: Abbrev Number: 18 (DW_TAG_structure_type)
    <19e>   DW_AT_byte_size   : 144
    <19f>   DW_AT_decl_file   : 5
    <19f>   DW_AT_decl_line   : 335
    <1a1>   DW_AT_decl_column : 9
    <1a1>   DW_AT_sibling     : <0x325>
 <2><1a5>: Abbrev Number: 7 (DW_TAG_member)
    <1a6>   DW_AT_name        : CR
    <1a9>   DW_AT_decl_file   : 5
    <1a9>   DW_AT_decl_line   : 337
    <1ab>   DW_AT_decl_column : 17
    <1ab>   DW_AT_type        : <0xb8>
    <1af>   DW_AT_data_member_location: 0
 <2><1b0>: Abbrev Number: 2 (DW_TAG_member)
    <1b1>   DW_AT_name        : (indirect string, offset: 0x357b6): PLLCFGR
    <1b5>   DW_AT_decl_file   : 5
    <1b5>   DW_AT_decl_line   : 338
    <1b7>   DW_AT_decl_column : 17
    <1b7>   DW_AT_type        : <0xb8>
    <1bb>   DW_AT_data_member_location: 4
 <2><1bc>: Abbrev Number: 2 (DW_TAG_member)
    <1bd>   DW_AT_name        : (indirect string, offset: 0x654fa): CFGR
    <1c1>   DW_AT_decl_file   : 5
    <1c1>   DW_AT_decl_line   : 339
    <1c3>   DW_AT_decl_column : 17
    <1c3>   DW_AT_type        : <0xb8>
    <1c7>   DW_AT_data_member_location: 8
 <2><1c8>: Abbrev Number: 7 (DW_TAG_member)
    <1c9>   DW_AT_name        : CIR
    <1cd>   DW_AT_decl_file   : 5
    <1cd>   DW_AT_decl_line   : 340
    <1cf>   DW_AT_decl_column : 17
    <1cf>   DW_AT_type        : <0xb8>
    <1d3>   DW_AT_data_member_location: 12
 <2><1d4>: Abbrev Number: 2 (DW_TAG_member)
    <1d5>   DW_AT_name        : (indirect string, offset: 0x55dd4): AHB1RSTR
    <1d9>   DW_AT_decl_file   : 5
    <1d9>   DW_AT_decl_line   : 341
    <1db>   DW_AT_decl_column : 17
    <1db>   DW_AT_type        : <0xb8>
    <1df>   DW_AT_data_member_location: 16
 <2><1e0>: Abbrev Number: 2 (DW_TAG_member)
    <1e1>   DW_AT_name        : (indirect string, offset: 0x6a3fc): AHB2RSTR
    <1e5>   DW_AT_decl_file   : 5
    <1e5>   DW_AT_decl_line   : 342
    <1e7>   DW_AT_decl_column : 17
    <1e7>   DW_AT_type        : <0xb8>
    <1eb>   DW_AT_data_member_location: 20
 <2><1ec>: Abbrev Number: 2 (DW_TAG_member)
    <1ed>   DW_AT_name        : (indirect string, offset: 0x7f381): AHB3RSTR
    <1f1>   DW_AT_decl_file   : 5
    <1f1>   DW_AT_decl_line   : 343
    <1f3>   DW_AT_decl_column : 17
    <1f3>   DW_AT_type        : <0xb8>
    <1f7>   DW_AT_data_member_location: 24
 <2><1f8>: Abbrev Number: 2 (DW_TAG_member)
    <1f9>   DW_AT_name        : (indirect string, offset: 0xf821): RESERVED0
    <1fd>   DW_AT_decl_file   : 5
    <1fd>   DW_AT_decl_line   : 344
    <1ff>   DW_AT_decl_column : 17
    <1ff>   DW_AT_type        : <0xac>
    <203>   DW_AT_data_member_location: 28
 <2><204>: Abbrev Number: 2 (DW_TAG_member)
    <205>   DW_AT_name        : (indirect string, offset: 0x1962c): APB1RSTR
    <209>   DW_AT_decl_file   : 5
    <209>   DW_AT_decl_line   : 345
    <20b>   DW_AT_decl_column : 17
    <20b>   DW_AT_type        : <0xb8>
    <20f>   DW_AT_data_member_location: 32
 <2><210>: Abbrev Number: 2 (DW_TAG_member)
    <211>   DW_AT_name        : (indirect string, offset: 0xae80): APB2RSTR
    <215>   DW_AT_decl_file   : 5
    <215>   DW_AT_decl_line   : 346
    <217>   DW_AT_decl_column : 17
    <217>   DW_AT_type        : <0xb8>
    <21b>   DW_AT_data_member_location: 36
 <2><21c>: Abbrev Number: 2 (DW_TAG_member)
    <21d>   DW_AT_name        : (indirect string, offset: 0xf846): RESERVED1
    <221>   DW_AT_decl_file   : 5
    <221>   DW_AT_decl_line   : 347
    <223>   DW_AT_decl_column : 17
    <223>   DW_AT_type        : <0xcd>
    <227>   DW_AT_data_member_location: 40
 <2><228>: Abbrev Number: 2 (DW_TAG_member)
    <229>   DW_AT_name        : (indirect string, offset: 0x6851b): AHB1ENR
    <22d>   DW_AT_decl_file   : 5
    <22d>   DW_AT_decl_line   : 348
    <22f>   DW_AT_decl_column : 17
    <22f>   DW_AT_type        : <0xb8>
    <233>   DW_AT_data_member_location: 48
 <2><234>: Abbrev Number: 2 (DW_TAG_member)
    <235>   DW_AT_name        : (indirect string, offset: 0x162c7): AHB2ENR
    <239>   DW_AT_decl_file   : 5
    <239>   DW_AT_decl_line   : 349
    <23b>   DW_AT_decl_column : 17
    <23b>   DW_AT_type        : <0xb8>
    <23f>   DW_AT_data_member_location: 52
 <2><240>: Abbrev Number: 2 (DW_TAG_member)
    <241>   DW_AT_name        : (indirect string, offset: 0x140e): AHB3ENR
    <245>   DW_AT_decl_file   : 5
    <245>   DW_AT_decl_line   : 350
    <247>   DW_AT_decl_column : 17
    <247>   DW_AT_type        : <0xb8>
    <24b>   DW_AT_data_member_location: 56
 <2><24c>: Abbrev Number: 2 (DW_TAG_member)
    <24d>   DW_AT_name        : (indirect string, offset: 0x52361): RESERVED2
    <251>   DW_AT_decl_file   : 5
    <251>   DW_AT_decl_line   : 351
    <253>   DW_AT_decl_column : 17
    <253>   DW_AT_type        : <0xac>
    <257>   DW_AT_data_member_location: 60
 <2><258>: Abbrev Number: 2 (DW_TAG_member)
    <259>   DW_AT_name        : (indirect string, offset: 0x25ccf): APB1ENR
    <25d>   DW_AT_decl_file   : 5
    <25d>   DW_AT_decl_line   : 352
    <25f>   DW_AT_decl_column : 17
    <25f>   DW_AT_type        : <0xb8>
    <263>   DW_AT_data_member_location: 64
 <2><264>: Abbrev Number: 2 (DW_TAG_member)
    <265>   DW_AT_name        : (indirect string, offset: 0x5321f): APB2ENR
    <269>   DW_AT_decl_file   : 5
    <269>   DW_AT_decl_line   : 353
    <26b>   DW_AT_decl_column : 17
    <26b>   DW_AT_type        : <0xb8>
    <26f>   DW_AT_data_member_location: 68
 <2><270>: Abbrev Number: 2 (DW_TAG_member)
    <271>   DW_AT_name        : (indirect string, offset: 0x5236b): RESERVED3
    <275>   DW_AT_decl_file   : 5
    <275>   DW_AT_decl_line   : 354
    <277>   DW_AT_decl_column : 17
    <277>   DW_AT_type        : <0xcd>
    <27b>   DW_AT_data_member_location: 72
 <2><27c>: Abbrev Number: 2 (DW_TAG_member)
    <27d>   DW_AT_name        : (indirect string, offset: 0x259c6): AHB1LPENR
    <281>   DW_AT_decl_file   : 5
    <281>   DW_AT_decl_line   : 355
    <283>   DW_AT_decl_column : 17
    <283>   DW_AT_type        : <0xb8>
    <287>   DW_AT_data_member_location: 80
 <2><288>: Abbrev Number: 2 (DW_TAG_member)
    <289>   DW_AT_name        : (indirect string, offset: 0x594aa): AHB2LPENR
    <28d>   DW_AT_decl_file   : 5
    <28d>   DW_AT_decl_line   : 356
    <28f>   DW_AT_decl_column : 17
    <28f>   DW_AT_type        : <0xb8>
    <293>   DW_AT_data_member_location: 84
 <2><294>: Abbrev Number: 2 (DW_TAG_member)
    <295>   DW_AT_name        : (indirect string, offset: 0x6629e): AHB3LPENR
    <299>   DW_AT_decl_file   : 5
    <299>   DW_AT_decl_line   : 357
    <29b>   DW_AT_decl_column : 17
    <29b>   DW_AT_type        : <0xb8>
    <29f>   DW_AT_data_member_location: 88
 <2><2a0>: Abbrev Number: 2 (DW_TAG_member)
    <2a1>   DW_AT_name        : (indirect string, offset: 0x52375): RESERVED4
    <2a5>   DW_AT_decl_file   : 5
    <2a5>   DW_AT_decl_line   : 358
    <2a7>   DW_AT_decl_column : 17
    <2a7>   DW_AT_type        : <0xac>
    <2ab>   DW_AT_data_member_location: 92
 <2><2ac>: Abbrev Number: 2 (DW_TAG_member)
    <2ad>   DW_AT_name        : (indirect string, offset: 0x67b51): APB1LPENR
    <2b1>   DW_AT_decl_file   : 5
    <2b1>   DW_AT_decl_line   : 359
    <2b3>   DW_AT_decl_column : 17
    <2b3>   DW_AT_type        : <0xb8>
    <2b7>   DW_AT_data_member_location: 96
 <2><2b8>: Abbrev Number: 2 (DW_TAG_member)
    <2b9>   DW_AT_name        : (indirect string, offset: 0x80583): APB2LPENR
    <2bd>   DW_AT_decl_file   : 5
    <2bd>   DW_AT_decl_line   : 360
    <2bf>   DW_AT_decl_column : 17
    <2bf>   DW_AT_type        : <0xb8>
    <2c3>   DW_AT_data_member_location: 100
 <2><2c4>: Abbrev Number: 2 (DW_TAG_member)
    <2c5>   DW_AT_name        : (indirect string, offset: 0x5237f): RESERVED5
    <2c9>   DW_AT_decl_file   : 5
    <2c9>   DW_AT_decl_line   : 361
    <2cb>   DW_AT_decl_column : 17
    <2cb>   DW_AT_type        : <0xcd>
    <2cf>   DW_AT_data_member_location: 104
 <2><2d0>: Abbrev Number: 2 (DW_TAG_member)
    <2d1>   DW_AT_name        : (indirect string, offset: 0x82103): BDCR
    <2d5>   DW_AT_decl_file   : 5
    <2d5>   DW_AT_decl_line   : 362
    <2d7>   DW_AT_decl_column : 17
    <2d7>   DW_AT_type        : <0xb8>
    <2db>   DW_AT_data_member_location: 112
 <2><2dc>: Abbrev Number: 7 (DW_TAG_member)
    <2dd>   DW_AT_name        : CSR
    <2e1>   DW_AT_decl_file   : 5
    <2e1>   DW_AT_decl_line   : 363
    <2e3>   DW_AT_decl_column : 17
    <2e3>   DW_AT_type        : <0xb8>
    <2e7>   DW_AT_data_member_location: 116
 <2><2e8>: Abbrev Number: 2 (DW_TAG_member)
    <2e9>   DW_AT_name        : (indirect string, offset: 0x90c5): RESERVED6
    <2ed>   DW_AT_decl_file   : 5
    <2ed>   DW_AT_decl_line   : 364
    <2ef>   DW_AT_decl_column : 17
    <2ef>   DW_AT_type        : <0xcd>
    <2f3>   DW_AT_data_member_location: 120
 <2><2f4>: Abbrev Number: 2 (DW_TAG_member)
    <2f5>   DW_AT_name        : (indirect string, offset: 0x6ea2e): SSCGR
    <2f9>   DW_AT_decl_file   : 5
    <2f9>   DW_AT_decl_line   : 365
    <2fb>   DW_AT_decl_column : 17
    <2fb>   DW_AT_type        : <0xb8>
    <2ff>   DW_AT_data_member_location: 128
 <2><300>: Abbrev Number: 2 (DW_TAG_member)
    <301>   DW_AT_name        : (indirect string, offset: 0xd8d5): PLLI2SCFGR
    <305>   DW_AT_decl_file   : 5
    <305>   DW_AT_decl_line   : 366
    <307>   DW_AT_decl_column : 17
    <307>   DW_AT_type        : <0xb8>
    <30b>   DW_AT_data_member_location: 132
 <2><30c>: Abbrev Number: 2 (DW_TAG_member)
    <30d>   DW_AT_name        : (indirect string, offset: 0x523bc): RESERVED7
    <311>   DW_AT_decl_file   : 5
    <311>   DW_AT_decl_line   : 367
    <313>   DW_AT_decl_column : 17
    <313>   DW_AT_type        : <0xbd>
    <317>   DW_AT_data_member_location: 136
 <2><318>: Abbrev Number: 2 (DW_TAG_member)
    <319>   DW_AT_name        : (indirect string, offset: 0x654f7): DCKCFGR
    <31d>   DW_AT_decl_file   : 5
    <31d>   DW_AT_decl_line   : 368
    <31f>   DW_AT_decl_column : 17
    <31f>   DW_AT_type        : <0xb8>
    <323>   DW_AT_data_member_location: 140
 <2><324>: Abbrev Number: 0
 <1><325>: Abbrev Number: 19 (DW_TAG_typedef)
    <326>   DW_AT_name        : (indirect string, offset: 0x1ad63): RCC_TypeDef
    <32a>   DW_AT_decl_file   : 5
    <32a>   DW_AT_decl_line   : 369
    <32c>   DW_AT_decl_column : 3
    <32c>   DW_AT_type        : <0x19d>
 <1><330>: Abbrev Number: 6 (DW_TAG_base_type)
    <331>   DW_AT_byte_size   : 8
    <332>   DW_AT_encoding    : 4	(float)
    <333>   DW_AT_name        : (indirect string, offset: 0x885f8): long double
 <1><337>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <338>   DW_AT_encoding    : 7	(unsigned)
    <339>   DW_AT_byte_size   : 1
    <33a>   DW_AT_type        : <0x3d>
    <33e>   DW_AT_decl_file   : 6
    <33f>   DW_AT_decl_line   : 39
    <340>   DW_AT_decl_column : 1
    <341>   DW_AT_sibling     : <0x35e>
 <2><345>: Abbrev Number: 1 (DW_TAG_enumerator)
    <346>   DW_AT_name        : (indirect string, offset: 0x57cc6): HAL_OK
    <34a>   DW_AT_const_value : 0
 <2><34b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <34c>   DW_AT_name        : (indirect string, offset: 0x45c50): HAL_ERROR
    <350>   DW_AT_const_value : 1
 <2><351>: Abbrev Number: 1 (DW_TAG_enumerator)
    <352>   DW_AT_name        : (indirect string, offset: 0x53d4): HAL_BUSY
    <356>   DW_AT_const_value : 2
 <2><357>: Abbrev Number: 1 (DW_TAG_enumerator)
    <358>   DW_AT_name        : (indirect string, offset: 0x44cca): HAL_TIMEOUT
    <35c>   DW_AT_const_value : 3
 <2><35d>: Abbrev Number: 0
 <1><35e>: Abbrev Number: 4 (DW_TAG_typedef)
    <35f>   DW_AT_name        : (indirect string, offset: 0x7b2b6): HAL_StatusTypeDef
    <363>   DW_AT_decl_file   : 6
    <364>   DW_AT_decl_line   : 44
    <365>   DW_AT_decl_column : 3
    <366>   DW_AT_type        : <0x337>
 <1><36a>: Abbrev Number: 11 (DW_TAG_structure_type)
    <36b>   DW_AT_byte_size   : 24
    <36c>   DW_AT_decl_file   : 7
    <36d>   DW_AT_decl_line   : 45
    <36e>   DW_AT_decl_column : 9
    <36e>   DW_AT_sibling     : <0x3c1>
 <2><372>: Abbrev Number: 3 (DW_TAG_member)
    <373>   DW_AT_name        : (indirect string, offset: 0x7450b): PLLState
    <377>   DW_AT_decl_file   : 7
    <378>   DW_AT_decl_line   : 47
    <379>   DW_AT_decl_column : 12
    <37a>   DW_AT_type        : <0xac>
    <37e>   DW_AT_data_member_location: 0
 <2><37f>: Abbrev Number: 3 (DW_TAG_member)
    <380>   DW_AT_name        : (indirect string, offset: 0x552e3): PLLSource
    <384>   DW_AT_decl_file   : 7
    <385>   DW_AT_decl_line   : 50
    <386>   DW_AT_decl_column : 12
    <387>   DW_AT_type        : <0xac>
    <38b>   DW_AT_data_member_location: 4
 <2><38c>: Abbrev Number: 3 (DW_TAG_member)
    <38d>   DW_AT_name        : (indirect string, offset: 0x4aa51): PLLM
    <391>   DW_AT_decl_file   : 7
    <392>   DW_AT_decl_line   : 53
    <393>   DW_AT_decl_column : 12
    <394>   DW_AT_type        : <0xac>
    <398>   DW_AT_data_member_location: 8
 <2><399>: Abbrev Number: 3 (DW_TAG_member)
    <39a>   DW_AT_name        : (indirect string, offset: 0x6a098): PLLN
    <39e>   DW_AT_decl_file   : 7
    <39f>   DW_AT_decl_line   : 56
    <3a0>   DW_AT_decl_column : 12
    <3a1>   DW_AT_type        : <0xac>
    <3a5>   DW_AT_data_member_location: 12
 <2><3a6>: Abbrev Number: 3 (DW_TAG_member)
    <3a7>   DW_AT_name        : (indirect string, offset: 0x6a0c5): PLLP
    <3ab>   DW_AT_decl_file   : 7
    <3ac>   DW_AT_decl_line   : 60
    <3ad>   DW_AT_decl_column : 12
    <3ae>   DW_AT_type        : <0xac>
    <3b2>   DW_AT_data_member_location: 16
 <2><3b3>: Abbrev Number: 3 (DW_TAG_member)
    <3b4>   DW_AT_name        : (indirect string, offset: 0x714a3): PLLQ
    <3b8>   DW_AT_decl_file   : 7
    <3b9>   DW_AT_decl_line   : 63
    <3ba>   DW_AT_decl_column : 12
    <3bb>   DW_AT_type        : <0xac>
    <3bf>   DW_AT_data_member_location: 20
 <2><3c0>: Abbrev Number: 0
 <1><3c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <3c2>   DW_AT_name        : (indirect string, offset: 0x5f51b): RCC_PLLInitTypeDef
    <3c6>   DW_AT_decl_file   : 7
    <3c7>   DW_AT_decl_line   : 73
    <3c8>   DW_AT_decl_column : 3
    <3c9>   DW_AT_type        : <0x36a>
 <1><3cd>: Abbrev Number: 11 (DW_TAG_structure_type)
    <3ce>   DW_AT_byte_size   : 48
    <3cf>   DW_AT_decl_file   : 8
    <3d0>   DW_AT_decl_line   : 49
    <3d1>   DW_AT_decl_column : 9
    <3d1>   DW_AT_sibling     : <0x431>
 <2><3d5>: Abbrev Number: 3 (DW_TAG_member)
    <3d6>   DW_AT_name        : (indirect string, offset: 0x81c7b): OscillatorType
    <3da>   DW_AT_decl_file   : 8
    <3db>   DW_AT_decl_line   : 51
    <3dc>   DW_AT_decl_column : 12
    <3dd>   DW_AT_type        : <0xac>
    <3e1>   DW_AT_data_member_location: 0
 <2><3e2>: Abbrev Number: 3 (DW_TAG_member)
    <3e3>   DW_AT_name        : (indirect string, offset: 0x275f8): HSEState
    <3e7>   DW_AT_decl_file   : 8
    <3e8>   DW_AT_decl_line   : 54
    <3e9>   DW_AT_decl_column : 12
    <3ea>   DW_AT_type        : <0xac>
    <3ee>   DW_AT_data_member_location: 4
 <2><3ef>: Abbrev Number: 3 (DW_TAG_member)
    <3f0>   DW_AT_name        : (indirect string, offset: 0x438c5): LSEState
    <3f4>   DW_AT_decl_file   : 8
    <3f5>   DW_AT_decl_line   : 57
    <3f6>   DW_AT_decl_column : 12
    <3f7>   DW_AT_type        : <0xac>
    <3fb>   DW_AT_data_member_location: 8
 <2><3fc>: Abbrev Number: 3 (DW_TAG_member)
    <3fd>   DW_AT_name        : (indirect string, offset: 0x6306): HSIState
    <401>   DW_AT_decl_file   : 8
    <402>   DW_AT_decl_line   : 60
    <403>   DW_AT_decl_column : 12
    <404>   DW_AT_type        : <0xac>
    <408>   DW_AT_data_member_location: 12
 <2><409>: Abbrev Number: 3 (DW_TAG_member)
    <40a>   DW_AT_name        : (indirect string, offset: 0x3ff3f): HSICalibrationValue
    <40e>   DW_AT_decl_file   : 8
    <40f>   DW_AT_decl_line   : 63
    <410>   DW_AT_decl_column : 12
    <411>   DW_AT_type        : <0xac>
    <415>   DW_AT_data_member_location: 16
 <2><416>: Abbrev Number: 3 (DW_TAG_member)
    <417>   DW_AT_name        : (indirect string, offset: 0x1c209): LSIState
    <41b>   DW_AT_decl_file   : 8
    <41c>   DW_AT_decl_line   : 66
    <41d>   DW_AT_decl_column : 12
    <41e>   DW_AT_type        : <0xac>
    <422>   DW_AT_data_member_location: 20
 <2><423>: Abbrev Number: 22 (DW_TAG_member)
    <424>   DW_AT_name        : PLL
    <428>   DW_AT_decl_file   : 8
    <429>   DW_AT_decl_line   : 69
    <42a>   DW_AT_decl_column : 22
    <42b>   DW_AT_type        : <0x3c1>
    <42f>   DW_AT_data_member_location: 24
 <2><430>: Abbrev Number: 0
 <1><431>: Abbrev Number: 4 (DW_TAG_typedef)
    <432>   DW_AT_name        : (indirect string, offset: 0x63253): RCC_OscInitTypeDef
    <436>   DW_AT_decl_file   : 8
    <437>   DW_AT_decl_line   : 70
    <438>   DW_AT_decl_column : 3
    <439>   DW_AT_type        : <0x3cd>
 <1><43d>: Abbrev Number: 13 (DW_TAG_const_type)
    <43e>   DW_AT_type        : <0x431>
 <1><442>: Abbrev Number: 11 (DW_TAG_structure_type)
    <443>   DW_AT_byte_size   : 20
    <444>   DW_AT_decl_file   : 8
    <445>   DW_AT_decl_line   : 75
    <446>   DW_AT_decl_column : 9
    <446>   DW_AT_sibling     : <0x48c>
 <2><44a>: Abbrev Number: 3 (DW_TAG_member)
    <44b>   DW_AT_name        : (indirect string, offset: 0x1705a): ClockType
    <44f>   DW_AT_decl_file   : 8
    <450>   DW_AT_decl_line   : 77
    <451>   DW_AT_decl_column : 12
    <452>   DW_AT_type        : <0xac>
    <456>   DW_AT_data_member_location: 0
 <2><457>: Abbrev Number: 3 (DW_TAG_member)
    <458>   DW_AT_name        : (indirect string, offset: 0x3807a): SYSCLKSource
    <45c>   DW_AT_decl_file   : 8
    <45d>   DW_AT_decl_line   : 80
    <45e>   DW_AT_decl_column : 12
    <45f>   DW_AT_type        : <0xac>
    <463>   DW_AT_data_member_location: 4
 <2><464>: Abbrev Number: 3 (DW_TAG_member)
    <465>   DW_AT_name        : (indirect string, offset: 0x5ee8): AHBCLKDivider
    <469>   DW_AT_decl_file   : 8
    <46a>   DW_AT_decl_line   : 83
    <46b>   DW_AT_decl_column : 12
    <46c>   DW_AT_type        : <0xac>
    <470>   DW_AT_data_member_location: 8
 <2><471>: Abbrev Number: 3 (DW_TAG_member)
    <472>   DW_AT_name        : (indirect string, offset: 0x418d9): APB1CLKDivider
    <476>   DW_AT_decl_file   : 8
    <477>   DW_AT_decl_line   : 86
    <478>   DW_AT_decl_column : 12
    <479>   DW_AT_type        : <0xac>
    <47d>   DW_AT_data_member_location: 12
 <2><47e>: Abbrev Number: 3 (DW_TAG_member)
    <47f>   DW_AT_name        : (indirect string, offset: 0x10468): APB2CLKDivider
    <483>   DW_AT_decl_file   : 8
    <484>   DW_AT_decl_line   : 89
    <485>   DW_AT_decl_column : 12
    <486>   DW_AT_type        : <0xac>
    <48a>   DW_AT_data_member_location: 16
 <2><48b>: Abbrev Number: 0
 <1><48c>: Abbrev Number: 4 (DW_TAG_typedef)
    <48d>   DW_AT_name        : (indirect string, offset: 0x7b17f): RCC_ClkInitTypeDef
    <491>   DW_AT_decl_file   : 8
    <492>   DW_AT_decl_line   : 92
    <493>   DW_AT_decl_column : 3
    <494>   DW_AT_type        : <0x442>
 <1><498>: Abbrev Number: 13 (DW_TAG_const_type)
    <499>   DW_AT_type        : <0x48c>
 <1><49d>: Abbrev Number: 11 (DW_TAG_structure_type)
    <49e>   DW_AT_byte_size   : 20
    <49f>   DW_AT_decl_file   : 9
    <4a0>   DW_AT_decl_line   : 46
    <4a1>   DW_AT_decl_column : 9
    <4a1>   DW_AT_sibling     : <0x4e7>
 <2><4a5>: Abbrev Number: 22 (DW_TAG_member)
    <4a6>   DW_AT_name        : Pin
    <4aa>   DW_AT_decl_file   : 9
    <4ab>   DW_AT_decl_line   : 48
    <4ac>   DW_AT_decl_column : 12
    <4ad>   DW_AT_type        : <0xac>
    <4b1>   DW_AT_data_member_location: 0
 <2><4b2>: Abbrev Number: 3 (DW_TAG_member)
    <4b3>   DW_AT_name        : (indirect string, offset: 0x8b6c1): Mode
    <4b7>   DW_AT_decl_file   : 9
    <4b8>   DW_AT_decl_line   : 51
    <4b9>   DW_AT_decl_column : 12
    <4ba>   DW_AT_type        : <0xac>
    <4be>   DW_AT_data_member_location: 4
 <2><4bf>: Abbrev Number: 3 (DW_TAG_member)
    <4c0>   DW_AT_name        : (indirect string, offset: 0x3a0e8): Pull
    <4c4>   DW_AT_decl_file   : 9
    <4c5>   DW_AT_decl_line   : 54
    <4c6>   DW_AT_decl_column : 12
    <4c7>   DW_AT_type        : <0xac>
    <4cb>   DW_AT_data_member_location: 8
 <2><4cc>: Abbrev Number: 3 (DW_TAG_member)
    <4cd>   DW_AT_name        : (indirect string, offset: 0x60301): Speed
    <4d1>   DW_AT_decl_file   : 9
    <4d2>   DW_AT_decl_line   : 57
    <4d3>   DW_AT_decl_column : 12
    <4d4>   DW_AT_type        : <0xac>
    <4d8>   DW_AT_data_member_location: 12
 <2><4d9>: Abbrev Number: 3 (DW_TAG_member)
    <4da>   DW_AT_name        : (indirect string, offset: 0x223ff): Alternate
    <4de>   DW_AT_decl_file   : 9
    <4df>   DW_AT_decl_line   : 60
    <4e0>   DW_AT_decl_column : 12
    <4e1>   DW_AT_type        : <0xac>
    <4e5>   DW_AT_data_member_location: 16
 <2><4e6>: Abbrev Number: 0
 <1><4e7>: Abbrev Number: 4 (DW_TAG_typedef)
    <4e8>   DW_AT_name        : (indirect string, offset: 0x7c3f5): GPIO_InitTypeDef
    <4ec>   DW_AT_decl_file   : 9
    <4ed>   DW_AT_decl_line   : 62
    <4ee>   DW_AT_decl_column : 2
    <4ef>   DW_AT_type        : <0x49d>
 <1><4f3>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <4f4>   DW_AT_encoding    : 7	(unsigned)
    <4f5>   DW_AT_byte_size   : 1
    <4f6>   DW_AT_type        : <0x3d>
    <4fa>   DW_AT_decl_file   : 9
    <4fb>   DW_AT_decl_line   : 68
    <4fc>   DW_AT_decl_column : 1
    <4fd>   DW_AT_sibling     : <0x50e>
 <2><501>: Abbrev Number: 1 (DW_TAG_enumerator)
    <502>   DW_AT_name        : (indirect string, offset: 0x61c4e): GPIO_PIN_RESET
    <506>   DW_AT_const_value : 0
 <2><507>: Abbrev Number: 1 (DW_TAG_enumerator)
    <508>   DW_AT_name        : (indirect string, offset: 0x251a1): GPIO_PIN_SET
    <50c>   DW_AT_const_value : 1
 <2><50d>: Abbrev Number: 0
 <1><50e>: Abbrev Number: 4 (DW_TAG_typedef)
    <50f>   DW_AT_name        : (indirect string, offset: 0x4708e): GPIO_PinState
    <513>   DW_AT_decl_file   : 9
    <514>   DW_AT_decl_line   : 71
    <515>   DW_AT_decl_column : 2
    <516>   DW_AT_type        : <0x4f3>
 <1><51a>: Abbrev Number: 29 (DW_TAG_pointer_type)
    <51b>   DW_AT_byte_size   : 4
 <1><51c>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <51d>   DW_AT_byte_size   : 4
    <51d>   DW_AT_type        : <0x521>
 <1><521>: Abbrev Number: 30 (DW_TAG_subroutine_type)
    <522>   DW_AT_prototyped  : 1
    <522>   DW_AT_sibling     : <0x52c>
 <2><526>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <527>   DW_AT_type        : <0x51a>
 <2><52b>: Abbrev Number: 0
 <1><52c>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <52d>   DW_AT_byte_size   : 4
    <52d>   DW_AT_type        : <0x538>
 <1><531>: Abbrev Number: 6 (DW_TAG_base_type)
    <532>   DW_AT_byte_size   : 1
    <533>   DW_AT_encoding    : 8	(unsigned char)
    <534>   DW_AT_name        : (indirect string, offset: 0x7e745): char
 <1><538>: Abbrev Number: 13 (DW_TAG_const_type)
    <539>   DW_AT_type        : <0x531>
 <1><53d>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <53e>   DW_AT_encoding    : 5	(signed)
    <53f>   DW_AT_byte_size   : 4
    <540>   DW_AT_type        : <0x86>
    <544>   DW_AT_decl_file   : 10
    <545>   DW_AT_decl_line   : 82
    <546>   DW_AT_decl_column : 14
    <547>   DW_AT_sibling     : <0x689>
 <2><54b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <54c>   DW_AT_name        : (indirect string, offset: 0x2fb87): osPriorityNone
    <550>   DW_AT_const_value : 0
 <2><551>: Abbrev Number: 1 (DW_TAG_enumerator)
    <552>   DW_AT_name        : (indirect string, offset: 0x456ca): osPriorityIdle
    <556>   DW_AT_const_value : 1
 <2><557>: Abbrev Number: 1 (DW_TAG_enumerator)
    <558>   DW_AT_name        : (indirect string, offset: 0x4198b): osPriorityLow
    <55c>   DW_AT_const_value : 8
 <2><55d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <55e>   DW_AT_name        : (indirect string, offset: 0x56e99): osPriorityLow1
    <562>   DW_AT_const_value : 9
 <2><563>: Abbrev Number: 1 (DW_TAG_enumerator)
    <564>   DW_AT_name        : (indirect string, offset: 0x56ea8): osPriorityLow2
    <568>   DW_AT_const_value : 10
 <2><569>: Abbrev Number: 1 (DW_TAG_enumerator)
    <56a>   DW_AT_name        : (indirect string, offset: 0x56eb7): osPriorityLow3
    <56e>   DW_AT_const_value : 11
 <2><56f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <570>   DW_AT_name        : (indirect string, offset: 0x22e8f): osPriorityLow4
    <574>   DW_AT_const_value : 12
 <2><575>: Abbrev Number: 1 (DW_TAG_enumerator)
    <576>   DW_AT_name        : (indirect string, offset: 0x56f0e): osPriorityLow5
    <57a>   DW_AT_const_value : 13
 <2><57b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <57c>   DW_AT_name        : (indirect string, offset: 0x22f4a): osPriorityLow6
    <580>   DW_AT_const_value : 14
 <2><581>: Abbrev Number: 1 (DW_TAG_enumerator)
    <582>   DW_AT_name        : (indirect string, offset: 0x56f44): osPriorityLow7
    <586>   DW_AT_const_value : 15
 <2><587>: Abbrev Number: 1 (DW_TAG_enumerator)
    <588>   DW_AT_name        : (indirect string, offset: 0x4b06a): osPriorityBelowNormal
    <58c>   DW_AT_const_value : 16
 <2><58d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <58e>   DW_AT_name        : (indirect string, offset: 0x68d70): osPriorityBelowNormal1
    <592>   DW_AT_const_value : 17
 <2><593>: Abbrev Number: 1 (DW_TAG_enumerator)
    <594>   DW_AT_name        : (indirect string, offset: 0x68d87): osPriorityBelowNormal2
    <598>   DW_AT_const_value : 18
 <2><599>: Abbrev Number: 1 (DW_TAG_enumerator)
    <59a>   DW_AT_name        : (indirect string, offset: 0x68d9e): osPriorityBelowNormal3
    <59e>   DW_AT_const_value : 19
 <2><59f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5a0>   DW_AT_name        : (indirect string, offset: 0x68db5): osPriorityBelowNormal4
    <5a4>   DW_AT_const_value : 20
 <2><5a5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5a6>   DW_AT_name        : (indirect string, offset: 0x68dcc): osPriorityBelowNormal5
    <5aa>   DW_AT_const_value : 21
 <2><5ab>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5ac>   DW_AT_name        : (indirect string, offset: 0x68de3): osPriorityBelowNormal6
    <5b0>   DW_AT_const_value : 22
 <2><5b1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5b2>   DW_AT_name        : (indirect string, offset: 0x68dfa): osPriorityBelowNormal7
    <5b6>   DW_AT_const_value : 23
 <2><5b7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5b8>   DW_AT_name        : (indirect string, offset: 0x30bcb): osPriorityNormal
    <5bc>   DW_AT_const_value : 24
 <2><5bd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5be>   DW_AT_name        : (indirect string, offset: 0x55ea3): osPriorityNormal1
    <5c2>   DW_AT_const_value : 25
 <2><5c3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5c4>   DW_AT_name        : (indirect string, offset: 0x55eb5): osPriorityNormal2
    <5c8>   DW_AT_const_value : 26
 <2><5c9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5ca>   DW_AT_name        : (indirect string, offset: 0x55ec7): osPriorityNormal3
    <5ce>   DW_AT_const_value : 27
 <2><5cf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5d0>   DW_AT_name        : (indirect string, offset: 0x55ed9): osPriorityNormal4
    <5d4>   DW_AT_const_value : 28
 <2><5d5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5d6>   DW_AT_name        : (indirect string, offset: 0x9b34): osPriorityNormal5
    <5da>   DW_AT_const_value : 29
 <2><5db>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5dc>   DW_AT_name        : (indirect string, offset: 0x55f11): osPriorityNormal6
    <5e0>   DW_AT_const_value : 30
 <2><5e1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5e2>   DW_AT_name        : (indirect string, offset: 0x55f23): osPriorityNormal7
    <5e6>   DW_AT_const_value : 31
 <2><5e7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5e8>   DW_AT_name        : (indirect string, offset: 0x466cb): osPriorityAboveNormal
    <5ec>   DW_AT_const_value : 32
 <2><5ed>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5ee>   DW_AT_name        : (indirect string, offset: 0x57fac): osPriorityAboveNormal1
    <5f2>   DW_AT_const_value : 33
 <2><5f3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5f4>   DW_AT_name        : (indirect string, offset: 0x143c5): osPriorityAboveNormal2
    <5f8>   DW_AT_const_value : 34
 <2><5f9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5fa>   DW_AT_name        : (indirect string, offset: 0x57fdf): osPriorityAboveNormal3
    <5fe>   DW_AT_const_value : 35
 <2><5ff>: Abbrev Number: 1 (DW_TAG_enumerator)
    <600>   DW_AT_name        : (indirect string, offset: 0x1440f): osPriorityAboveNormal4
    <604>   DW_AT_const_value : 36
 <2><605>: Abbrev Number: 1 (DW_TAG_enumerator)
    <606>   DW_AT_name        : (indirect string, offset: 0x58020): osPriorityAboveNormal5
    <60a>   DW_AT_const_value : 37
 <2><60b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <60c>   DW_AT_name        : (indirect string, offset: 0x58037): osPriorityAboveNormal6
    <610>   DW_AT_const_value : 38
 <2><611>: Abbrev Number: 1 (DW_TAG_enumerator)
    <612>   DW_AT_name        : (indirect string, offset: 0x5804e): osPriorityAboveNormal7
    <616>   DW_AT_const_value : 39
 <2><617>: Abbrev Number: 1 (DW_TAG_enumerator)
    <618>   DW_AT_name        : (indirect string, offset: 0x7d62e): osPriorityHigh
    <61c>   DW_AT_const_value : 40
 <2><61d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <61e>   DW_AT_name        : (indirect string, offset: 0x26b78): osPriorityHigh1
    <622>   DW_AT_const_value : 41
 <2><623>: Abbrev Number: 1 (DW_TAG_enumerator)
    <624>   DW_AT_name        : (indirect string, offset: 0x30328): osPriorityHigh2
    <628>   DW_AT_const_value : 42
 <2><629>: Abbrev Number: 1 (DW_TAG_enumerator)
    <62a>   DW_AT_name        : (indirect string, offset: 0x26ba1): osPriorityHigh3
    <62e>   DW_AT_const_value : 43
 <2><62f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <630>   DW_AT_name        : (indirect string, offset: 0x3038d): osPriorityHigh4
    <634>   DW_AT_const_value : 44
 <2><635>: Abbrev Number: 1 (DW_TAG_enumerator)
    <636>   DW_AT_name        : (indirect string, offset: 0x303d4): osPriorityHigh5
    <63a>   DW_AT_const_value : 45
 <2><63b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <63c>   DW_AT_name        : (indirect string, offset: 0x4285d): osPriorityHigh6
    <640>   DW_AT_const_value : 46
 <2><641>: Abbrev Number: 1 (DW_TAG_enumerator)
    <642>   DW_AT_name        : (indirect string, offset: 0x26c34): osPriorityHigh7
    <646>   DW_AT_const_value : 47
 <2><647>: Abbrev Number: 1 (DW_TAG_enumerator)
    <648>   DW_AT_name        : (indirect string, offset: 0x28667): osPriorityRealtime
    <64c>   DW_AT_const_value : 48
 <2><64d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <64e>   DW_AT_name        : (indirect string, offset: 0x1b149): osPriorityRealtime1
    <652>   DW_AT_const_value : 49
 <2><653>: Abbrev Number: 1 (DW_TAG_enumerator)
    <654>   DW_AT_name        : (indirect string, offset: 0x1b15d): osPriorityRealtime2
    <658>   DW_AT_const_value : 50
 <2><659>: Abbrev Number: 1 (DW_TAG_enumerator)
    <65a>   DW_AT_name        : (indirect string, offset: 0x365b7): osPriorityRealtime3
    <65e>   DW_AT_const_value : 51
 <2><65f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <660>   DW_AT_name        : (indirect string, offset: 0x1b1a6): osPriorityRealtime4
    <664>   DW_AT_const_value : 52
 <2><665>: Abbrev Number: 1 (DW_TAG_enumerator)
    <666>   DW_AT_name        : (indirect string, offset: 0x1b1ba): osPriorityRealtime5
    <66a>   DW_AT_const_value : 53
 <2><66b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <66c>   DW_AT_name        : (indirect string, offset: 0x51538): osPriorityRealtime6
    <670>   DW_AT_const_value : 54
 <2><671>: Abbrev Number: 1 (DW_TAG_enumerator)
    <672>   DW_AT_name        : (indirect string, offset: 0x1b1ef): osPriorityRealtime7
    <676>   DW_AT_const_value : 55
 <2><677>: Abbrev Number: 1 (DW_TAG_enumerator)
    <678>   DW_AT_name        : (indirect string, offset: 0x49762): osPriorityISR
    <67c>   DW_AT_const_value : 56
 <2><67d>: Abbrev Number: 9 (DW_TAG_enumerator)
    <67e>   DW_AT_name        : (indirect string, offset: 0x4e347): osPriorityError
    <682>   DW_AT_const_value : -1
 <2><683>: Abbrev Number: 23 (DW_TAG_enumerator)
    <684>   DW_AT_name        : (indirect string, offset: 0x33125): osPriorityReserved
    <688>   DW_AT_const_value : 2147483647
 <2><688>: Abbrev Number: 0
 <1><689>: Abbrev Number: 4 (DW_TAG_typedef)
    <68a>   DW_AT_name        : (indirect string, offset: 0x4258c): osPriority_t
    <68e>   DW_AT_decl_file   : 10
    <68f>   DW_AT_decl_line   : 136
    <690>   DW_AT_decl_column : 3
    <691>   DW_AT_type        : <0x53d>
 <1><695>: Abbrev Number: 4 (DW_TAG_typedef)
    <696>   DW_AT_name        : (indirect string, offset: 0x57c17): osThreadFunc_t
    <69a>   DW_AT_decl_file   : 10
    <69b>   DW_AT_decl_line   : 139
    <69c>   DW_AT_decl_column : 16
    <69d>   DW_AT_type        : <0x51c>
 <1><6a1>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <6a2>   DW_AT_encoding    : 5	(signed)
    <6a3>   DW_AT_byte_size   : 4
    <6a4>   DW_AT_type        : <0x86>
    <6a8>   DW_AT_decl_file   : 10
    <6a9>   DW_AT_decl_line   : 176
    <6aa>   DW_AT_decl_column : 14
    <6ab>   DW_AT_sibling     : <0x6df>
 <2><6af>: Abbrev Number: 1 (DW_TAG_enumerator)
    <6b0>   DW_AT_name        : (indirect string, offset: 0x59271): osOK
    <6b4>   DW_AT_const_value : 0
 <2><6b5>: Abbrev Number: 9 (DW_TAG_enumerator)
    <6b6>   DW_AT_name        : (indirect string, offset: 0x7e401): osError
    <6ba>   DW_AT_const_value : -1
 <2><6bb>: Abbrev Number: 9 (DW_TAG_enumerator)
    <6bc>   DW_AT_name        : (indirect string, offset: 0xe2fb): osErrorTimeout
    <6c0>   DW_AT_const_value : -2
 <2><6c1>: Abbrev Number: 9 (DW_TAG_enumerator)
    <6c2>   DW_AT_name        : (indirect string, offset: 0x46cfc): osErrorResource
    <6c6>   DW_AT_const_value : -3
 <2><6c7>: Abbrev Number: 9 (DW_TAG_enumerator)
    <6c8>   DW_AT_name        : (indirect string, offset: 0x64530): osErrorParameter
    <6cc>   DW_AT_const_value : -4
 <2><6cd>: Abbrev Number: 9 (DW_TAG_enumerator)
    <6ce>   DW_AT_name        : (indirect string, offset: 0x470a5): osErrorNoMemory
    <6d2>   DW_AT_const_value : -5
 <2><6d3>: Abbrev Number: 9 (DW_TAG_enumerator)
    <6d4>   DW_AT_name        : (indirect string, offset: 0x27d0f): osErrorISR
    <6d8>   DW_AT_const_value : -6
 <2><6d9>: Abbrev Number: 23 (DW_TAG_enumerator)
    <6da>   DW_AT_name        : (indirect string, offset: 0xdf57): osStatusReserved
    <6de>   DW_AT_const_value : 2147483647
 <2><6de>: Abbrev Number: 0
 <1><6df>: Abbrev Number: 4 (DW_TAG_typedef)
    <6e0>   DW_AT_name        : (indirect string, offset: 0xd8e0): osStatus_t
    <6e4>   DW_AT_decl_file   : 10
    <6e5>   DW_AT_decl_line   : 185
    <6e6>   DW_AT_decl_column : 3
    <6e7>   DW_AT_type        : <0x6a1>
 <1><6eb>: Abbrev Number: 4 (DW_TAG_typedef)
    <6ec>   DW_AT_name        : (indirect string, offset: 0x3b422): osThreadId_t
    <6f0>   DW_AT_decl_file   : 10
    <6f1>   DW_AT_decl_line   : 189
    <6f2>   DW_AT_decl_column : 15
    <6f3>   DW_AT_type        : <0x51a>
 <1><6f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <6f8>   DW_AT_name        : (indirect string, offset: 0x5352f): TZ_ModuleId_t
    <6fc>   DW_AT_decl_file   : 10
    <6fd>   DW_AT_decl_line   : 213
    <6fe>   DW_AT_decl_column : 18
    <6ff>   DW_AT_type        : <0xac>
 <1><703>: Abbrev Number: 11 (DW_TAG_structure_type)
    <704>   DW_AT_byte_size   : 36
    <705>   DW_AT_decl_file   : 10
    <706>   DW_AT_decl_line   : 218
    <707>   DW_AT_decl_column : 9
    <707>   DW_AT_sibling     : <0x781>
 <2><70b>: Abbrev Number: 3 (DW_TAG_member)
    <70c>   DW_AT_name        : (indirect string, offset: 0x5cb86): name
    <710>   DW_AT_decl_file   : 10
    <711>   DW_AT_decl_line   : 219
    <712>   DW_AT_decl_column : 33
    <713>   DW_AT_type        : <0x52c>
    <717>   DW_AT_data_member_location: 0
 <2><718>: Abbrev Number: 3 (DW_TAG_member)
    <719>   DW_AT_name        : (indirect string, offset: 0x75713): attr_bits
    <71d>   DW_AT_decl_file   : 10
    <71e>   DW_AT_decl_line   : 220
    <71f>   DW_AT_decl_column : 28
    <720>   DW_AT_type        : <0xac>
    <724>   DW_AT_data_member_location: 4
 <2><725>: Abbrev Number: 3 (DW_TAG_member)
    <726>   DW_AT_name        : (indirect string, offset: 0x3f46a): cb_mem
    <72a>   DW_AT_decl_file   : 10
    <72b>   DW_AT_decl_line   : 221
    <72c>   DW_AT_decl_column : 30
    <72d>   DW_AT_type        : <0x51a>
    <731>   DW_AT_data_member_location: 8
 <2><732>: Abbrev Number: 3 (DW_TAG_member)
    <733>   DW_AT_name        : (indirect string, offset: 0x4f472): cb_size
    <737>   DW_AT_decl_file   : 10
    <738>   DW_AT_decl_line   : 222
    <739>   DW_AT_decl_column : 30
    <73a>   DW_AT_type        : <0xac>
    <73e>   DW_AT_data_member_location: 12
 <2><73f>: Abbrev Number: 3 (DW_TAG_member)
    <740>   DW_AT_name        : (indirect string, offset: 0x69312): stack_mem
    <744>   DW_AT_decl_file   : 10
    <745>   DW_AT_decl_line   : 223
    <746>   DW_AT_decl_column : 27
    <747>   DW_AT_type        : <0x51a>
    <74b>   DW_AT_data_member_location: 16
 <2><74c>: Abbrev Number: 3 (DW_TAG_member)
    <74d>   DW_AT_name        : (indirect string, offset: 0x33f12): stack_size
    <751>   DW_AT_decl_file   : 10
    <752>   DW_AT_decl_line   : 224
    <753>   DW_AT_decl_column : 27
    <754>   DW_AT_type        : <0xac>
    <758>   DW_AT_data_member_location: 20
 <2><759>: Abbrev Number: 3 (DW_TAG_member)
    <75a>   DW_AT_name        : (indirect string, offset: 0x25b0e): priority
    <75e>   DW_AT_decl_file   : 10
    <75f>   DW_AT_decl_line   : 225
    <760>   DW_AT_decl_column : 29
    <761>   DW_AT_type        : <0x689>
    <765>   DW_AT_data_member_location: 24
 <2><766>: Abbrev Number: 3 (DW_TAG_member)
    <767>   DW_AT_name        : (indirect string, offset: 0x3257b): tz_module
    <76b>   DW_AT_decl_file   : 10
    <76c>   DW_AT_decl_line   : 226
    <76d>   DW_AT_decl_column : 28
    <76e>   DW_AT_type        : <0x6f7>
    <772>   DW_AT_data_member_location: 28
 <2><773>: Abbrev Number: 3 (DW_TAG_member)
    <774>   DW_AT_name        : (indirect string, offset: 0x3f64a): reserved
    <778>   DW_AT_decl_file   : 10
    <779>   DW_AT_decl_line   : 227
    <77a>   DW_AT_decl_column : 29
    <77b>   DW_AT_type        : <0xac>
    <77f>   DW_AT_data_member_location: 32
 <2><780>: Abbrev Number: 0
 <1><781>: Abbrev Number: 4 (DW_TAG_typedef)
    <782>   DW_AT_name        : (indirect string, offset: 0x28634): osThreadAttr_t
    <786>   DW_AT_decl_file   : 10
    <787>   DW_AT_decl_line   : 228
    <788>   DW_AT_decl_column : 3
    <789>   DW_AT_type        : <0x703>
 <1><78d>: Abbrev Number: 13 (DW_TAG_const_type)
    <78e>   DW_AT_type        : <0x781>
 <1><792>: Abbrev Number: 14 (DW_TAG_variable)
    <793>   DW_AT_name        : (indirect string, offset: 0x2184e): defaultTaskHandle
    <797>   DW_AT_decl_file   : 1
    <797>   DW_AT_decl_line   : 45
    <798>   DW_AT_decl_column : 14
    <799>   DW_AT_type        : <0x6eb>
    <79d>   DW_AT_external    : 1
    <79d>   DW_AT_location    : 5 byte block: 3 2c 0 0 20 	(DW_OP_addr: 2000002c)
 <1><7a3>: Abbrev Number: 14 (DW_TAG_variable)
    <7a4>   DW_AT_name        : (indirect string, offset: 0x2806b): defaultTask_attributes
    <7a8>   DW_AT_decl_file   : 1
    <7a8>   DW_AT_decl_line   : 46
    <7a9>   DW_AT_decl_column : 22
    <7aa>   DW_AT_type        : <0x78d>
    <7ae>   DW_AT_external    : 1
    <7ae>   DW_AT_location    : 5 byte block: 3 74 42 0 8 	(DW_OP_addr: 8004274)
 <1><7b4>: Abbrev Number: 14 (DW_TAG_variable)
    <7b5>   DW_AT_name        : (indirect string, offset: 0x2aab5): myTask02Handle
    <7b9>   DW_AT_decl_file   : 1
    <7b9>   DW_AT_decl_line   : 52
    <7ba>   DW_AT_decl_column : 14
    <7bb>   DW_AT_type        : <0x6eb>
    <7bf>   DW_AT_external    : 1
    <7bf>   DW_AT_location    : 5 byte block: 3 30 0 0 20 	(DW_OP_addr: 20000030)
 <1><7c5>: Abbrev Number: 14 (DW_TAG_variable)
    <7c6>   DW_AT_name        : (indirect string, offset: 0x7c887): myTask02_attributes
    <7ca>   DW_AT_decl_file   : 1
    <7ca>   DW_AT_decl_line   : 53
    <7cb>   DW_AT_decl_column : 22
    <7cc>   DW_AT_type        : <0x78d>
    <7d0>   DW_AT_external    : 1
    <7d0>   DW_AT_location    : 5 byte block: 3 98 42 0 8 	(DW_OP_addr: 8004298)
 <1><7d6>: Abbrev Number: 20 (DW_TAG_subprogram)
    <7d7>   DW_AT_external    : 1
    <7d7>   DW_AT_name        : (indirect string, offset: 0x78990): HAL_GPIO_TogglePin
    <7db>   DW_AT_decl_file   : 9
    <7db>   DW_AT_decl_line   : 236
    <7dc>   DW_AT_decl_column : 6
    <7dd>   DW_AT_prototyped  : 1
    <7dd>   DW_AT_declaration : 1
    <7dd>   DW_AT_sibling     : <0x7ec>
 <2><7e1>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7e2>   DW_AT_type        : <0x7ec>
 <2><7e6>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <7e7>   DW_AT_type        : <0xa0>
 <2><7eb>: Abbrev Number: 0
 <1><7ec>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <7ed>   DW_AT_byte_size   : 4
    <7ed>   DW_AT_type        : <0x167>
 <1><7f1>: Abbrev Number: 15 (DW_TAG_subprogram)
    <7f2>   DW_AT_external    : 1
    <7f2>   DW_AT_name        : (indirect string, offset: 0x740b9): osDelay
    <7f6>   DW_AT_decl_file   : 10
    <7f7>   DW_AT_decl_line   : 459
    <7f9>   DW_AT_decl_column : 12
    <7fa>   DW_AT_prototyped  : 1
    <7fa>   DW_AT_type        : <0x6df>
    <7fe>   DW_AT_declaration : 1
    <7fe>   DW_AT_sibling     : <0x808>
 <2><802>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <803>   DW_AT_type        : <0xac>
 <2><807>: Abbrev Number: 0
 <1><808>: Abbrev Number: 20 (DW_TAG_subprogram)
    <809>   DW_AT_external    : 1
    <809>   DW_AT_name        : (indirect string, offset: 0x8fc4): HAL_GPIO_Init
    <80d>   DW_AT_decl_file   : 9
    <80d>   DW_AT_decl_line   : 224
    <80e>   DW_AT_decl_column : 7
    <80f>   DW_AT_prototyped  : 1
    <80f>   DW_AT_declaration : 1
    <80f>   DW_AT_sibling     : <0x81e>
 <2><813>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <814>   DW_AT_type        : <0x7ec>
 <2><818>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <819>   DW_AT_type        : <0x81e>
 <2><81d>: Abbrev Number: 0
 <1><81e>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <81f>   DW_AT_byte_size   : 4
    <81f>   DW_AT_type        : <0x4e7>
 <1><823>: Abbrev Number: 20 (DW_TAG_subprogram)
    <824>   DW_AT_external    : 1
    <824>   DW_AT_name        : (indirect string, offset: 0x7118): HAL_GPIO_WritePin
    <828>   DW_AT_decl_file   : 9
    <828>   DW_AT_decl_line   : 235
    <829>   DW_AT_decl_column : 6
    <82a>   DW_AT_prototyped  : 1
    <82a>   DW_AT_declaration : 1
    <82a>   DW_AT_sibling     : <0x83e>
 <2><82e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <82f>   DW_AT_type        : <0x7ec>
 <2><833>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <834>   DW_AT_type        : <0xa0>
 <2><838>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <839>   DW_AT_type        : <0x50e>
 <2><83d>: Abbrev Number: 0
 <1><83e>: Abbrev Number: 15 (DW_TAG_subprogram)
    <83f>   DW_AT_external    : 1
    <83f>   DW_AT_name        : (indirect string, offset: 0x3485a): HAL_RCC_ClockConfig
    <843>   DW_AT_decl_file   : 8
    <844>   DW_AT_decl_line   : 1246
    <846>   DW_AT_decl_column : 19
    <847>   DW_AT_prototyped  : 1
    <847>   DW_AT_type        : <0x35e>
    <84b>   DW_AT_declaration : 1
    <84b>   DW_AT_sibling     : <0x85a>
 <2><84f>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <850>   DW_AT_type        : <0x85a>
 <2><854>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <855>   DW_AT_type        : <0xac>
 <2><859>: Abbrev Number: 0
 <1><85a>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <85b>   DW_AT_byte_size   : 4
    <85b>   DW_AT_type        : <0x498>
 <1><85f>: Abbrev Number: 15 (DW_TAG_subprogram)
    <860>   DW_AT_external    : 1
    <860>   DW_AT_name        : (indirect string, offset: 0x22d5b): HAL_RCC_OscConfig
    <864>   DW_AT_decl_file   : 8
    <865>   DW_AT_decl_line   : 1245
    <867>   DW_AT_decl_column : 19
    <868>   DW_AT_prototyped  : 1
    <868>   DW_AT_type        : <0x35e>
    <86c>   DW_AT_declaration : 1
    <86c>   DW_AT_sibling     : <0x876>
 <2><870>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <871>   DW_AT_type        : <0x876>
 <2><875>: Abbrev Number: 0
 <1><876>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <877>   DW_AT_byte_size   : 4
    <877>   DW_AT_type        : <0x43d>
 <1><87b>: Abbrev Number: 24 (DW_TAG_subprogram)
    <87c>   DW_AT_external    : 1
    <87c>   DW_AT_name        : (indirect string, offset: 0x52542): osKernelStart
    <880>   DW_AT_decl_file   : 10
    <880>   DW_AT_decl_line   : 302
    <882>   DW_AT_decl_column : 12
    <882>   DW_AT_prototyped  : 1
    <882>   DW_AT_type        : <0x6df>
    <886>   DW_AT_declaration : 1
 <1><886>: Abbrev Number: 15 (DW_TAG_subprogram)
    <887>   DW_AT_external    : 1
    <887>   DW_AT_name        : (indirect string, offset: 0x57a4): osThreadNew
    <88b>   DW_AT_decl_file   : 10
    <88c>   DW_AT_decl_line   : 349
    <88e>   DW_AT_decl_column : 14
    <88f>   DW_AT_prototyped  : 1
    <88f>   DW_AT_type        : <0x6eb>
    <893>   DW_AT_declaration : 1
    <893>   DW_AT_sibling     : <0x8a7>
 <2><897>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <898>   DW_AT_type        : <0x695>
 <2><89c>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <89d>   DW_AT_type        : <0x51a>
 <2><8a1>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <8a2>   DW_AT_type        : <0x8a7>
 <2><8a6>: Abbrev Number: 0
 <1><8a7>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <8a8>   DW_AT_byte_size   : 4
    <8a8>   DW_AT_type        : <0x78d>
 <1><8ac>: Abbrev Number: 24 (DW_TAG_subprogram)
    <8ad>   DW_AT_external    : 1
    <8ad>   DW_AT_name        : (indirect string, offset: 0x4eef1): osKernelInitialize
    <8b1>   DW_AT_decl_file   : 10
    <8b1>   DW_AT_decl_line   : 287
    <8b3>   DW_AT_decl_column : 12
    <8b3>   DW_AT_prototyped  : 1
    <8b3>   DW_AT_type        : <0x6df>
    <8b7>   DW_AT_declaration : 1
 <1><8b7>: Abbrev Number: 31 (DW_TAG_subprogram)
    <8b8>   DW_AT_external    : 1
    <8b8>   DW_AT_name        : (indirect string, offset: 0x4128c): HAL_Init
    <8bc>   DW_AT_decl_file   : 11
    <8bd>   DW_AT_decl_line   : 219
    <8be>   DW_AT_decl_column : 19
    <8bf>   DW_AT_prototyped  : 1
    <8bf>   DW_AT_type        : <0x35e>
    <8c3>   DW_AT_declaration : 1
 <1><8c3>: Abbrev Number: 32 (DW_TAG_subprogram)
    <8c4>   DW_AT_external    : 1
    <8c4>   DW_AT_name        : (indirect string, offset: 0x6493f): Error_Handler
    <8c8>   DW_AT_decl_file   : 1
    <8c9>   DW_AT_decl_line   : 276
    <8cb>   DW_AT_decl_column : 6
    <8cc>   DW_AT_prototyped  : 1
    <8cc>   DW_AT_low_pc      : 0x80006b8
    <8d0>   DW_AT_high_pc     : 0xc
    <8d4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8d6>   DW_AT_call_all_calls: 1
    <8d6>   DW_AT_sibling     : <0x8ec>
 <2><8da>: Abbrev Number: 33 (DW_TAG_inlined_subroutine)
    <8db>   DW_AT_abstract_origin: <0x9f3>
    <8df>   DW_AT_low_pc      : 0x80006bc
    <8e3>   DW_AT_high_pc     : 0x4
    <8e7>   DW_AT_call_file   : 1
    <8e8>   DW_AT_call_line   : 280
    <8ea>   DW_AT_call_column : 3
 <2><8eb>: Abbrev Number: 0
 <1><8ec>: Abbrev Number: 34 (DW_TAG_subprogram)
    <8ed>   DW_AT_external    : 1
    <8ed>   DW_AT_name        : (indirect string, offset: 0x40b9a): StartTask02
    <8f1>   DW_AT_decl_file   : 1
    <8f2>   DW_AT_decl_line   : 260
    <8f4>   DW_AT_decl_column : 6
    <8f5>   DW_AT_prototyped  : 1
    <8f5>   DW_AT_low_pc      : 0x8000698
    <8f9>   DW_AT_high_pc     : 0x20
    <8fd>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8ff>   DW_AT_call_all_tail_calls: 1
    <8ff>   DW_AT_sibling     : <0x914>
 <2><903>: Abbrev Number: 35 (DW_TAG_formal_parameter)
    <904>   DW_AT_name        : (indirect string, offset: 0x584fc): argument
    <908>   DW_AT_decl_file   : 1
    <909>   DW_AT_decl_line   : 260
    <90b>   DW_AT_decl_column : 24
    <90c>   DW_AT_type        : <0x51a>
    <910>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><913>: Abbrev Number: 0
 <1><914>: Abbrev Number: 25 (DW_TAG_subprogram)
    <915>   DW_AT_external    : 1
    <915>   DW_AT_name        : (indirect string, offset: 0xfa8): StartDefaultTask
    <919>   DW_AT_decl_file   : 1
    <919>   DW_AT_decl_line   : 242
    <91a>   DW_AT_decl_column : 6
    <91a>   DW_AT_prototyped  : 1
    <91a>   DW_AT_low_pc      : 0x8000688
    <91e>   DW_AT_high_pc     : 0x10
    <922>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <924>   DW_AT_call_all_tail_calls: 1
    <924>   DW_AT_sibling     : <0x938>
 <2><928>: Abbrev Number: 36 (DW_TAG_formal_parameter)
    <929>   DW_AT_name        : (indirect string, offset: 0x584fc): argument
    <92d>   DW_AT_decl_file   : 1
    <92e>   DW_AT_decl_line   : 242
    <92f>   DW_AT_decl_column : 29
    <930>   DW_AT_type        : <0x51a>
    <934>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><937>: Abbrev Number: 0
 <1><938>: Abbrev Number: 37 (DW_TAG_subprogram)
    <939>   DW_AT_name        : (indirect string, offset: 0x73ee8): MX_GPIO_Init
    <93d>   DW_AT_decl_file   : 1
    <93e>   DW_AT_decl_line   : 206
    <93f>   DW_AT_decl_column : 13
    <940>   DW_AT_prototyped  : 1
    <940>   DW_AT_low_pc      : 0x8000620
    <944>   DW_AT_high_pc     : 0x68
    <948>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <94a>   DW_AT_call_all_tail_calls: 1
    <94a>   DW_AT_sibling     : <0x975>
 <2><94e>: Abbrev Number: 10 (DW_TAG_variable)
    <94f>   DW_AT_name        : (indirect string, offset: 0x26631): GPIO_InitStruct
    <953>   DW_AT_decl_file   : 1
    <953>   DW_AT_decl_line   : 208
    <954>   DW_AT_decl_column : 20
    <955>   DW_AT_type        : <0x4e7>
    <959>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><95c>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <95d>   DW_AT_low_pc      : 0x8000634
    <961>   DW_AT_high_pc     : 0x1c
 <3><965>: Abbrev Number: 10 (DW_TAG_variable)
    <966>   DW_AT_name        : (indirect string, offset: 0x6a1ed): tmpreg
    <96a>   DW_AT_decl_file   : 1
    <96a>   DW_AT_decl_line   : 214
    <96b>   DW_AT_decl_column : 3
    <96c>   DW_AT_type        : <0xb8>
    <970>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><973>: Abbrev Number: 0
 <2><974>: Abbrev Number: 0
 <1><975>: Abbrev Number: 25 (DW_TAG_subprogram)
    <976>   DW_AT_external    : 1
    <976>   DW_AT_name        : (indirect string, offset: 0x7841e): SystemClock_Config
    <97a>   DW_AT_decl_file   : 1
    <97a>   DW_AT_decl_line   : 164
    <97b>   DW_AT_decl_column : 6
    <97b>   DW_AT_prototyped  : 1
    <97b>   DW_AT_low_pc      : 0x8000560
    <97f>   DW_AT_high_pc     : 0xc0
    <983>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <985>   DW_AT_call_all_tail_calls: 1
    <985>   DW_AT_sibling     : <0x9dd>
 <2><989>: Abbrev Number: 10 (DW_TAG_variable)
    <98a>   DW_AT_name        : (indirect string, offset: 0x3daad): RCC_OscInitStruct
    <98e>   DW_AT_decl_file   : 1
    <98e>   DW_AT_decl_line   : 166
    <98f>   DW_AT_decl_column : 22
    <990>   DW_AT_type        : <0x431>
    <994>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><997>: Abbrev Number: 10 (DW_TAG_variable)
    <998>   DW_AT_name        : (indirect string, offset: 0x4b25c): RCC_ClkInitStruct
    <99c>   DW_AT_decl_file   : 1
    <99c>   DW_AT_decl_line   : 167
    <99d>   DW_AT_decl_column : 22
    <99e>   DW_AT_type        : <0x48c>
    <9a2>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><9a6>: Abbrev Number: 38 (DW_TAG_lexical_block)
    <9a7>   DW_AT_low_pc      : 0x8000584
    <9ab>   DW_AT_high_pc     : 0x1c
    <9af>   DW_AT_sibling     : <0x9c3>
 <3><9b3>: Abbrev Number: 10 (DW_TAG_variable)
    <9b4>   DW_AT_name        : (indirect string, offset: 0x6a1ed): tmpreg
    <9b8>   DW_AT_decl_file   : 1
    <9b8>   DW_AT_decl_line   : 171
    <9b9>   DW_AT_decl_column : 3
    <9ba>   DW_AT_type        : <0xb8>
    <9be>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <3><9c2>: Abbrev Number: 0
 <2><9c3>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <9c4>   DW_AT_low_pc      : 0x80005a0
    <9c8>   DW_AT_high_pc     : 0x20
 <3><9cc>: Abbrev Number: 10 (DW_TAG_variable)
    <9cd>   DW_AT_name        : (indirect string, offset: 0x6a1ed): tmpreg
    <9d1>   DW_AT_decl_file   : 1
    <9d1>   DW_AT_decl_line   : 172
    <9d2>   DW_AT_decl_column : 3
    <9d3>   DW_AT_type        : <0xb8>
    <9d7>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <3><9db>: Abbrev Number: 0
 <2><9dc>: Abbrev Number: 0
 <1><9dd>: Abbrev Number: 39 (DW_TAG_subprogram)
    <9de>   DW_AT_external    : 1
    <9de>   DW_AT_name        : (indirect string, offset: 0x13b68): main
    <9e2>   DW_AT_decl_file   : 1
    <9e3>   DW_AT_decl_line   : 81
    <9e4>   DW_AT_decl_column : 5
    <9e5>   DW_AT_prototyped  : 1
    <9e5>   DW_AT_type        : <0x86>
    <9e9>   DW_AT_low_pc      : 0x800050c
    <9ed>   DW_AT_high_pc     : 0x54
    <9f1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9f3>   DW_AT_call_all_tail_calls: 1
 <1><9f3>: Abbrev Number: 40 (DW_TAG_subprogram)
    <9f4>   DW_AT_name        : (indirect string, offset: 0x6b5ce): __disable_irq
    <9f8>   DW_AT_decl_file   : 2
    <9f9>   DW_AT_decl_line   : 960
    <9fb>   DW_AT_decl_column : 27
    <9fc>   DW_AT_prototyped  : 1
    <9fc>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><9fd>: Abbrev Number: 0
  Compilation Unit @ offset 0x9fe:
   Length:        0x445 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x287
   Pointer Size:  4
 <0><a0a>: Abbrev Number: 11 (DW_TAG_compile_unit)
    <a0b>   DW_AT_producer    : (indirect string, offset: 0x75863): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <a0f>   DW_AT_language    : 29	(C11)
    <a10>   DW_AT_name        : (indirect string, offset: 0x827ac): ../Core/Src/stm32f4xx_hal_msp.c
    <a14>   DW_AT_comp_dir    : (indirect string, offset: 0x346e9): D:/Personal studies/ITI embedded/workspace/my_Code/Debug
    <a18>   DW_AT_ranges      : 0x3e
    <a1c>   DW_AT_low_pc      : 0
    <a20>   DW_AT_stmt_list   : 0x93f
    <a24>   DW_AT_macros      : 0x56a
 <1><a28>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <a29>   DW_AT_encoding    : 5	(signed)
    <a2a>   DW_AT_byte_size   : 1
    <a2b>   DW_AT_type        : <0xbb7>
    <a2f>   DW_AT_decl_file   : 2
    <a30>   DW_AT_decl_line   : 66
    <a31>   DW_AT_decl_column : 1
    <a32>   DW_AT_sibling     : <0xbb7>
 <2><a36>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a37>   DW_AT_name        : (indirect string, offset: 0x8282b): NonMaskableInt_IRQn
    <a3b>   DW_AT_const_value : -14
 <2><a3c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a3d>   DW_AT_name        : (indirect string, offset: 0x824be): MemoryManagement_IRQn
    <a41>   DW_AT_const_value : -12
 <2><a42>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a43>   DW_AT_name        : (indirect string, offset: 0x8259b): BusFault_IRQn
    <a47>   DW_AT_const_value : -11
 <2><a48>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a49>   DW_AT_name        : (indirect string, offset: 0x82870): UsageFault_IRQn
    <a4d>   DW_AT_const_value : -10
 <2><a4e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a4f>   DW_AT_name        : (indirect string, offset: 0x82528): SVCall_IRQn
    <a53>   DW_AT_const_value : -5
 <2><a54>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a55>   DW_AT_name        : (indirect string, offset: 0x8254c): DebugMonitor_IRQn
    <a59>   DW_AT_const_value : -4
 <2><a5a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a5b>   DW_AT_name        : (indirect string, offset: 0x8283f): PendSV_IRQn
    <a5f>   DW_AT_const_value : -2
 <2><a60>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a61>   DW_AT_name        : (indirect string, offset: 0x827d8): SysTick_IRQn
    <a65>   DW_AT_const_value : -1
 <2><a66>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a67>   DW_AT_name        : (indirect string, offset: 0x826fd): WWDG_IRQn
    <a6b>   DW_AT_const_value : 0
 <2><a6c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a6d>   DW_AT_name        : (indirect string, offset: 0x82810): PVD_IRQn
    <a71>   DW_AT_const_value : 1
 <2><a72>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a73>   DW_AT_name        : (indirect string, offset: 0x826bf): TAMP_STAMP_IRQn
    <a77>   DW_AT_const_value : 2
 <2><a78>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a79>   DW_AT_name        : (indirect string, offset: 0x8262d): RTC_WKUP_IRQn
    <a7d>   DW_AT_const_value : 3
 <2><a7e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a7f>   DW_AT_name        : (indirect string, offset: 0x82510): FLASH_IRQn
    <a83>   DW_AT_const_value : 4
 <2><a84>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a85>   DW_AT_name        : (indirect string, offset: 0x82677): RCC_IRQn
    <a89>   DW_AT_const_value : 5
 <2><a8a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a8b>   DW_AT_name        : (indirect string, offset: 0x82880): EXTI0_IRQn
    <a8f>   DW_AT_const_value : 6
 <2><a90>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a91>   DW_AT_name        : (indirect string, offset: 0x82590): EXTI1_IRQn
    <a95>   DW_AT_const_value : 7
 <2><a96>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a97>   DW_AT_name        : (indirect string, offset: 0x82648): EXTI2_IRQn
    <a9b>   DW_AT_const_value : 8
 <2><a9c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a9d>   DW_AT_name        : (indirect string, offset: 0x82534): EXTI3_IRQn
    <aa1>   DW_AT_const_value : 9
 <2><aa2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <aa3>   DW_AT_name        : (indirect string, offset: 0x82775): EXTI4_IRQn
    <aa7>   DW_AT_const_value : 10
 <2><aa8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <aa9>   DW_AT_name        : (indirect string, offset: 0x82611): DMA1_Stream0_IRQn
    <aad>   DW_AT_const_value : 11
 <2><aae>: Abbrev Number: 1 (DW_TAG_enumerator)
    <aaf>   DW_AT_name        : (indirect string, offset: 0x82699): DMA1_Stream1_IRQn
    <ab3>   DW_AT_const_value : 12
 <2><ab4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ab5>   DW_AT_name        : (indirect string, offset: 0x8273d): DMA1_Stream2_IRQn
    <ab9>   DW_AT_const_value : 13
 <2><aba>: Abbrev Number: 1 (DW_TAG_enumerator)
    <abb>   DW_AT_name        : (indirect string, offset: 0x827f2): DMA1_Stream3_IRQn
    <abf>   DW_AT_const_value : 14
 <2><ac0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ac1>   DW_AT_name        : (indirect string, offset: 0x824d4): DMA1_Stream4_IRQn
    <ac5>   DW_AT_const_value : 15
 <2><ac6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ac7>   DW_AT_name        : (indirect string, offset: 0x825a9): DMA1_Stream5_IRQn
    <acb>   DW_AT_const_value : 16
 <2><acc>: Abbrev Number: 1 (DW_TAG_enumerator)
    <acd>   DW_AT_name        : (indirect string, offset: 0x82665): DMA1_Stream6_IRQn
    <ad1>   DW_AT_const_value : 17
 <2><ad2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ad3>   DW_AT_name        : (indirect string, offset: 0x8276c): ADC_IRQn
    <ad7>   DW_AT_const_value : 18
 <2><ad8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ad9>   DW_AT_name        : (indirect string, offset: 0x82780): EXTI9_5_IRQn
    <add>   DW_AT_const_value : 23
 <2><ade>: Abbrev Number: 1 (DW_TAG_enumerator)
    <adf>   DW_AT_name        : (indirect string, offset: 0x824fd): TIM1_BRK_TIM9_IRQn
    <ae3>   DW_AT_const_value : 24
 <2><ae4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ae5>   DW_AT_name        : (indirect string, offset: 0x8274f): TIM1_UP_TIM10_IRQn
    <ae9>   DW_AT_const_value : 25
 <2><aea>: Abbrev Number: 1 (DW_TAG_enumerator)
    <aeb>   DW_AT_name        : (indirect string, offset: 0x825dc): TIM1_TRG_COM_TIM11_IRQn
    <aef>   DW_AT_const_value : 26
 <2><af0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af1>   DW_AT_name        : (indirect string, offset: 0x827e5): TIM1_CC_IRQn
    <af5>   DW_AT_const_value : 27
 <2><af6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af7>   DW_AT_name        : (indirect string, offset: 0x8284b): TIM2_IRQn
    <afb>   DW_AT_const_value : 28
 <2><afc>: Abbrev Number: 1 (DW_TAG_enumerator)
    <afd>   DW_AT_name        : (indirect string, offset: 0x8255e): TIM3_IRQn
    <b01>   DW_AT_const_value : 29
 <2><b02>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b03>   DW_AT_name        : (indirect string, offset: 0x82623): TIM4_IRQn
    <b07>   DW_AT_const_value : 30
 <2><b08>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b09>   DW_AT_name        : (indirect string, offset: 0x8251b): I2C1_EV_IRQn
    <b0d>   DW_AT_const_value : 31
 <2><b0e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b0f>   DW_AT_name        : (indirect string, offset: 0x8263b): I2C1_ER_IRQn
    <b13>   DW_AT_const_value : 32
 <2><b14>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b15>   DW_AT_name        : (indirect string, offset: 0x8278d): I2C2_EV_IRQn
    <b19>   DW_AT_const_value : 33
 <2><b1a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b1b>   DW_AT_name        : (indirect string, offset: 0x824e6): I2C2_ER_IRQn
    <b1f>   DW_AT_const_value : 34
 <2><b20>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b21>   DW_AT_name        : (indirect string, offset: 0x82568): SPI1_IRQn
    <b25>   DW_AT_const_value : 35
 <2><b26>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b27>   DW_AT_name        : (indirect string, offset: 0x826e1): SPI2_IRQn
    <b2b>   DW_AT_const_value : 36
 <2><b2c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b2d>   DW_AT_name        : (indirect string, offset: 0x82804): USART1_IRQn
    <b31>   DW_AT_const_value : 37
 <2><b32>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b33>   DW_AT_name        : (indirect string, offset: 0x82680): USART2_IRQn
    <b37>   DW_AT_const_value : 38
 <2><b38>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b39>   DW_AT_name        : (indirect string, offset: 0x82719): EXTI15_10_IRQn
    <b3d>   DW_AT_const_value : 40
 <2><b3e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b3f>   DW_AT_name        : (indirect string, offset: 0x825bb): RTC_Alarm_IRQn
    <b43>   DW_AT_const_value : 41
 <2><b44>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b45>   DW_AT_name        : (indirect string, offset: 0x82600): OTG_FS_WKUP_IRQn
    <b49>   DW_AT_const_value : 42
 <2><b4a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b4b>   DW_AT_name        : (indirect string, offset: 0x826eb): DMA1_Stream7_IRQn
    <b4f>   DW_AT_const_value : 47
 <2><b50>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b51>   DW_AT_name        : (indirect string, offset: 0x44748): SDIO_IRQn
    <b55>   DW_AT_const_value : 49
 <2><b56>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b57>   DW_AT_name        : (indirect string, offset: 0x826ab): TIM5_IRQn
    <b5b>   DW_AT_const_value : 50
 <2><b5c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b5d>   DW_AT_name        : (indirect string, offset: 0x826b5): SPI3_IRQn
    <b61>   DW_AT_const_value : 51
 <2><b62>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b63>   DW_AT_name        : (indirect string, offset: 0x82707): DMA2_Stream0_IRQn
    <b67>   DW_AT_const_value : 56
 <2><b68>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b69>   DW_AT_name        : (indirect string, offset: 0x8279a): DMA2_Stream1_IRQn
    <b6d>   DW_AT_const_value : 57
 <2><b6e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b6f>   DW_AT_name        : (indirect string, offset: 0x8285e): DMA2_Stream2_IRQn
    <b73>   DW_AT_const_value : 58
 <2><b74>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b75>   DW_AT_name        : (indirect string, offset: 0x82572): DMA2_Stream3_IRQn
    <b79>   DW_AT_const_value : 59
 <2><b7a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b7b>   DW_AT_name        : (indirect string, offset: 0x82653): DMA2_Stream4_IRQn
    <b7f>   DW_AT_const_value : 60
 <2><b80>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b81>   DW_AT_name        : (indirect string, offset: 0x825f4): OTG_FS_IRQn
    <b85>   DW_AT_const_value : 67
 <2><b86>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b87>   DW_AT_name        : (indirect string, offset: 0x826cf): DMA2_Stream5_IRQn
    <b8b>   DW_AT_const_value : 68
 <2><b8c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b8d>   DW_AT_name        : (indirect string, offset: 0x825ca): DMA2_Stream6_IRQn
    <b91>   DW_AT_const_value : 69
 <2><b92>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b93>   DW_AT_name        : (indirect string, offset: 0x82819): DMA2_Stream7_IRQn
    <b97>   DW_AT_const_value : 70
 <2><b98>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b99>   DW_AT_name        : (indirect string, offset: 0x82584): USART6_IRQn
    <b9d>   DW_AT_const_value : 71
 <2><b9e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b9f>   DW_AT_name        : (indirect string, offset: 0x8268c): I2C3_EV_IRQn
    <ba3>   DW_AT_const_value : 72
 <2><ba4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ba5>   DW_AT_name        : (indirect string, offset: 0x8253f): I2C3_ER_IRQn
    <ba9>   DW_AT_const_value : 73
 <2><baa>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bab>   DW_AT_name        : (indirect string, offset: 0x82855): FPU_IRQn
    <baf>   DW_AT_const_value : 81
 <2><bb0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bb1>   DW_AT_name        : (indirect string, offset: 0x82762): SPI4_IRQn
    <bb5>   DW_AT_const_value : 84
 <2><bb6>: Abbrev Number: 0
 <1><bb7>: Abbrev Number: 3 (DW_TAG_base_type)
    <bb8>   DW_AT_byte_size   : 1
    <bb9>   DW_AT_encoding    : 6	(signed char)
    <bba>   DW_AT_name        : (indirect string, offset: 0x61709): signed char
 <1><bbe>: Abbrev Number: 5 (DW_TAG_typedef)
    <bbf>   DW_AT_name        : (indirect string, offset: 0x824f3): IRQn_Type
    <bc3>   DW_AT_decl_file   : 2
    <bc4>   DW_AT_decl_line   : 133
    <bc5>   DW_AT_decl_column : 3
    <bc6>   DW_AT_type        : <0xa28>
 <1><bca>: Abbrev Number: 3 (DW_TAG_base_type)
    <bcb>   DW_AT_byte_size   : 1
    <bcc>   DW_AT_encoding    : 8	(unsigned char)
    <bcd>   DW_AT_name        : (indirect string, offset: 0x5d8be): unsigned char
 <1><bd1>: Abbrev Number: 3 (DW_TAG_base_type)
    <bd2>   DW_AT_byte_size   : 2
    <bd3>   DW_AT_encoding    : 5	(signed)
    <bd4>   DW_AT_name        : (indirect string, offset: 0x4efa): short int
 <1><bd8>: Abbrev Number: 3 (DW_TAG_base_type)
    <bd9>   DW_AT_byte_size   : 2
    <bda>   DW_AT_encoding    : 7	(unsigned)
    <bdb>   DW_AT_name        : (indirect string, offset: 0x4142c): short unsigned int
 <1><bdf>: Abbrev Number: 3 (DW_TAG_base_type)
    <be0>   DW_AT_byte_size   : 4
    <be1>   DW_AT_encoding    : 5	(signed)
    <be2>   DW_AT_name        : (indirect string, offset: 0x19f77): long int
 <1><be6>: Abbrev Number: 5 (DW_TAG_typedef)
    <be7>   DW_AT_name        : (indirect string, offset: 0x3933e): __uint32_t
    <beb>   DW_AT_decl_file   : 3
    <bec>   DW_AT_decl_line   : 79
    <bed>   DW_AT_decl_column : 25
    <bee>   DW_AT_type        : <0xbf2>
 <1><bf2>: Abbrev Number: 3 (DW_TAG_base_type)
    <bf3>   DW_AT_byte_size   : 4
    <bf4>   DW_AT_encoding    : 7	(unsigned)
    <bf5>   DW_AT_name        : (indirect string, offset: 0x4cc9d): long unsigned int
 <1><bf9>: Abbrev Number: 3 (DW_TAG_base_type)
    <bfa>   DW_AT_byte_size   : 8
    <bfb>   DW_AT_encoding    : 5	(signed)
    <bfc>   DW_AT_name        : (indirect string, offset: 0x33d27): long long int
 <1><c00>: Abbrev Number: 3 (DW_TAG_base_type)
    <c01>   DW_AT_byte_size   : 8
    <c02>   DW_AT_encoding    : 7	(unsigned)
    <c03>   DW_AT_name        : (indirect string, offset: 0x2c305): long long unsigned int
 <1><c07>: Abbrev Number: 13 (DW_TAG_base_type)
    <c08>   DW_AT_byte_size   : 4
    <c09>   DW_AT_encoding    : 5	(signed)
    <c0a>   DW_AT_name        : int
 <1><c0e>: Abbrev Number: 3 (DW_TAG_base_type)
    <c0f>   DW_AT_byte_size   : 4
    <c10>   DW_AT_encoding    : 7	(unsigned)
    <c11>   DW_AT_name        : (indirect string, offset: 0x464bd): unsigned int
 <1><c15>: Abbrev Number: 5 (DW_TAG_typedef)
    <c16>   DW_AT_name        : (indirect string, offset: 0x32a90): uint32_t
    <c1a>   DW_AT_decl_file   : 4
    <c1b>   DW_AT_decl_line   : 48
    <c1c>   DW_AT_decl_column : 20
    <c1d>   DW_AT_type        : <0xbe6>
 <1><c21>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <c22>   DW_AT_type        : <0xc15>
 <1><c26>: Abbrev Number: 8 (DW_TAG_array_type)
    <c27>   DW_AT_type        : <0xc15>
    <c2b>   DW_AT_sibling     : <0xc36>
 <2><c2f>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <c30>   DW_AT_type        : <0xc0e>
    <c34>   DW_AT_upper_bound : 0
 <2><c35>: Abbrev Number: 0
 <1><c36>: Abbrev Number: 8 (DW_TAG_array_type)
    <c37>   DW_AT_type        : <0xc15>
    <c3b>   DW_AT_sibling     : <0xc46>
 <2><c3f>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <c40>   DW_AT_type        : <0xc0e>
    <c44>   DW_AT_upper_bound : 1
 <2><c45>: Abbrev Number: 0
 <1><c46>: Abbrev Number: 15 (DW_TAG_structure_type)
    <c47>   DW_AT_byte_size   : 144
    <c48>   DW_AT_decl_file   : 2
    <c49>   DW_AT_decl_line   : 335
    <c4b>   DW_AT_decl_column : 9
    <c4c>   DW_AT_sibling     : <0xdd0>
 <2><c50>: Abbrev Number: 6 (DW_TAG_member)
    <c51>   DW_AT_name        : CR
    <c54>   DW_AT_decl_file   : 2
    <c54>   DW_AT_decl_line   : 337
    <c56>   DW_AT_decl_column : 17
    <c56>   DW_AT_type        : <0xc21>
    <c5a>   DW_AT_data_member_location: 0
 <2><c5b>: Abbrev Number: 2 (DW_TAG_member)
    <c5c>   DW_AT_name        : (indirect string, offset: 0x357b6): PLLCFGR
    <c60>   DW_AT_decl_file   : 2
    <c60>   DW_AT_decl_line   : 338
    <c62>   DW_AT_decl_column : 17
    <c62>   DW_AT_type        : <0xc21>
    <c66>   DW_AT_data_member_location: 4
 <2><c67>: Abbrev Number: 2 (DW_TAG_member)
    <c68>   DW_AT_name        : (indirect string, offset: 0x654fa): CFGR
    <c6c>   DW_AT_decl_file   : 2
    <c6c>   DW_AT_decl_line   : 339
    <c6e>   DW_AT_decl_column : 17
    <c6e>   DW_AT_type        : <0xc21>
    <c72>   DW_AT_data_member_location: 8
 <2><c73>: Abbrev Number: 6 (DW_TAG_member)
    <c74>   DW_AT_name        : CIR
    <c78>   DW_AT_decl_file   : 2
    <c78>   DW_AT_decl_line   : 340
    <c7a>   DW_AT_decl_column : 17
    <c7a>   DW_AT_type        : <0xc21>
    <c7e>   DW_AT_data_member_location: 12
 <2><c7f>: Abbrev Number: 2 (DW_TAG_member)
    <c80>   DW_AT_name        : (indirect string, offset: 0x55dd4): AHB1RSTR
    <c84>   DW_AT_decl_file   : 2
    <c84>   DW_AT_decl_line   : 341
    <c86>   DW_AT_decl_column : 17
    <c86>   DW_AT_type        : <0xc21>
    <c8a>   DW_AT_data_member_location: 16
 <2><c8b>: Abbrev Number: 2 (DW_TAG_member)
    <c8c>   DW_AT_name        : (indirect string, offset: 0x6a3fc): AHB2RSTR
    <c90>   DW_AT_decl_file   : 2
    <c90>   DW_AT_decl_line   : 342
    <c92>   DW_AT_decl_column : 17
    <c92>   DW_AT_type        : <0xc21>
    <c96>   DW_AT_data_member_location: 20
 <2><c97>: Abbrev Number: 2 (DW_TAG_member)
    <c98>   DW_AT_name        : (indirect string, offset: 0x7f381): AHB3RSTR
    <c9c>   DW_AT_decl_file   : 2
    <c9c>   DW_AT_decl_line   : 343
    <c9e>   DW_AT_decl_column : 17
    <c9e>   DW_AT_type        : <0xc21>
    <ca2>   DW_AT_data_member_location: 24
 <2><ca3>: Abbrev Number: 2 (DW_TAG_member)
    <ca4>   DW_AT_name        : (indirect string, offset: 0xf821): RESERVED0
    <ca8>   DW_AT_decl_file   : 2
    <ca8>   DW_AT_decl_line   : 344
    <caa>   DW_AT_decl_column : 17
    <caa>   DW_AT_type        : <0xc15>
    <cae>   DW_AT_data_member_location: 28
 <2><caf>: Abbrev Number: 2 (DW_TAG_member)
    <cb0>   DW_AT_name        : (indirect string, offset: 0x1962c): APB1RSTR
    <cb4>   DW_AT_decl_file   : 2
    <cb4>   DW_AT_decl_line   : 345
    <cb6>   DW_AT_decl_column : 17
    <cb6>   DW_AT_type        : <0xc21>
    <cba>   DW_AT_data_member_location: 32
 <2><cbb>: Abbrev Number: 2 (DW_TAG_member)
    <cbc>   DW_AT_name        : (indirect string, offset: 0xae80): APB2RSTR
    <cc0>   DW_AT_decl_file   : 2
    <cc0>   DW_AT_decl_line   : 346
    <cc2>   DW_AT_decl_column : 17
    <cc2>   DW_AT_type        : <0xc21>
    <cc6>   DW_AT_data_member_location: 36
 <2><cc7>: Abbrev Number: 2 (DW_TAG_member)
    <cc8>   DW_AT_name        : (indirect string, offset: 0xf846): RESERVED1
    <ccc>   DW_AT_decl_file   : 2
    <ccc>   DW_AT_decl_line   : 347
    <cce>   DW_AT_decl_column : 17
    <cce>   DW_AT_type        : <0xc36>
    <cd2>   DW_AT_data_member_location: 40
 <2><cd3>: Abbrev Number: 2 (DW_TAG_member)
    <cd4>   DW_AT_name        : (indirect string, offset: 0x6851b): AHB1ENR
    <cd8>   DW_AT_decl_file   : 2
    <cd8>   DW_AT_decl_line   : 348
    <cda>   DW_AT_decl_column : 17
    <cda>   DW_AT_type        : <0xc21>
    <cde>   DW_AT_data_member_location: 48
 <2><cdf>: Abbrev Number: 2 (DW_TAG_member)
    <ce0>   DW_AT_name        : (indirect string, offset: 0x162c7): AHB2ENR
    <ce4>   DW_AT_decl_file   : 2
    <ce4>   DW_AT_decl_line   : 349
    <ce6>   DW_AT_decl_column : 17
    <ce6>   DW_AT_type        : <0xc21>
    <cea>   DW_AT_data_member_location: 52
 <2><ceb>: Abbrev Number: 2 (DW_TAG_member)
    <cec>   DW_AT_name        : (indirect string, offset: 0x140e): AHB3ENR
    <cf0>   DW_AT_decl_file   : 2
    <cf0>   DW_AT_decl_line   : 350
    <cf2>   DW_AT_decl_column : 17
    <cf2>   DW_AT_type        : <0xc21>
    <cf6>   DW_AT_data_member_location: 56
 <2><cf7>: Abbrev Number: 2 (DW_TAG_member)
    <cf8>   DW_AT_name        : (indirect string, offset: 0x52361): RESERVED2
    <cfc>   DW_AT_decl_file   : 2
    <cfc>   DW_AT_decl_line   : 351
    <cfe>   DW_AT_decl_column : 17
    <cfe>   DW_AT_type        : <0xc15>
    <d02>   DW_AT_data_member_location: 60
 <2><d03>: Abbrev Number: 2 (DW_TAG_member)
    <d04>   DW_AT_name        : (indirect string, offset: 0x25ccf): APB1ENR
    <d08>   DW_AT_decl_file   : 2
    <d08>   DW_AT_decl_line   : 352
    <d0a>   DW_AT_decl_column : 17
    <d0a>   DW_AT_type        : <0xc21>
    <d0e>   DW_AT_data_member_location: 64
 <2><d0f>: Abbrev Number: 2 (DW_TAG_member)
    <d10>   DW_AT_name        : (indirect string, offset: 0x5321f): APB2ENR
    <d14>   DW_AT_decl_file   : 2
    <d14>   DW_AT_decl_line   : 353
    <d16>   DW_AT_decl_column : 17
    <d16>   DW_AT_type        : <0xc21>
    <d1a>   DW_AT_data_member_location: 68
 <2><d1b>: Abbrev Number: 2 (DW_TAG_member)
    <d1c>   DW_AT_name        : (indirect string, offset: 0x5236b): RESERVED3
    <d20>   DW_AT_decl_file   : 2
    <d20>   DW_AT_decl_line   : 354
    <d22>   DW_AT_decl_column : 17
    <d22>   DW_AT_type        : <0xc36>
    <d26>   DW_AT_data_member_location: 72
 <2><d27>: Abbrev Number: 2 (DW_TAG_member)
    <d28>   DW_AT_name        : (indirect string, offset: 0x259c6): AHB1LPENR
    <d2c>   DW_AT_decl_file   : 2
    <d2c>   DW_AT_decl_line   : 355
    <d2e>   DW_AT_decl_column : 17
    <d2e>   DW_AT_type        : <0xc21>
    <d32>   DW_AT_data_member_location: 80
 <2><d33>: Abbrev Number: 2 (DW_TAG_member)
    <d34>   DW_AT_name        : (indirect string, offset: 0x594aa): AHB2LPENR
    <d38>   DW_AT_decl_file   : 2
    <d38>   DW_AT_decl_line   : 356
    <d3a>   DW_AT_decl_column : 17
    <d3a>   DW_AT_type        : <0xc21>
    <d3e>   DW_AT_data_member_location: 84
 <2><d3f>: Abbrev Number: 2 (DW_TAG_member)
    <d40>   DW_AT_name        : (indirect string, offset: 0x6629e): AHB3LPENR
    <d44>   DW_AT_decl_file   : 2
    <d44>   DW_AT_decl_line   : 357
    <d46>   DW_AT_decl_column : 17
    <d46>   DW_AT_type        : <0xc21>
    <d4a>   DW_AT_data_member_location: 88
 <2><d4b>: Abbrev Number: 2 (DW_TAG_member)
    <d4c>   DW_AT_name        : (indirect string, offset: 0x52375): RESERVED4
    <d50>   DW_AT_decl_file   : 2
    <d50>   DW_AT_decl_line   : 358
    <d52>   DW_AT_decl_column : 17
    <d52>   DW_AT_type        : <0xc15>
    <d56>   DW_AT_data_member_location: 92
 <2><d57>: Abbrev Number: 2 (DW_TAG_member)
    <d58>   DW_AT_name        : (indirect string, offset: 0x67b51): APB1LPENR
    <d5c>   DW_AT_decl_file   : 2
    <d5c>   DW_AT_decl_line   : 359
    <d5e>   DW_AT_decl_column : 17
    <d5e>   DW_AT_type        : <0xc21>
    <d62>   DW_AT_data_member_location: 96
 <2><d63>: Abbrev Number: 2 (DW_TAG_member)
    <d64>   DW_AT_name        : (indirect string, offset: 0x80583): APB2LPENR
    <d68>   DW_AT_decl_file   : 2
    <d68>   DW_AT_decl_line   : 360
    <d6a>   DW_AT_decl_column : 17
    <d6a>   DW_AT_type        : <0xc21>
    <d6e>   DW_AT_data_member_location: 100
 <2><d6f>: Abbrev Number: 2 (DW_TAG_member)
    <d70>   DW_AT_name        : (indirect string, offset: 0x5237f): RESERVED5
    <d74>   DW_AT_decl_file   : 2
    <d74>   DW_AT_decl_line   : 361
    <d76>   DW_AT_decl_column : 17
    <d76>   DW_AT_type        : <0xc36>
    <d7a>   DW_AT_data_member_location: 104
 <2><d7b>: Abbrev Number: 2 (DW_TAG_member)
    <d7c>   DW_AT_name        : (indirect string, offset: 0x82103): BDCR
    <d80>   DW_AT_decl_file   : 2
    <d80>   DW_AT_decl_line   : 362
    <d82>   DW_AT_decl_column : 17
    <d82>   DW_AT_type        : <0xc21>
    <d86>   DW_AT_data_member_location: 112
 <2><d87>: Abbrev Number: 6 (DW_TAG_member)
    <d88>   DW_AT_name        : CSR
    <d8c>   DW_AT_decl_file   : 2
    <d8c>   DW_AT_decl_line   : 363
    <d8e>   DW_AT_decl_column : 17
    <d8e>   DW_AT_type        : <0xc21>
    <d92>   DW_AT_data_member_location: 116
 <2><d93>: Abbrev Number: 2 (DW_TAG_member)
    <d94>   DW_AT_name        : (indirect string, offset: 0x90c5): RESERVED6
    <d98>   DW_AT_decl_file   : 2
    <d98>   DW_AT_decl_line   : 364
    <d9a>   DW_AT_decl_column : 17
    <d9a>   DW_AT_type        : <0xc36>
    <d9e>   DW_AT_data_member_location: 120
 <2><d9f>: Abbrev Number: 2 (DW_TAG_member)
    <da0>   DW_AT_name        : (indirect string, offset: 0x6ea2e): SSCGR
    <da4>   DW_AT_decl_file   : 2
    <da4>   DW_AT_decl_line   : 365
    <da6>   DW_AT_decl_column : 17
    <da6>   DW_AT_type        : <0xc21>
    <daa>   DW_AT_data_member_location: 128
 <2><dab>: Abbrev Number: 2 (DW_TAG_member)
    <dac>   DW_AT_name        : (indirect string, offset: 0xd8d5): PLLI2SCFGR
    <db0>   DW_AT_decl_file   : 2
    <db0>   DW_AT_decl_line   : 366
    <db2>   DW_AT_decl_column : 17
    <db2>   DW_AT_type        : <0xc21>
    <db6>   DW_AT_data_member_location: 132
 <2><db7>: Abbrev Number: 2 (DW_TAG_member)
    <db8>   DW_AT_name        : (indirect string, offset: 0x523bc): RESERVED7
    <dbc>   DW_AT_decl_file   : 2
    <dbc>   DW_AT_decl_line   : 367
    <dbe>   DW_AT_decl_column : 17
    <dbe>   DW_AT_type        : <0xc26>
    <dc2>   DW_AT_data_member_location: 136
 <2><dc3>: Abbrev Number: 2 (DW_TAG_member)
    <dc4>   DW_AT_name        : (indirect string, offset: 0x654f7): DCKCFGR
    <dc8>   DW_AT_decl_file   : 2
    <dc8>   DW_AT_decl_line   : 368
    <dca>   DW_AT_decl_column : 17
    <dca>   DW_AT_type        : <0xc21>
    <dce>   DW_AT_data_member_location: 140
 <2><dcf>: Abbrev Number: 0
 <1><dd0>: Abbrev Number: 16 (DW_TAG_typedef)
    <dd1>   DW_AT_name        : (indirect string, offset: 0x1ad63): RCC_TypeDef
    <dd5>   DW_AT_decl_file   : 2
    <dd6>   DW_AT_decl_line   : 369
    <dd8>   DW_AT_decl_column : 3
    <dd9>   DW_AT_type        : <0xc46>
 <1><ddd>: Abbrev Number: 3 (DW_TAG_base_type)
    <dde>   DW_AT_byte_size   : 8
    <ddf>   DW_AT_encoding    : 4	(float)
    <de0>   DW_AT_name        : (indirect string, offset: 0x885f8): long double
 <1><de4>: Abbrev Number: 17 (DW_TAG_subprogram)
    <de5>   DW_AT_external    : 1
    <de5>   DW_AT_name        : (indirect string, offset: 0x82728): HAL_NVIC_SetPriority
    <de9>   DW_AT_decl_file   : 5
    <dea>   DW_AT_decl_line   : 261
    <dec>   DW_AT_decl_column : 6
    <ded>   DW_AT_prototyped  : 1
    <ded>   DW_AT_declaration : 1
    <ded>   DW_AT_sibling     : <0xe01>
 <2><df1>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <df2>   DW_AT_type        : <0xbbe>
 <2><df6>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <df7>   DW_AT_type        : <0xc15>
 <2><dfb>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <dfc>   DW_AT_type        : <0xc15>
 <2><e00>: Abbrev Number: 0
 <1><e01>: Abbrev Number: 18 (DW_TAG_subprogram)
    <e02>   DW_AT_external    : 1
    <e02>   DW_AT_name        : (indirect string, offset: 0x827cc): HAL_MspInit
    <e06>   DW_AT_decl_file   : 1
    <e07>   DW_AT_decl_line   : 63
    <e08>   DW_AT_decl_column : 6
    <e09>   DW_AT_prototyped  : 1
    <e09>   DW_AT_low_pc      : 0x80006c4
    <e0d>   DW_AT_high_pc     : 0x58
    <e11>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e13>   DW_AT_call_all_tail_calls: 1
 <2><e13>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <e14>   DW_AT_low_pc      : 0x80006ca
    <e18>   DW_AT_high_pc     : 0x1c
    <e1c>   DW_AT_sibling     : <0xe2e>
 <3><e20>: Abbrev Number: 10 (DW_TAG_variable)
    <e21>   DW_AT_name        : (indirect string, offset: 0x6a1ed): tmpreg
    <e25>   DW_AT_decl_file   : 1
    <e25>   DW_AT_decl_line   : 70
    <e26>   DW_AT_decl_column : 3
    <e26>   DW_AT_type        : <0xc21>
    <e2a>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><e2d>: Abbrev Number: 0
 <2><e2e>: Abbrev Number: 20 (DW_TAG_lexical_block)
    <e2f>   DW_AT_low_pc      : 0x80006e6
    <e33>   DW_AT_high_pc     : 0x1c
 <3><e37>: Abbrev Number: 10 (DW_TAG_variable)
    <e38>   DW_AT_name        : (indirect string, offset: 0x6a1ed): tmpreg
    <e3c>   DW_AT_decl_file   : 1
    <e3c>   DW_AT_decl_line   : 71
    <e3d>   DW_AT_decl_column : 3
    <e3d>   DW_AT_type        : <0xc21>
    <e41>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><e44>: Abbrev Number: 0
 <2><e45>: Abbrev Number: 0
 <1><e46>: Abbrev Number: 0
  Compilation Unit @ offset 0xe47:
   Length:        0x116 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x3a0
   Pointer Size:  4
 <0><e53>: Abbrev Number: 4 (DW_TAG_compile_unit)
    <e54>   DW_AT_producer    : (indirect string, offset: 0x75863): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <e58>   DW_AT_language    : 29	(C11)
    <e59>   DW_AT_name        : (indirect string, offset: 0x828f3): ../Core/Src/stm32f4xx_it.c
    <e5d>   DW_AT_comp_dir    : (indirect string, offset: 0x346e9): D:/Personal studies/ITI embedded/workspace/my_Code/Debug
    <e61>   DW_AT_ranges      : 0x51
    <e65>   DW_AT_low_pc      : 0
    <e69>   DW_AT_stmt_list   : 0x103d
    <e6d>   DW_AT_macros      : 0x724
 <1><e71>: Abbrev Number: 1 (DW_TAG_base_type)
    <e72>   DW_AT_byte_size   : 1
    <e73>   DW_AT_encoding    : 6	(signed char)
    <e74>   DW_AT_name        : (indirect string, offset: 0x61709): signed char
 <1><e78>: Abbrev Number: 1 (DW_TAG_base_type)
    <e79>   DW_AT_byte_size   : 1
    <e7a>   DW_AT_encoding    : 8	(unsigned char)
    <e7b>   DW_AT_name        : (indirect string, offset: 0x5d8be): unsigned char
 <1><e7f>: Abbrev Number: 1 (DW_TAG_base_type)
    <e80>   DW_AT_byte_size   : 2
    <e81>   DW_AT_encoding    : 5	(signed)
    <e82>   DW_AT_name        : (indirect string, offset: 0x4efa): short int
 <1><e86>: Abbrev Number: 1 (DW_TAG_base_type)
    <e87>   DW_AT_byte_size   : 2
    <e88>   DW_AT_encoding    : 7	(unsigned)
    <e89>   DW_AT_name        : (indirect string, offset: 0x4142c): short unsigned int
 <1><e8d>: Abbrev Number: 1 (DW_TAG_base_type)
    <e8e>   DW_AT_byte_size   : 4
    <e8f>   DW_AT_encoding    : 5	(signed)
    <e90>   DW_AT_name        : (indirect string, offset: 0x19f77): long int
 <1><e94>: Abbrev Number: 1 (DW_TAG_base_type)
    <e95>   DW_AT_byte_size   : 4
    <e96>   DW_AT_encoding    : 7	(unsigned)
    <e97>   DW_AT_name        : (indirect string, offset: 0x4cc9d): long unsigned int
 <1><e9b>: Abbrev Number: 1 (DW_TAG_base_type)
    <e9c>   DW_AT_byte_size   : 8
    <e9d>   DW_AT_encoding    : 5	(signed)
    <e9e>   DW_AT_name        : (indirect string, offset: 0x33d27): long long int
 <1><ea2>: Abbrev Number: 1 (DW_TAG_base_type)
    <ea3>   DW_AT_byte_size   : 8
    <ea4>   DW_AT_encoding    : 7	(unsigned)
    <ea5>   DW_AT_name        : (indirect string, offset: 0x2c305): long long unsigned int
 <1><ea9>: Abbrev Number: 5 (DW_TAG_base_type)
    <eaa>   DW_AT_byte_size   : 4
    <eab>   DW_AT_encoding    : 5	(signed)
    <eac>   DW_AT_name        : int
 <1><eb0>: Abbrev Number: 1 (DW_TAG_base_type)
    <eb1>   DW_AT_byte_size   : 4
    <eb2>   DW_AT_encoding    : 7	(unsigned)
    <eb3>   DW_AT_name        : (indirect string, offset: 0x464bd): unsigned int
 <1><eb7>: Abbrev Number: 1 (DW_TAG_base_type)
    <eb8>   DW_AT_byte_size   : 8
    <eb9>   DW_AT_encoding    : 4	(float)
    <eba>   DW_AT_name        : (indirect string, offset: 0x885f8): long double
 <1><ebe>: Abbrev Number: 6 (DW_TAG_typedef)
    <ebf>   DW_AT_name        : (indirect string, offset: 0x89087): BaseType_t
    <ec3>   DW_AT_decl_file   : 4
    <ec4>   DW_AT_decl_line   : 56
    <ec5>   DW_AT_decl_column : 14
    <ec6>   DW_AT_type        : <0xe8d>
 <1><eca>: Abbrev Number: 1 (DW_TAG_base_type)
    <ecb>   DW_AT_byte_size   : 1
    <ecc>   DW_AT_encoding    : 8	(unsigned char)
    <ecd>   DW_AT_name        : (indirect string, offset: 0x7e745): char
 <1><ed1>: Abbrev Number: 3 (DW_TAG_subprogram)
    <ed2>   DW_AT_external    : 1
    <ed2>   DW_AT_name        : (indirect string, offset: 0x828c2): xPortSysTickHandler
    <ed6>   DW_AT_decl_file   : 2
    <ed7>   DW_AT_decl_line   : 54
    <ed8>   DW_AT_decl_column : 8
    <ed9>   DW_AT_prototyped  : 1
    <ed9>   DW_AT_declaration : 1
 <1><ed9>: Abbrev Number: 7 (DW_TAG_subprogram)
    <eda>   DW_AT_external    : 1
    <eda>   DW_AT_name        : (indirect string, offset: 0x8293d): xTaskGetSchedulerState
    <ede>   DW_AT_decl_file   : 5
    <edf>   DW_AT_decl_line   : 2450
    <ee1>   DW_AT_decl_column : 12
    <ee2>   DW_AT_prototyped  : 1
    <ee2>   DW_AT_type        : <0xebe>
    <ee6>   DW_AT_declaration : 1
 <1><ee6>: Abbrev Number: 3 (DW_TAG_subprogram)
    <ee7>   DW_AT_external    : 1
    <ee7>   DW_AT_name        : (indirect string, offset: 0x82920): HAL_IncTick
    <eeb>   DW_AT_decl_file   : 3
    <eec>   DW_AT_decl_line   : 232
    <eed>   DW_AT_decl_column : 6
    <eee>   DW_AT_prototyped  : 1
    <eee>   DW_AT_declaration : 1
 <1><eee>: Abbrev Number: 8 (DW_TAG_subprogram)
    <eef>   DW_AT_external    : 1
    <eef>   DW_AT_name        : (indirect string, offset: 0x82954): SysTick_Handler
    <ef3>   DW_AT_decl_file   : 1
    <ef4>   DW_AT_decl_line   : 159
    <ef5>   DW_AT_decl_column : 6
    <ef6>   DW_AT_prototyped  : 1
    <ef6>   DW_AT_low_pc      : 0x8000752
    <efa>   DW_AT_high_pc     : 0x1a
    <efe>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f00>   DW_AT_call_all_tail_calls: 1
 <1><f00>: Abbrev Number: 2 (DW_TAG_subprogram)
    <f01>   DW_AT_external    : 1
    <f01>   DW_AT_name        : (indirect string, offset: 0x828d6): DebugMon_Handler
    <f05>   DW_AT_decl_file   : 1
    <f05>   DW_AT_decl_line   : 146
    <f06>   DW_AT_decl_column : 6
    <f06>   DW_AT_prototyped  : 1
    <f06>   DW_AT_low_pc      : 0x8000744
    <f0a>   DW_AT_high_pc     : 0xe
    <f0e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f10>   DW_AT_call_all_calls: 1
 <1><f10>: Abbrev Number: 2 (DW_TAG_subprogram)
    <f11>   DW_AT_external    : 1
    <f11>   DW_AT_name        : (indirect string, offset: 0x8289d): UsageFault_Handler
    <f15>   DW_AT_decl_file   : 1
    <f15>   DW_AT_decl_line   : 131
    <f16>   DW_AT_decl_column : 6
    <f16>   DW_AT_prototyped  : 1
    <f16>   DW_AT_low_pc      : 0x800073c
    <f1a>   DW_AT_high_pc     : 0x8
    <f1e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f20>   DW_AT_call_all_calls: 1
 <1><f20>: Abbrev Number: 2 (DW_TAG_subprogram)
    <f21>   DW_AT_external    : 1
    <f21>   DW_AT_name        : (indirect string, offset: 0x8292c): BusFault_Handler
    <f25>   DW_AT_decl_file   : 1
    <f25>   DW_AT_decl_line   : 116
    <f26>   DW_AT_decl_column : 6
    <f26>   DW_AT_prototyped  : 1
    <f26>   DW_AT_low_pc      : 0x8000734
    <f2a>   DW_AT_high_pc     : 0x8
    <f2e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f30>   DW_AT_call_all_calls: 1
 <1><f30>: Abbrev Number: 2 (DW_TAG_subprogram)
    <f31>   DW_AT_external    : 1
    <f31>   DW_AT_name        : (indirect string, offset: 0x8290e): MemManage_Handler
    <f35>   DW_AT_decl_file   : 1
    <f35>   DW_AT_decl_line   : 101
    <f36>   DW_AT_decl_column : 6
    <f36>   DW_AT_prototyped  : 1
    <f36>   DW_AT_low_pc      : 0x800072c
    <f3a>   DW_AT_high_pc     : 0x8
    <f3e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f40>   DW_AT_call_all_calls: 1
 <1><f40>: Abbrev Number: 2 (DW_TAG_subprogram)
    <f41>   DW_AT_external    : 1
    <f41>   DW_AT_name        : (indirect string, offset: 0x828b0): HardFault_Handler
    <f45>   DW_AT_decl_file   : 1
    <f45>   DW_AT_decl_line   : 86
    <f46>   DW_AT_decl_column : 6
    <f46>   DW_AT_prototyped  : 1
    <f46>   DW_AT_low_pc      : 0x8000724
    <f4a>   DW_AT_high_pc     : 0x8
    <f4e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f50>   DW_AT_call_all_calls: 1
 <1><f50>: Abbrev Number: 2 (DW_TAG_subprogram)
    <f51>   DW_AT_external    : 1
    <f51>   DW_AT_name        : (indirect string, offset: 0x828e7): NMI_Handler
    <f55>   DW_AT_decl_file   : 1
    <f55>   DW_AT_decl_line   : 71
    <f56>   DW_AT_decl_column : 6
    <f56>   DW_AT_prototyped  : 1
    <f56>   DW_AT_low_pc      : 0x800071c
    <f5a>   DW_AT_high_pc     : 0x8
    <f5e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f60>   DW_AT_call_all_calls: 1
 <1><f60>: Abbrev Number: 0
  Compilation Unit @ offset 0xf61:
   Length:        0x53a (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x437
   Pointer Size:  4
 <0><f6d>: Abbrev Number: 14 (DW_TAG_compile_unit)
    <f6e>   DW_AT_producer    : (indirect string, offset: 0x75863): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <f72>   DW_AT_language    : 29	(C11)
    <f73>   DW_AT_name        : (indirect string, offset: 0x82973): ../Core/Src/system_stm32f4xx.c
