Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xa60 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 29 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x75822): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x4acd3): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x34613): D:/Personal studies/ITI embedded/workspace/my_Code/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 6 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x61676): signed char
 <1><31>: Abbrev Number: 4 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x7c1f): __uint8_t
    <36>   DW_AT_decl_file   : 3
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 6 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0x5d82b): unsigned char
 <1><44>: Abbrev Number: 6 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x4ede): short int
 <1><4b>: Abbrev Number: 4 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0x69547): __uint16_t
    <50>   DW_AT_decl_file   : 3
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 6 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0x41361): short unsigned int
 <1><5e>: Abbrev Number: 6 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x19f16): long int
 <1><65>: Abbrev Number: 4 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x39268): __uint32_t
    <6a>   DW_AT_decl_file   : 3
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 6 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x4cbe4): long unsigned int
 <1><78>: Abbrev Number: 6 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x33c0c): long long int
 <1><7f>: Abbrev Number: 6 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x2c20c): long long unsigned int
 <1><86>: Abbrev Number: 30 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 18 (DW_TAG_volatile_type)
    <8e>   DW_AT_type        : <0x86>
 <1><92>: Abbrev Number: 6 (DW_TAG_base_type)
    <93>   DW_AT_byte_size   : 4
    <94>   DW_AT_encoding    : 7	(unsigned)
    <95>   DW_AT_name        : (indirect string, offset: 0x46411): unsigned int
 <1><99>: Abbrev Number: 4 (DW_TAG_typedef)
    <9a>   DW_AT_name        : (indirect string, offset: 0x7c21): uint8_t
    <9e>   DW_AT_decl_file   : 4
    <9f>   DW_AT_decl_line   : 24
    <a0>   DW_AT_decl_column : 19
    <a1>   DW_AT_type        : <0x31>
 <1><a5>: Abbrev Number: 11 (DW_TAG_const_type)
    <a6>   DW_AT_type        : <0x99>
 <1><aa>: Abbrev Number: 4 (DW_TAG_typedef)
    <ab>   DW_AT_name        : (indirect string, offset: 0x4b1a7): uint16_t
    <af>   DW_AT_decl_file   : 4
    <b0>   DW_AT_decl_line   : 36
    <b1>   DW_AT_decl_column : 20
    <b2>   DW_AT_type        : <0x4b>
 <1><b6>: Abbrev Number: 4 (DW_TAG_typedef)
    <b7>   DW_AT_name        : (indirect string, offset: 0x3297f): uint32_t
    <bb>   DW_AT_decl_file   : 4
    <bc>   DW_AT_decl_line   : 48
    <bd>   DW_AT_decl_column : 20
    <be>   DW_AT_type        : <0x65>
 <1><c2>: Abbrev Number: 18 (DW_TAG_volatile_type)
    <c3>   DW_AT_type        : <0xb6>
 <1><c7>: Abbrev Number: 13 (DW_TAG_array_type)
    <c8>   DW_AT_type        : <0xb6>
    <cc>   DW_AT_sibling     : <0xd7>
 <2><d0>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <d1>   DW_AT_type        : <0x92>
    <d5>   DW_AT_upper_bound : 0
 <2><d6>: Abbrev Number: 0
 <1><d7>: Abbrev Number: 13 (DW_TAG_array_type)
    <d8>   DW_AT_type        : <0xb6>
    <dc>   DW_AT_sibling     : <0xe7>
 <2><e0>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <e1>   DW_AT_type        : <0x92>
    <e5>   DW_AT_upper_bound : 1
 <2><e6>: Abbrev Number: 0
 <1><e7>: Abbrev Number: 19 (DW_TAG_structure_type)
    <e8>   DW_AT_byte_size   : 40
    <e9>   DW_AT_decl_file   : 5
    <e9>   DW_AT_decl_line   : 264
    <eb>   DW_AT_decl_column : 9
    <eb>   DW_AT_sibling     : <0x15c>
 <2><ef>: Abbrev Number: 2 (DW_TAG_member)
    <f0>   DW_AT_name        : (indirect string, offset: 0x62854): MODER
    <f4>   DW_AT_decl_file   : 5
    <f4>   DW_AT_decl_line   : 266
    <f6>   DW_AT_decl_column : 17
    <f6>   DW_AT_type        : <0xc2>
    <fa>   DW_AT_data_member_location: 0
 <2><fb>: Abbrev Number: 2 (DW_TAG_member)
    <fc>   DW_AT_name        : (indirect string, offset: 0x3415d): OTYPER
    <100>   DW_AT_decl_file   : 5
    <100>   DW_AT_decl_line   : 267
    <102>   DW_AT_decl_column : 17
    <102>   DW_AT_type        : <0xc2>
    <106>   DW_AT_data_member_location: 4
 <2><107>: Abbrev Number: 2 (DW_TAG_member)
    <108>   DW_AT_name        : (indirect string, offset: 0x295cc): OSPEEDR
    <10c>   DW_AT_decl_file   : 5
    <10c>   DW_AT_decl_line   : 268
    <10e>   DW_AT_decl_column : 17
    <10e>   DW_AT_type        : <0xc2>
    <112>   DW_AT_data_member_location: 8
 <2><113>: Abbrev Number: 2 (DW_TAG_member)
    <114>   DW_AT_name        : (indirect string, offset: 0x8196a): PUPDR
    <118>   DW_AT_decl_file   : 5
    <118>   DW_AT_decl_line   : 269
    <11a>   DW_AT_decl_column : 17
    <11a>   DW_AT_type        : <0xc2>
    <11e>   DW_AT_data_member_location: 12
 <2><11f>: Abbrev Number: 7 (DW_TAG_member)
    <120>   DW_AT_name        : IDR
    <124>   DW_AT_decl_file   : 5
    <124>   DW_AT_decl_line   : 270
    <126>   DW_AT_decl_column : 17
    <126>   DW_AT_type        : <0xc2>
    <12a>   DW_AT_data_member_location: 16
 <2><12b>: Abbrev Number: 7 (DW_TAG_member)
    <12c>   DW_AT_name        : ODR
    <130>   DW_AT_decl_file   : 5
    <130>   DW_AT_decl_line   : 271
    <132>   DW_AT_decl_column : 17
    <132>   DW_AT_type        : <0xc2>
    <136>   DW_AT_data_member_location: 20
 <2><137>: Abbrev Number: 2 (DW_TAG_member)
    <138>   DW_AT_name        : (indirect string, offset: 0x5bed2): BSRR
    <13c>   DW_AT_decl_file   : 5
    <13c>   DW_AT_decl_line   : 272
    <13e>   DW_AT_decl_column : 17
    <13e>   DW_AT_type        : <0xc2>
    <142>   DW_AT_data_member_location: 24
 <2><143>: Abbrev Number: 2 (DW_TAG_member)
    <144>   DW_AT_name        : (indirect string, offset: 0x22a5d): LCKR
    <148>   DW_AT_decl_file   : 5
    <148>   DW_AT_decl_line   : 273
    <14a>   DW_AT_decl_column : 17
    <14a>   DW_AT_type        : <0xc2>
    <14e>   DW_AT_data_member_location: 28
 <2><14f>: Abbrev Number: 7 (DW_TAG_member)
    <150>   DW_AT_name        : AFR
    <154>   DW_AT_decl_file   : 5
    <154>   DW_AT_decl_line   : 274
    <156>   DW_AT_decl_column : 17
    <156>   DW_AT_type        : <0x16c>
    <15a>   DW_AT_data_member_location: 32
 <2><15b>: Abbrev Number: 0
 <1><15c>: Abbrev Number: 13 (DW_TAG_array_type)
    <15d>   DW_AT_type        : <0xc2>
    <161>   DW_AT_sibling     : <0x16c>
 <2><165>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <166>   DW_AT_type        : <0x92>
    <16a>   DW_AT_upper_bound : 1
 <2><16b>: Abbrev Number: 0
 <1><16c>: Abbrev Number: 18 (DW_TAG_volatile_type)
    <16d>   DW_AT_type        : <0x15c>
 <1><171>: Abbrev Number: 20 (DW_TAG_typedef)
    <172>   DW_AT_name        : (indirect string, offset: 0x6b912): GPIO_TypeDef
    <176>   DW_AT_decl_file   : 5
    <176>   DW_AT_decl_line   : 275
    <178>   DW_AT_decl_column : 3
    <178>   DW_AT_type        : <0xe7>
 <1><17c>: Abbrev Number: 19 (DW_TAG_structure_type)
    <17d>   DW_AT_byte_size   : 8
    <17e>   DW_AT_decl_file   : 5
    <17e>   DW_AT_decl_line   : 325
    <180>   DW_AT_decl_column : 9
    <180>   DW_AT_sibling     : <0x19c>
 <2><184>: Abbrev Number: 7 (DW_TAG_member)
    <185>   DW_AT_name        : CR
    <188>   DW_AT_decl_file   : 5
    <188>   DW_AT_decl_line   : 327
    <18a>   DW_AT_decl_column : 17
    <18a>   DW_AT_type        : <0xc2>
    <18e>   DW_AT_data_member_location: 0
 <2><18f>: Abbrev Number: 7 (DW_TAG_member)
    <190>   DW_AT_name        : CSR
    <194>   DW_AT_decl_file   : 5
    <194>   DW_AT_decl_line   : 328
    <196>   DW_AT_decl_column : 17
    <196>   DW_AT_type        : <0xc2>
    <19a>   DW_AT_data_member_location: 4
 <2><19b>: Abbrev Number: 0
 <1><19c>: Abbrev Number: 20 (DW_TAG_typedef)
    <19d>   DW_AT_name        : (indirect string, offset: 0x77d5d): PWR_TypeDef
    <1a1>   DW_AT_decl_file   : 5
    <1a1>   DW_AT_decl_line   : 329
    <1a3>   DW_AT_decl_column : 3
    <1a3>   DW_AT_type        : <0x17c>
 <1><1a7>: Abbrev Number: 19 (DW_TAG_structure_type)
    <1a8>   DW_AT_byte_size   : 144
    <1a9>   DW_AT_decl_file   : 5
    <1a9>   DW_AT_decl_line   : 335
    <1ab>   DW_AT_decl_column : 9
    <1ab>   DW_AT_sibling     : <0x32f>
 <2><1af>: Abbrev Number: 7 (DW_TAG_member)
    <1b0>   DW_AT_name        : CR
    <1b3>   DW_AT_decl_file   : 5
    <1b3>   DW_AT_decl_line   : 337
    <1b5>   DW_AT_decl_column : 17
    <1b5>   DW_AT_type        : <0xc2>
    <1b9>   DW_AT_data_member_location: 0
 <2><1ba>: Abbrev Number: 2 (DW_TAG_member)
    <1bb>   DW_AT_name        : (indirect string, offset: 0x356e0): PLLCFGR
    <1bf>   DW_AT_decl_file   : 5
    <1bf>   DW_AT_decl_line   : 338
    <1c1>   DW_AT_decl_column : 17
    <1c1>   DW_AT_type        : <0xc2>
    <1c5>   DW_AT_data_member_location: 4
 <2><1c6>: Abbrev Number: 2 (DW_TAG_member)
    <1c7>   DW_AT_name        : (indirect string, offset: 0x65488): CFGR
    <1cb>   DW_AT_decl_file   : 5
    <1cb>   DW_AT_decl_line   : 339
    <1cd>   DW_AT_decl_column : 17
    <1cd>   DW_AT_type        : <0xc2>
    <1d1>   DW_AT_data_member_location: 8
 <2><1d2>: Abbrev Number: 7 (DW_TAG_member)
    <1d3>   DW_AT_name        : CIR
    <1d7>   DW_AT_decl_file   : 5
    <1d7>   DW_AT_decl_line   : 340
    <1d9>   DW_AT_decl_column : 17
    <1d9>   DW_AT_type        : <0xc2>
    <1dd>   DW_AT_data_member_location: 12
 <2><1de>: Abbrev Number: 2 (DW_TAG_member)
    <1df>   DW_AT_name        : (indirect string, offset: 0x55d41): AHB1RSTR
    <1e3>   DW_AT_decl_file   : 5
    <1e3>   DW_AT_decl_line   : 341
    <1e5>   DW_AT_decl_column : 17
    <1e5>   DW_AT_type        : <0xc2>
    <1e9>   DW_AT_data_member_location: 16
 <2><1ea>: Abbrev Number: 2 (DW_TAG_member)
    <1eb>   DW_AT_name        : (indirect string, offset: 0x6a38a): AHB2RSTR
    <1ef>   DW_AT_decl_file   : 5
    <1ef>   DW_AT_decl_line   : 342
    <1f1>   DW_AT_decl_column : 17
    <1f1>   DW_AT_type        : <0xc2>
    <1f5>   DW_AT_data_member_location: 20
 <2><1f6>: Abbrev Number: 2 (DW_TAG_member)
    <1f7>   DW_AT_name        : (indirect string, offset: 0x7f33f): AHB3RSTR
    <1fb>   DW_AT_decl_file   : 5
    <1fb>   DW_AT_decl_line   : 343
    <1fd>   DW_AT_decl_column : 17
    <1fd>   DW_AT_type        : <0xc2>
    <201>   DW_AT_data_member_location: 24
 <2><202>: Abbrev Number: 2 (DW_TAG_member)
    <203>   DW_AT_name        : (indirect string, offset: 0xf7cb): RESERVED0
    <207>   DW_AT_decl_file   : 5
    <207>   DW_AT_decl_line   : 344
    <209>   DW_AT_decl_column : 17
    <209>   DW_AT_type        : <0xb6>
    <20d>   DW_AT_data_member_location: 28
 <2><20e>: Abbrev Number: 2 (DW_TAG_member)
    <20f>   DW_AT_name        : (indirect string, offset: 0x195cb): APB1RSTR
    <213>   DW_AT_decl_file   : 5
    <213>   DW_AT_decl_line   : 345
    <215>   DW_AT_decl_column : 17
    <215>   DW_AT_type        : <0xc2>
    <219>   DW_AT_data_member_location: 32
 <2><21a>: Abbrev Number: 2 (DW_TAG_member)
    <21b>   DW_AT_name        : (indirect string, offset: 0xae4c): APB2RSTR
    <21f>   DW_AT_decl_file   : 5
    <21f>   DW_AT_decl_line   : 346
    <221>   DW_AT_decl_column : 17
    <221>   DW_AT_type        : <0xc2>
    <225>   DW_AT_data_member_location: 36
 <2><226>: Abbrev Number: 2 (DW_TAG_member)
    <227>   DW_AT_name        : (indirect string, offset: 0xf7f0): RESERVED1
    <22b>   DW_AT_decl_file   : 5
    <22b>   DW_AT_decl_line   : 347
    <22d>   DW_AT_decl_column : 17
    <22d>   DW_AT_type        : <0xd7>
    <231>   DW_AT_data_member_location: 40
 <2><232>: Abbrev Number: 2 (DW_TAG_member)
    <233>   DW_AT_name        : (indirect string, offset: 0x684a9): AHB1ENR
    <237>   DW_AT_decl_file   : 5
    <237>   DW_AT_decl_line   : 348
    <239>   DW_AT_decl_column : 17
    <239>   DW_AT_type        : <0xc2>
    <23d>   DW_AT_data_member_location: 48
 <2><23e>: Abbrev Number: 2 (DW_TAG_member)
    <23f>   DW_AT_name        : (indirect string, offset: 0x16266): AHB2ENR
    <243>   DW_AT_decl_file   : 5
    <243>   DW_AT_decl_line   : 349
    <245>   DW_AT_decl_column : 17
    <245>   DW_AT_type        : <0xc2>
    <249>   DW_AT_data_member_location: 52
 <2><24a>: Abbrev Number: 2 (DW_TAG_member)
    <24b>   DW_AT_name        : (indirect string, offset: 0x13e8): AHB3ENR
    <24f>   DW_AT_decl_file   : 5
    <24f>   DW_AT_decl_line   : 350
    <251>   DW_AT_decl_column : 17
    <251>   DW_AT_type        : <0xc2>
    <255>   DW_AT_data_member_location: 56
 <2><256>: Abbrev Number: 2 (DW_TAG_member)
    <257>   DW_AT_name        : (indirect string, offset: 0x522ce): RESERVED2
    <25b>   DW_AT_decl_file   : 5
    <25b>   DW_AT_decl_line   : 351
    <25d>   DW_AT_decl_column : 17
    <25d>   DW_AT_type        : <0xb6>
    <261>   DW_AT_data_member_location: 60
 <2><262>: Abbrev Number: 2 (DW_TAG_member)
    <263>   DW_AT_name        : (indirect string, offset: 0x25c25): APB1ENR
    <267>   DW_AT_decl_file   : 5
    <267>   DW_AT_decl_line   : 352
    <269>   DW_AT_decl_column : 17
    <269>   DW_AT_type        : <0xc2>
    <26d>   DW_AT_data_member_location: 64
 <2><26e>: Abbrev Number: 2 (DW_TAG_member)
    <26f>   DW_AT_name        : (indirect string, offset: 0x5318c): APB2ENR
    <273>   DW_AT_decl_file   : 5
    <273>   DW_AT_decl_line   : 353
    <275>   DW_AT_decl_column : 17
    <275>   DW_AT_type        : <0xc2>
    <279>   DW_AT_data_member_location: 68
 <2><27a>: Abbrev Number: 2 (DW_TAG_member)
    <27b>   DW_AT_name        : (indirect string, offset: 0x522d8): RESERVED3
    <27f>   DW_AT_decl_file   : 5
    <27f>   DW_AT_decl_line   : 354
    <281>   DW_AT_decl_column : 17
    <281>   DW_AT_type        : <0xd7>
    <285>   DW_AT_data_member_location: 72
 <2><286>: Abbrev Number: 2 (DW_TAG_member)
    <287>   DW_AT_name        : (indirect string, offset: 0x2591c): AHB1LPENR
    <28b>   DW_AT_decl_file   : 5
    <28b>   DW_AT_decl_line   : 355
    <28d>   DW_AT_decl_column : 17
    <28d>   DW_AT_type        : <0xc2>
    <291>   DW_AT_data_member_location: 80
 <2><292>: Abbrev Number: 2 (DW_TAG_member)
    <293>   DW_AT_name        : (indirect string, offset: 0x59417): AHB2LPENR
    <297>   DW_AT_decl_file   : 5
    <297>   DW_AT_decl_line   : 356
    <299>   DW_AT_decl_column : 17
    <299>   DW_AT_type        : <0xc2>
    <29d>   DW_AT_data_member_location: 84
 <2><29e>: Abbrev Number: 2 (DW_TAG_member)
    <29f>   DW_AT_name        : (indirect string, offset: 0x6622c): AHB3LPENR
    <2a3>   DW_AT_decl_file   : 5
    <2a3>   DW_AT_decl_line   : 357
    <2a5>   DW_AT_decl_column : 17
    <2a5>   DW_AT_type        : <0xc2>
    <2a9>   DW_AT_data_member_location: 88
 <2><2aa>: Abbrev Number: 2 (DW_TAG_member)
    <2ab>   DW_AT_name        : (indirect string, offset: 0x522e2): RESERVED4
    <2af>   DW_AT_decl_file   : 5
    <2af>   DW_AT_decl_line   : 358
    <2b1>   DW_AT_decl_column : 17
    <2b1>   DW_AT_type        : <0xb6>
    <2b5>   DW_AT_data_member_location: 92
 <2><2b6>: Abbrev Number: 2 (DW_TAG_member)
    <2b7>   DW_AT_name        : (indirect string, offset: 0x67adf): APB1LPENR
    <2bb>   DW_AT_decl_file   : 5
    <2bb>   DW_AT_decl_line   : 359
    <2bd>   DW_AT_decl_column : 17
    <2bd>   DW_AT_type        : <0xc2>
    <2c1>   DW_AT_data_member_location: 96
 <2><2c2>: Abbrev Number: 2 (DW_TAG_member)
    <2c3>   DW_AT_name        : (indirect string, offset: 0x8055e): APB2LPENR
    <2c7>   DW_AT_decl_file   : 5
    <2c7>   DW_AT_decl_line   : 360
    <2c9>   DW_AT_decl_column : 17
    <2c9>   DW_AT_type        : <0xc2>
    <2cd>   DW_AT_data_member_location: 100
 <2><2ce>: Abbrev Number: 2 (DW_TAG_member)
    <2cf>   DW_AT_name        : (indirect string, offset: 0x522ec): RESERVED5
    <2d3>   DW_AT_decl_file   : 5
    <2d3>   DW_AT_decl_line   : 361
    <2d5>   DW_AT_decl_column : 17
    <2d5>   DW_AT_type        : <0xd7>
    <2d9>   DW_AT_data_member_location: 104
 <2><2da>: Abbrev Number: 2 (DW_TAG_member)
    <2db>   DW_AT_name        : (indirect string, offset: 0x82117): BDCR
    <2df>   DW_AT_decl_file   : 5
    <2df>   DW_AT_decl_line   : 362
    <2e1>   DW_AT_decl_column : 17
    <2e1>   DW_AT_type        : <0xc2>
    <2e5>   DW_AT_data_member_location: 112
 <2><2e6>: Abbrev Number: 7 (DW_TAG_member)
    <2e7>   DW_AT_name        : CSR
    <2eb>   DW_AT_decl_file   : 5
    <2eb>   DW_AT_decl_line   : 363
    <2ed>   DW_AT_decl_column : 17
    <2ed>   DW_AT_type        : <0xc2>
    <2f1>   DW_AT_data_member_location: 116
 <2><2f2>: Abbrev Number: 2 (DW_TAG_member)
    <2f3>   DW_AT_name        : (indirect string, offset: 0x9091): RESERVED6
    <2f7>   DW_AT_decl_file   : 5
    <2f7>   DW_AT_decl_line   : 364
    <2f9>   DW_AT_decl_column : 17
    <2f9>   DW_AT_type        : <0xd7>
    <2fd>   DW_AT_data_member_location: 120
 <2><2fe>: Abbrev Number: 2 (DW_TAG_member)
    <2ff>   DW_AT_name        : (indirect string, offset: 0x6e9b5): SSCGR
    <303>   DW_AT_decl_file   : 5
    <303>   DW_AT_decl_line   : 365
    <305>   DW_AT_decl_column : 17
    <305>   DW_AT_type        : <0xc2>
    <309>   DW_AT_data_member_location: 128
 <2><30a>: Abbrev Number: 2 (DW_TAG_member)
    <30b>   DW_AT_name        : (indirect string, offset: 0xd87f): PLLI2SCFGR
    <30f>   DW_AT_decl_file   : 5
    <30f>   DW_AT_decl_line   : 366
    <311>   DW_AT_decl_column : 17
    <311>   DW_AT_type        : <0xc2>
    <315>   DW_AT_data_member_location: 132
 <2><316>: Abbrev Number: 2 (DW_TAG_member)
    <317>   DW_AT_name        : (indirect string, offset: 0x52329): RESERVED7
    <31b>   DW_AT_decl_file   : 5
    <31b>   DW_AT_decl_line   : 367
    <31d>   DW_AT_decl_column : 17
    <31d>   DW_AT_type        : <0xc7>
    <321>   DW_AT_data_member_location: 136
 <2><322>: Abbrev Number: 2 (DW_TAG_member)
    <323>   DW_AT_name        : (indirect string, offset: 0x65485): DCKCFGR
    <327>   DW_AT_decl_file   : 5
    <327>   DW_AT_decl_line   : 368
    <329>   DW_AT_decl_column : 17
    <329>   DW_AT_type        : <0xc2>
    <32d>   DW_AT_data_member_location: 140
 <2><32e>: Abbrev Number: 0
 <1><32f>: Abbrev Number: 20 (DW_TAG_typedef)
    <330>   DW_AT_name        : (indirect string, offset: 0x1ad02): RCC_TypeDef
    <334>   DW_AT_decl_file   : 5
    <334>   DW_AT_decl_line   : 369
    <336>   DW_AT_decl_column : 3
    <336>   DW_AT_type        : <0x1a7>
 <1><33a>: Abbrev Number: 6 (DW_TAG_base_type)
    <33b>   DW_AT_byte_size   : 8
    <33c>   DW_AT_encoding    : 4	(float)
    <33d>   DW_AT_name        : (indirect string, offset: 0x8860e): long double
 <1><341>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <342>   DW_AT_encoding    : 7	(unsigned)
    <343>   DW_AT_byte_size   : 1
    <344>   DW_AT_type        : <0x3d>
    <348>   DW_AT_decl_file   : 6
    <349>   DW_AT_decl_line   : 39
    <34a>   DW_AT_decl_column : 1
    <34b>   DW_AT_sibling     : <0x368>
 <2><34f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <350>   DW_AT_name        : (indirect string, offset: 0x57c33): HAL_OK
    <354>   DW_AT_const_value : 0
 <2><355>: Abbrev Number: 1 (DW_TAG_enumerator)
    <356>   DW_AT_name        : (indirect string, offset: 0x45ba4): HAL_ERROR
    <35a>   DW_AT_const_value : 1
 <2><35b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <35c>   DW_AT_name        : (indirect string, offset: 0x53b8): HAL_BUSY
    <360>   DW_AT_const_value : 2
 <2><361>: Abbrev Number: 1 (DW_TAG_enumerator)
    <362>   DW_AT_name        : (indirect string, offset: 0x44bd3): HAL_TIMEOUT
    <366>   DW_AT_const_value : 3
 <2><367>: Abbrev Number: 0
 <1><368>: Abbrev Number: 4 (DW_TAG_typedef)
    <369>   DW_AT_name        : (indirect string, offset: 0x7b274): HAL_StatusTypeDef
    <36d>   DW_AT_decl_file   : 6
    <36e>   DW_AT_decl_line   : 44
    <36f>   DW_AT_decl_column : 3
    <370>   DW_AT_type        : <0x341>
 <1><374>: Abbrev Number: 12 (DW_TAG_structure_type)
    <375>   DW_AT_byte_size   : 24
    <376>   DW_AT_decl_file   : 7
    <377>   DW_AT_decl_line   : 45
    <378>   DW_AT_decl_column : 9
    <378>   DW_AT_sibling     : <0x3cb>
 <2><37c>: Abbrev Number: 3 (DW_TAG_member)
    <37d>   DW_AT_name        : (indirect string, offset: 0x744ca): PLLState
    <381>   DW_AT_decl_file   : 7
    <382>   DW_AT_decl_line   : 47
    <383>   DW_AT_decl_column : 12
    <384>   DW_AT_type        : <0xb6>
    <388>   DW_AT_data_member_location: 0
 <2><389>: Abbrev Number: 3 (DW_TAG_member)
    <38a>   DW_AT_name        : (indirect string, offset: 0x55250): PLLSource
    <38e>   DW_AT_decl_file   : 7
    <38f>   DW_AT_decl_line   : 50
    <390>   DW_AT_decl_column : 12
    <391>   DW_AT_type        : <0xb6>
    <395>   DW_AT_data_member_location: 4
 <2><396>: Abbrev Number: 3 (DW_TAG_member)
    <397>   DW_AT_name        : (indirect string, offset: 0x4a9a5): PLLM
    <39b>   DW_AT_decl_file   : 7
    <39c>   DW_AT_decl_line   : 53
    <39d>   DW_AT_decl_column : 12
    <39e>   DW_AT_type        : <0xb6>
    <3a2>   DW_AT_data_member_location: 8
 <2><3a3>: Abbrev Number: 3 (DW_TAG_member)
    <3a4>   DW_AT_name        : (indirect string, offset: 0x6a026): PLLN
    <3a8>   DW_AT_decl_file   : 7
    <3a9>   DW_AT_decl_line   : 56
    <3aa>   DW_AT_decl_column : 12
    <3ab>   DW_AT_type        : <0xb6>
    <3af>   DW_AT_data_member_location: 12
 <2><3b0>: Abbrev Number: 3 (DW_TAG_member)
    <3b1>   DW_AT_name        : (indirect string, offset: 0x6a053): PLLP
    <3b5>   DW_AT_decl_file   : 7
    <3b6>   DW_AT_decl_line   : 60
    <3b7>   DW_AT_decl_column : 12
    <3b8>   DW_AT_type        : <0xb6>
    <3bc>   DW_AT_data_member_location: 16
 <2><3bd>: Abbrev Number: 3 (DW_TAG_member)
    <3be>   DW_AT_name        : (indirect string, offset: 0x71474): PLLQ
    <3c2>   DW_AT_decl_file   : 7
    <3c3>   DW_AT_decl_line   : 63
    <3c4>   DW_AT_decl_column : 12
    <3c5>   DW_AT_type        : <0xb6>
    <3c9>   DW_AT_data_member_location: 20
 <2><3ca>: Abbrev Number: 0
 <1><3cb>: Abbrev Number: 4 (DW_TAG_typedef)
    <3cc>   DW_AT_name        : (indirect string, offset: 0x5f488): RCC_PLLInitTypeDef
    <3d0>   DW_AT_decl_file   : 7
    <3d1>   DW_AT_decl_line   : 73
    <3d2>   DW_AT_decl_column : 3
    <3d3>   DW_AT_type        : <0x374>
 <1><3d7>: Abbrev Number: 12 (DW_TAG_structure_type)
    <3d8>   DW_AT_byte_size   : 48
    <3d9>   DW_AT_decl_file   : 8
    <3da>   DW_AT_decl_line   : 49
    <3db>   DW_AT_decl_column : 9
    <3db>   DW_AT_sibling     : <0x43b>
 <2><3df>: Abbrev Number: 3 (DW_TAG_member)
    <3e0>   DW_AT_name        : (indirect string, offset: 0x81c8f): OscillatorType
    <3e4>   DW_AT_decl_file   : 8
    <3e5>   DW_AT_decl_line   : 51
    <3e6>   DW_AT_decl_column : 12
    <3e7>   DW_AT_type        : <0xb6>
    <3eb>   DW_AT_data_member_location: 0
 <2><3ec>: Abbrev Number: 3 (DW_TAG_member)
    <3ed>   DW_AT_name        : (indirect string, offset: 0x2754e): HSEState
    <3f1>   DW_AT_decl_file   : 8
    <3f2>   DW_AT_decl_line   : 54
    <3f3>   DW_AT_decl_column : 12
    <3f4>   DW_AT_type        : <0xb6>
    <3f8>   DW_AT_data_member_location: 4
 <2><3f9>: Abbrev Number: 3 (DW_TAG_member)
    <3fa>   DW_AT_name        : (indirect string, offset: 0x437fa): LSEState
    <3fe>   DW_AT_decl_file   : 8
    <3ff>   DW_AT_decl_line   : 57
    <400>   DW_AT_decl_column : 12
    <401>   DW_AT_type        : <0xb6>
    <405>   DW_AT_data_member_location: 8
 <2><406>: Abbrev Number: 3 (DW_TAG_member)
    <407>   DW_AT_name        : (indirect string, offset: 0x62ea): HSIState
    <40b>   DW_AT_decl_file   : 8
    <40c>   DW_AT_decl_line   : 60
    <40d>   DW_AT_decl_column : 12
    <40e>   DW_AT_type        : <0xb6>
    <412>   DW_AT_data_member_location: 12
 <2><413>: Abbrev Number: 3 (DW_TAG_member)
    <414>   DW_AT_name        : (indirect string, offset: 0x3fe74): HSICalibrationValue
    <418>   DW_AT_decl_file   : 8
    <419>   DW_AT_decl_line   : 63
    <41a>   DW_AT_decl_column : 12
    <41b>   DW_AT_type        : <0xb6>
    <41f>   DW_AT_data_member_location: 16
 <2><420>: Abbrev Number: 3 (DW_TAG_member)
    <421>   DW_AT_name        : (indirect string, offset: 0x1c1a8): LSIState
    <425>   DW_AT_decl_file   : 8
    <426>   DW_AT_decl_line   : 66
    <427>   DW_AT_decl_column : 12
    <428>   DW_AT_type        : <0xb6>
    <42c>   DW_AT_data_member_location: 20
 <2><42d>: Abbrev Number: 22 (DW_TAG_member)
    <42e>   DW_AT_name        : PLL
    <432>   DW_AT_decl_file   : 8
    <433>   DW_AT_decl_line   : 69
    <434>   DW_AT_decl_column : 22
    <435>   DW_AT_type        : <0x3cb>
    <439>   DW_AT_data_member_location: 24
 <2><43a>: Abbrev Number: 0
 <1><43b>: Abbrev Number: 4 (DW_TAG_typedef)
    <43c>   DW_AT_name        : (indirect string, offset: 0x631e9): RCC_OscInitTypeDef
    <440>   DW_AT_decl_file   : 8
    <441>   DW_AT_decl_line   : 70
    <442>   DW_AT_decl_column : 3
    <443>   DW_AT_type        : <0x3d7>
 <1><447>: Abbrev Number: 11 (DW_TAG_const_type)
    <448>   DW_AT_type        : <0x43b>
 <1><44c>: Abbrev Number: 12 (DW_TAG_structure_type)
    <44d>   DW_AT_byte_size   : 20
    <44e>   DW_AT_decl_file   : 8
    <44f>   DW_AT_decl_line   : 75
    <450>   DW_AT_decl_column : 9
    <450>   DW_AT_sibling     : <0x496>
 <2><454>: Abbrev Number: 3 (DW_TAG_member)
    <455>   DW_AT_name        : (indirect string, offset: 0x16ff9): ClockType
    <459>   DW_AT_decl_file   : 8
    <45a>   DW_AT_decl_line   : 77
    <45b>   DW_AT_decl_column : 12
    <45c>   DW_AT_type        : <0xb6>
    <460>   DW_AT_data_member_location: 0
 <2><461>: Abbrev Number: 3 (DW_TAG_member)
    <462>   DW_AT_name        : (indirect string, offset: 0x37fa4): SYSCLKSource
    <466>   DW_AT_decl_file   : 8
    <467>   DW_AT_decl_line   : 80
    <468>   DW_AT_decl_column : 12
    <469>   DW_AT_type        : <0xb6>
    <46d>   DW_AT_data_member_location: 4
 <2><46e>: Abbrev Number: 3 (DW_TAG_member)
    <46f>   DW_AT_name        : (indirect string, offset: 0x5ecc): AHBCLKDivider
    <473>   DW_AT_decl_file   : 8
    <474>   DW_AT_decl_line   : 83
    <475>   DW_AT_decl_column : 12
    <476>   DW_AT_type        : <0xb6>
    <47a>   DW_AT_data_member_location: 8
 <2><47b>: Abbrev Number: 3 (DW_TAG_member)
    <47c>   DW_AT_name        : (indirect string, offset: 0x4180e): APB1CLKDivider
    <480>   DW_AT_decl_file   : 8
    <481>   DW_AT_decl_line   : 86
    <482>   DW_AT_decl_column : 12
    <483>   DW_AT_type        : <0xb6>
    <487>   DW_AT_data_member_location: 12
 <2><488>: Abbrev Number: 3 (DW_TAG_member)
    <489>   DW_AT_name        : (indirect string, offset: 0x10407): APB2CLKDivider
    <48d>   DW_AT_decl_file   : 8
    <48e>   DW_AT_decl_line   : 89
    <48f>   DW_AT_decl_column : 12
    <490>   DW_AT_type        : <0xb6>
    <494>   DW_AT_data_member_location: 16
 <2><495>: Abbrev Number: 0
 <1><496>: Abbrev Number: 4 (DW_TAG_typedef)
    <497>   DW_AT_name        : (indirect string, offset: 0x7b13d): RCC_ClkInitTypeDef
    <49b>   DW_AT_decl_file   : 8
    <49c>   DW_AT_decl_line   : 92
    <49d>   DW_AT_decl_column : 3
    <49e>   DW_AT_type        : <0x44c>
 <1><4a2>: Abbrev Number: 11 (DW_TAG_const_type)
    <4a3>   DW_AT_type        : <0x496>
 <1><4a7>: Abbrev Number: 12 (DW_TAG_structure_type)
    <4a8>   DW_AT_byte_size   : 20
    <4a9>   DW_AT_decl_file   : 9
    <4aa>   DW_AT_decl_line   : 46
    <4ab>   DW_AT_decl_column : 9
    <4ab>   DW_AT_sibling     : <0x4f1>
 <2><4af>: Abbrev Number: 22 (DW_TAG_member)
    <4b0>   DW_AT_name        : Pin
    <4b4>   DW_AT_decl_file   : 9
    <4b5>   DW_AT_decl_line   : 48
    <4b6>   DW_AT_decl_column : 12
    <4b7>   DW_AT_type        : <0xb6>
    <4bb>   DW_AT_data_member_location: 0
 <2><4bc>: Abbrev Number: 3 (DW_TAG_member)
    <4bd>   DW_AT_name        : (indirect string, offset: 0x8b6d7): Mode
    <4c1>   DW_AT_decl_file   : 9
    <4c2>   DW_AT_decl_line   : 51
    <4c3>   DW_AT_decl_column : 12
    <4c4>   DW_AT_type        : <0xb6>
    <4c8>   DW_AT_data_member_location: 4
 <2><4c9>: Abbrev Number: 3 (DW_TAG_member)
    <4ca>   DW_AT_name        : (indirect string, offset: 0x299d0): Pull
    <4ce>   DW_AT_decl_file   : 9
    <4cf>   DW_AT_decl_line   : 54
    <4d0>   DW_AT_decl_column : 12
    <4d1>   DW_AT_type        : <0xb6>
    <4d5>   DW_AT_data_member_location: 8
 <2><4d6>: Abbrev Number: 3 (DW_TAG_member)
    <4d7>   DW_AT_name        : (indirect string, offset: 0x6026e): Speed
    <4db>   DW_AT_decl_file   : 9
    <4dc>   DW_AT_decl_line   : 57
    <4dd>   DW_AT_decl_column : 12
    <4de>   DW_AT_type        : <0xb6>
    <4e2>   DW_AT_data_member_location: 12
 <2><4e3>: Abbrev Number: 3 (DW_TAG_member)
    <4e4>   DW_AT_name        : (indirect string, offset: 0x22355): Alternate
    <4e8>   DW_AT_decl_file   : 9
    <4e9>   DW_AT_decl_line   : 60
    <4ea>   DW_AT_decl_column : 12
    <4eb>   DW_AT_type        : <0xb6>
    <4ef>   DW_AT_data_member_location: 16
 <2><4f0>: Abbrev Number: 0
 <1><4f1>: Abbrev Number: 4 (DW_TAG_typedef)
    <4f2>   DW_AT_name        : (indirect string, offset: 0x7c3b3): GPIO_InitTypeDef
    <4f6>   DW_AT_decl_file   : 9
    <4f7>   DW_AT_decl_line   : 62
    <4f8>   DW_AT_decl_column : 2
    <4f9>   DW_AT_type        : <0x4a7>
 <1><4fd>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <4fe>   DW_AT_encoding    : 7	(unsigned)
    <4ff>   DW_AT_byte_size   : 1
    <500>   DW_AT_type        : <0x3d>
    <504>   DW_AT_decl_file   : 9
    <505>   DW_AT_decl_line   : 68
    <506>   DW_AT_decl_column : 1
    <507>   DW_AT_sibling     : <0x518>
 <2><50b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <50c>   DW_AT_name        : (indirect string, offset: 0x61bbb): GPIO_PIN_RESET
    <510>   DW_AT_const_value : 0
 <2><511>: Abbrev Number: 1 (DW_TAG_enumerator)
    <512>   DW_AT_name        : (indirect string, offset: 0x250f7): GPIO_PIN_SET
    <516>   DW_AT_const_value : 1
 <2><517>: Abbrev Number: 0
 <1><518>: Abbrev Number: 4 (DW_TAG_typedef)
    <519>   DW_AT_name        : (indirect string, offset: 0x46fe2): GPIO_PinState
    <51d>   DW_AT_decl_file   : 9
    <51e>   DW_AT_decl_line   : 71
    <51f>   DW_AT_decl_column : 2
    <520>   DW_AT_type        : <0x4fd>
 <1><524>: Abbrev Number: 31 (DW_TAG_pointer_type)
    <525>   DW_AT_byte_size   : 4
 <1><526>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <527>   DW_AT_byte_size   : 4
    <527>   DW_AT_type        : <0x52b>
 <1><52b>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <52c>   DW_AT_prototyped  : 1
    <52c>   DW_AT_sibling     : <0x536>
 <2><530>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <531>   DW_AT_type        : <0x524>
 <2><535>: Abbrev Number: 0
 <1><536>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <537>   DW_AT_byte_size   : 4
    <537>   DW_AT_type        : <0x542>
 <1><53b>: Abbrev Number: 6 (DW_TAG_base_type)
    <53c>   DW_AT_byte_size   : 1
    <53d>   DW_AT_encoding    : 8	(unsigned char)
    <53e>   DW_AT_name        : (indirect string, offset: 0x7e703): char
 <1><542>: Abbrev Number: 11 (DW_TAG_const_type)
    <543>   DW_AT_type        : <0x53b>
 <1><547>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <548>   DW_AT_encoding    : 5	(signed)
    <549>   DW_AT_byte_size   : 4
    <54a>   DW_AT_type        : <0x86>
    <54e>   DW_AT_decl_file   : 10
    <54f>   DW_AT_decl_line   : 82
    <550>   DW_AT_decl_column : 14
    <551>   DW_AT_sibling     : <0x693>
 <2><555>: Abbrev Number: 1 (DW_TAG_enumerator)
    <556>   DW_AT_name        : (indirect string, offset: 0x2fa76): osPriorityNone
    <55a>   DW_AT_const_value : 0
 <2><55b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <55c>   DW_AT_name        : (indirect string, offset: 0x455d3): osPriorityIdle
    <560>   DW_AT_const_value : 1
 <2><561>: Abbrev Number: 1 (DW_TAG_enumerator)
    <562>   DW_AT_name        : (indirect string, offset: 0x418c0): osPriorityLow
    <566>   DW_AT_const_value : 8
 <2><567>: Abbrev Number: 1 (DW_TAG_enumerator)
    <568>   DW_AT_name        : (indirect string, offset: 0x56e06): osPriorityLow1
    <56c>   DW_AT_const_value : 9
 <2><56d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <56e>   DW_AT_name        : (indirect string, offset: 0x56e15): osPriorityLow2
    <572>   DW_AT_const_value : 10
 <2><573>: Abbrev Number: 1 (DW_TAG_enumerator)
    <574>   DW_AT_name        : (indirect string, offset: 0x56e24): osPriorityLow3
    <578>   DW_AT_const_value : 11
 <2><579>: Abbrev Number: 1 (DW_TAG_enumerator)
    <57a>   DW_AT_name        : (indirect string, offset: 0x22de5): osPriorityLow4
    <57e>   DW_AT_const_value : 12
 <2><57f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <580>   DW_AT_name        : (indirect string, offset: 0x56e7b): osPriorityLow5
    <584>   DW_AT_const_value : 13
 <2><585>: Abbrev Number: 1 (DW_TAG_enumerator)
    <586>   DW_AT_name        : (indirect string, offset: 0x22ea0): osPriorityLow6
    <58a>   DW_AT_const_value : 14
 <2><58b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <58c>   DW_AT_name        : (indirect string, offset: 0x56eb1): osPriorityLow7
    <590>   DW_AT_const_value : 15
 <2><591>: Abbrev Number: 1 (DW_TAG_enumerator)
    <592>   DW_AT_name        : (indirect string, offset: 0x4afbe): osPriorityBelowNormal
    <596>   DW_AT_const_value : 16
 <2><597>: Abbrev Number: 1 (DW_TAG_enumerator)
    <598>   DW_AT_name        : (indirect string, offset: 0x68cfe): osPriorityBelowNormal1
    <59c>   DW_AT_const_value : 17
 <2><59d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <59e>   DW_AT_name        : (indirect string, offset: 0x68d15): osPriorityBelowNormal2
    <5a2>   DW_AT_const_value : 18
 <2><5a3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5a4>   DW_AT_name        : (indirect string, offset: 0x68d2c): osPriorityBelowNormal3
    <5a8>   DW_AT_const_value : 19
 <2><5a9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5aa>   DW_AT_name        : (indirect string, offset: 0x68d43): osPriorityBelowNormal4
    <5ae>   DW_AT_const_value : 20
 <2><5af>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5b0>   DW_AT_name        : (indirect string, offset: 0x68d5a): osPriorityBelowNormal5
    <5b4>   DW_AT_const_value : 21
 <2><5b5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5b6>   DW_AT_name        : (indirect string, offset: 0x68d71): osPriorityBelowNormal6
    <5ba>   DW_AT_const_value : 22
 <2><5bb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5bc>   DW_AT_name        : (indirect string, offset: 0x68d88): osPriorityBelowNormal7
    <5c0>   DW_AT_const_value : 23
 <2><5c1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5c2>   DW_AT_name        : (indirect string, offset: 0x30aba): osPriorityNormal
    <5c6>   DW_AT_const_value : 24
 <2><5c7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5c8>   DW_AT_name        : (indirect string, offset: 0x55e10): osPriorityNormal1
    <5cc>   DW_AT_const_value : 25
 <2><5cd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5ce>   DW_AT_name        : (indirect string, offset: 0x55e22): osPriorityNormal2
    <5d2>   DW_AT_const_value : 26
 <2><5d3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5d4>   DW_AT_name        : (indirect string, offset: 0x55e34): osPriorityNormal3
    <5d8>   DW_AT_const_value : 27
 <2><5d9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5da>   DW_AT_name        : (indirect string, offset: 0x55e46): osPriorityNormal4
    <5de>   DW_AT_const_value : 28
 <2><5df>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5e0>   DW_AT_name        : (indirect string, offset: 0x9b00): osPriorityNormal5
    <5e4>   DW_AT_const_value : 29
 <2><5e5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5e6>   DW_AT_name        : (indirect string, offset: 0x55e7e): osPriorityNormal6
    <5ea>   DW_AT_const_value : 30
 <2><5eb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5ec>   DW_AT_name        : (indirect string, offset: 0x55e90): osPriorityNormal7
    <5f0>   DW_AT_const_value : 31
 <2><5f1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5f2>   DW_AT_name        : (indirect string, offset: 0x4661f): osPriorityAboveNormal
    <5f6>   DW_AT_const_value : 32
 <2><5f7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5f8>   DW_AT_name        : (indirect string, offset: 0x57f19): osPriorityAboveNormal1
    <5fc>   DW_AT_const_value : 33
 <2><5fd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5fe>   DW_AT_name        : (indirect string, offset: 0x14364): osPriorityAboveNormal2
    <602>   DW_AT_const_value : 34
 <2><603>: Abbrev Number: 1 (DW_TAG_enumerator)
    <604>   DW_AT_name        : (indirect string, offset: 0x57f4c): osPriorityAboveNormal3
    <608>   DW_AT_const_value : 35
 <2><609>: Abbrev Number: 1 (DW_TAG_enumerator)
    <60a>   DW_AT_name        : (indirect string, offset: 0x143ae): osPriorityAboveNormal4
    <60e>   DW_AT_const_value : 36
 <2><60f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <610>   DW_AT_name        : (indirect string, offset: 0x57f8d): osPriorityAboveNormal5
    <614>   DW_AT_const_value : 37
 <2><615>: Abbrev Number: 1 (DW_TAG_enumerator)
    <616>   DW_AT_name        : (indirect string, offset: 0x57fa4): osPriorityAboveNormal6
    <61a>   DW_AT_const_value : 38
 <2><61b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <61c>   DW_AT_name        : (indirect string, offset: 0x57fbb): osPriorityAboveNormal7
    <620>   DW_AT_const_value : 39
 <2><621>: Abbrev Number: 1 (DW_TAG_enumerator)
    <622>   DW_AT_name        : (indirect string, offset: 0x7d5ec): osPriorityHigh
    <626>   DW_AT_const_value : 40
 <2><627>: Abbrev Number: 1 (DW_TAG_enumerator)
    <628>   DW_AT_name        : (indirect string, offset: 0x26ace): osPriorityHigh1
    <62c>   DW_AT_const_value : 41
 <2><62d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <62e>   DW_AT_name        : (indirect string, offset: 0x30217): osPriorityHigh2
    <632>   DW_AT_const_value : 42
 <2><633>: Abbrev Number: 1 (DW_TAG_enumerator)
    <634>   DW_AT_name        : (indirect string, offset: 0x26af7): osPriorityHigh3
    <638>   DW_AT_const_value : 43
 <2><639>: Abbrev Number: 1 (DW_TAG_enumerator)
    <63a>   DW_AT_name        : (indirect string, offset: 0x3027c): osPriorityHigh4
    <63e>   DW_AT_const_value : 44
 <2><63f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <640>   DW_AT_name        : (indirect string, offset: 0x302c3): osPriorityHigh5
    <644>   DW_AT_const_value : 45
 <2><645>: Abbrev Number: 1 (DW_TAG_enumerator)
    <646>   DW_AT_name        : (indirect string, offset: 0x42792): osPriorityHigh6
    <64a>   DW_AT_const_value : 46
 <2><64b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <64c>   DW_AT_name        : (indirect string, offset: 0x26b8a): osPriorityHigh7
    <650>   DW_AT_const_value : 47
 <2><651>: Abbrev Number: 1 (DW_TAG_enumerator)
    <652>   DW_AT_name        : (indirect string, offset: 0x285bd): osPriorityRealtime
    <656>   DW_AT_const_value : 48
 <2><657>: Abbrev Number: 1 (DW_TAG_enumerator)
    <658>   DW_AT_name        : (indirect string, offset: 0x1b0e8): osPriorityRealtime1
    <65c>   DW_AT_const_value : 49
 <2><65d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <65e>   DW_AT_name        : (indirect string, offset: 0x1b0fc): osPriorityRealtime2
    <662>   DW_AT_const_value : 50
 <2><663>: Abbrev Number: 1 (DW_TAG_enumerator)
    <664>   DW_AT_name        : (indirect string, offset: 0x364e1): osPriorityRealtime3
    <668>   DW_AT_const_value : 51
 <2><669>: Abbrev Number: 1 (DW_TAG_enumerator)
    <66a>   DW_AT_name        : (indirect string, offset: 0x1b145): osPriorityRealtime4
    <66e>   DW_AT_const_value : 52
 <2><66f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <670>   DW_AT_name        : (indirect string, offset: 0x1b159): osPriorityRealtime5
    <674>   DW_AT_const_value : 53
 <2><675>: Abbrev Number: 1 (DW_TAG_enumerator)
    <676>   DW_AT_name        : (indirect string, offset: 0x5147f): osPriorityRealtime6
    <67a>   DW_AT_const_value : 54
 <2><67b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <67c>   DW_AT_name        : (indirect string, offset: 0x1b18e): osPriorityRealtime7
    <680>   DW_AT_const_value : 55
 <2><681>: Abbrev Number: 1 (DW_TAG_enumerator)
    <682>   DW_AT_name        : (indirect string, offset: 0x496b6): osPriorityISR
    <686>   DW_AT_const_value : 56
 <2><687>: Abbrev Number: 9 (DW_TAG_enumerator)
    <688>   DW_AT_name        : (indirect string, offset: 0x4e28e): osPriorityError
    <68c>   DW_AT_const_value : -1
 <2><68d>: Abbrev Number: 23 (DW_TAG_enumerator)
    <68e>   DW_AT_name        : (indirect string, offset: 0x3300a): osPriorityReserved
    <692>   DW_AT_const_value : 2147483647
 <2><692>: Abbrev Number: 0
 <1><693>: Abbrev Number: 4 (DW_TAG_typedef)
    <694>   DW_AT_name        : (indirect string, offset: 0x424c1): osPriority_t
    <698>   DW_AT_decl_file   : 10
    <699>   DW_AT_decl_line   : 136
    <69a>   DW_AT_decl_column : 3
    <69b>   DW_AT_type        : <0x547>
 <1><69f>: Abbrev Number: 4 (DW_TAG_typedef)
    <6a0>   DW_AT_name        : (indirect string, offset: 0x57b84): osThreadFunc_t
    <6a4>   DW_AT_decl_file   : 10
    <6a5>   DW_AT_decl_line   : 139
    <6a6>   DW_AT_decl_column : 16
    <6a7>   DW_AT_type        : <0x526>
 <1><6ab>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <6ac>   DW_AT_encoding    : 5	(signed)
    <6ad>   DW_AT_byte_size   : 4
    <6ae>   DW_AT_type        : <0x86>
    <6b2>   DW_AT_decl_file   : 10
    <6b3>   DW_AT_decl_line   : 176
    <6b4>   DW_AT_decl_column : 14
    <6b5>   DW_AT_sibling     : <0x6e9>
 <2><6b9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <6ba>   DW_AT_name        : (indirect string, offset: 0x591de): osOK
    <6be>   DW_AT_const_value : 0
 <2><6bf>: Abbrev Number: 9 (DW_TAG_enumerator)
    <6c0>   DW_AT_name        : (indirect string, offset: 0x7e3bf): osError
    <6c4>   DW_AT_const_value : -1
 <2><6c5>: Abbrev Number: 9 (DW_TAG_enumerator)
    <6c6>   DW_AT_name        : (indirect string, offset: 0xe2a5): osErrorTimeout
    <6ca>   DW_AT_const_value : -2
 <2><6cb>: Abbrev Number: 9 (DW_TAG_enumerator)
    <6cc>   DW_AT_name        : (indirect string, offset: 0x46c50): osErrorResource
    <6d0>   DW_AT_const_value : -3
 <2><6d1>: Abbrev Number: 9 (DW_TAG_enumerator)
    <6d2>   DW_AT_name        : (indirect string, offset: 0x644c6): osErrorParameter
    <6d6>   DW_AT_const_value : -4
 <2><6d7>: Abbrev Number: 9 (DW_TAG_enumerator)
    <6d8>   DW_AT_name        : (indirect string, offset: 0x46ff9): osErrorNoMemory
    <6dc>   DW_AT_const_value : -5
 <2><6dd>: Abbrev Number: 9 (DW_TAG_enumerator)
    <6de>   DW_AT_name        : (indirect string, offset: 0x27c65): osErrorISR
    <6e2>   DW_AT_const_value : -6
 <2><6e3>: Abbrev Number: 23 (DW_TAG_enumerator)
    <6e4>   DW_AT_name        : (indirect string, offset: 0xdf01): osStatusReserved
    <6e8>   DW_AT_const_value : 2147483647
 <2><6e8>: Abbrev Number: 0
 <1><6e9>: Abbrev Number: 4 (DW_TAG_typedef)
    <6ea>   DW_AT_name        : (indirect string, offset: 0xd88a): osStatus_t
    <6ee>   DW_AT_decl_file   : 10
    <6ef>   DW_AT_decl_line   : 185
    <6f0>   DW_AT_decl_column : 3
    <6f1>   DW_AT_type        : <0x6ab>
 <1><6f5>: Abbrev Number: 4 (DW_TAG_typedef)
    <6f6>   DW_AT_name        : (indirect string, offset: 0x3b347): osThreadId_t
    <6fa>   DW_AT_decl_file   : 10
    <6fb>   DW_AT_decl_line   : 189
    <6fc>   DW_AT_decl_column : 15
    <6fd>   DW_AT_type        : <0x524>
 <1><701>: Abbrev Number: 4 (DW_TAG_typedef)
    <702>   DW_AT_name        : (indirect string, offset: 0x5349c): TZ_ModuleId_t
    <706>   DW_AT_decl_file   : 10
    <707>   DW_AT_decl_line   : 213
    <708>   DW_AT_decl_column : 18
    <709>   DW_AT_type        : <0xb6>
 <1><70d>: Abbrev Number: 12 (DW_TAG_structure_type)
    <70e>   DW_AT_byte_size   : 36
    <70f>   DW_AT_decl_file   : 10
    <710>   DW_AT_decl_line   : 218
    <711>   DW_AT_decl_column : 9
    <711>   DW_AT_sibling     : <0x78b>
 <2><715>: Abbrev Number: 3 (DW_TAG_member)
    <716>   DW_AT_name        : (indirect string, offset: 0x5caf3): name
    <71a>   DW_AT_decl_file   : 10
    <71b>   DW_AT_decl_line   : 219
    <71c>   DW_AT_decl_column : 33
    <71d>   DW_AT_type        : <0x536>
    <721>   DW_AT_data_member_location: 0
 <2><722>: Abbrev Number: 3 (DW_TAG_member)
    <723>   DW_AT_name        : (indirect string, offset: 0x756d2): attr_bits
    <727>   DW_AT_decl_file   : 10
    <728>   DW_AT_decl_line   : 220
    <729>   DW_AT_decl_column : 28
    <72a>   DW_AT_type        : <0xb6>
    <72e>   DW_AT_data_member_location: 4
 <2><72f>: Abbrev Number: 3 (DW_TAG_member)
    <730>   DW_AT_name        : (indirect string, offset: 0x3f39f): cb_mem
    <734>   DW_AT_decl_file   : 10
    <735>   DW_AT_decl_line   : 221
    <736>   DW_AT_decl_column : 30
    <737>   DW_AT_type        : <0x524>
    <73b>   DW_AT_data_member_location: 8
 <2><73c>: Abbrev Number: 3 (DW_TAG_member)
    <73d>   DW_AT_name        : (indirect string, offset: 0x4f3b9): cb_size
    <741>   DW_AT_decl_file   : 10
    <742>   DW_AT_decl_line   : 222
    <743>   DW_AT_decl_column : 30
    <744>   DW_AT_type        : <0xb6>
    <748>   DW_AT_data_member_location: 12
 <2><749>: Abbrev Number: 3 (DW_TAG_member)
    <74a>   DW_AT_name        : (indirect string, offset: 0x692a0): stack_mem
    <74e>   DW_AT_decl_file   : 10
    <74f>   DW_AT_decl_line   : 223
    <750>   DW_AT_decl_column : 27
    <751>   DW_AT_type        : <0x524>
    <755>   DW_AT_data_member_location: 16
 <2><756>: Abbrev Number: 3 (DW_TAG_member)
    <757>   DW_AT_name        : (indirect string, offset: 0x33df7): stack_size
    <75b>   DW_AT_decl_file   : 10
    <75c>   DW_AT_decl_line   : 224
    <75d>   DW_AT_decl_column : 27
    <75e>   DW_AT_type        : <0xb6>
    <762>   DW_AT_data_member_location: 20
 <2><763>: Abbrev Number: 3 (DW_TAG_member)
    <764>   DW_AT_name        : (indirect string, offset: 0x25a64): priority
    <768>   DW_AT_decl_file   : 10
    <769>   DW_AT_decl_line   : 225
    <76a>   DW_AT_decl_column : 29
    <76b>   DW_AT_type        : <0x693>
    <76f>   DW_AT_data_member_location: 24
 <2><770>: Abbrev Number: 3 (DW_TAG_member)
    <771>   DW_AT_name        : (indirect string, offset: 0x3246a): tz_module
    <775>   DW_AT_decl_file   : 10
    <776>   DW_AT_decl_line   : 226
    <777>   DW_AT_decl_column : 28
    <778>   DW_AT_type        : <0x701>
    <77c>   DW_AT_data_member_location: 28
 <2><77d>: Abbrev Number: 3 (DW_TAG_member)
    <77e>   DW_AT_name        : (indirect string, offset: 0x3f57f): reserved
    <782>   DW_AT_decl_file   : 10
    <783>   DW_AT_decl_line   : 227
    <784>   DW_AT_decl_column : 29
    <785>   DW_AT_type        : <0xb6>
    <789>   DW_AT_data_member_location: 32
 <2><78a>: Abbrev Number: 0
 <1><78b>: Abbrev Number: 4 (DW_TAG_typedef)
    <78c>   DW_AT_name        : (indirect string, offset: 0x2858a): osThreadAttr_t
    <790>   DW_AT_decl_file   : 10
    <791>   DW_AT_decl_line   : 228
    <792>   DW_AT_decl_column : 3
    <793>   DW_AT_type        : <0x70d>
 <1><797>: Abbrev Number: 11 (DW_TAG_const_type)
    <798>   DW_AT_type        : <0x78b>
 <1><79c>: Abbrev Number: 16 (DW_TAG_variable)
    <79d>   DW_AT_name        : (indirect string, offset: 0x217a4): defaultTaskHandle
    <7a1>   DW_AT_decl_file   : 1
    <7a1>   DW_AT_decl_line   : 45
    <7a2>   DW_AT_decl_column : 14
    <7a3>   DW_AT_type        : <0x6f5>
    <7a7>   DW_AT_external    : 1
    <7a7>   DW_AT_location    : 5 byte block: 3 2c 0 0 20 	(DW_OP_addr: 2000002c)
 <1><7ad>: Abbrev Number: 16 (DW_TAG_variable)
    <7ae>   DW_AT_name        : (indirect string, offset: 0x27fc1): defaultTask_attributes
    <7b2>   DW_AT_decl_file   : 1
    <7b2>   DW_AT_decl_line   : 46
    <7b3>   DW_AT_decl_column : 22
    <7b4>   DW_AT_type        : <0x797>
    <7b8>   DW_AT_external    : 1
    <7b8>   DW_AT_location    : 5 byte block: 3 b0 43 0 8 	(DW_OP_addr: 80043b0)
 <1><7be>: Abbrev Number: 16 (DW_TAG_variable)
    <7bf>   DW_AT_name        : (indirect string, offset: 0x2a9e7): myTask02Handle
    <7c3>   DW_AT_decl_file   : 1
    <7c3>   DW_AT_decl_line   : 52
    <7c4>   DW_AT_decl_column : 14
    <7c5>   DW_AT_type        : <0x6f5>
    <7c9>   DW_AT_external    : 1
    <7c9>   DW_AT_location    : 5 byte block: 3 30 0 0 20 	(DW_OP_addr: 20000030)
 <1><7cf>: Abbrev Number: 16 (DW_TAG_variable)
    <7d0>   DW_AT_name        : (indirect string, offset: 0x7c845): myTask02_attributes
    <7d4>   DW_AT_decl_file   : 1
    <7d4>   DW_AT_decl_line   : 53
    <7d5>   DW_AT_decl_column : 22
    <7d6>   DW_AT_type        : <0x797>
    <7da>   DW_AT_external    : 1
    <7da>   DW_AT_location    : 5 byte block: 3 d4 43 0 8 	(DW_OP_addr: 80043d4)
 <1><7e0>: Abbrev Number: 33 (DW_TAG_variable)
    <7e1>   DW_AT_name        : y
    <7e3>   DW_AT_decl_file   : 1
    <7e4>   DW_AT_decl_line   : 257
    <7e6>   DW_AT_decl_column : 14
    <7e7>   DW_AT_type        : <0x8d>
    <7eb>   DW_AT_external    : 1
    <7eb>   DW_AT_location    : 5 byte block: 3 34 0 0 20 	(DW_OP_addr: 20000034)
 <1><7f1>: Abbrev Number: 34 (DW_TAG_subprogram)
    <7f2>   DW_AT_external    : 1
    <7f2>   DW_AT_name        : (indirect string, offset: 0x6687): HAL_GPIO_ReadPin
    <7f6>   DW_AT_decl_file   : 9
    <7f7>   DW_AT_decl_line   : 234
    <7f8>   DW_AT_decl_column : 15
    <7f9>   DW_AT_prototyped  : 1
    <7f9>   DW_AT_type        : <0x518>
    <7fd>   DW_AT_declaration : 1
    <7fd>   DW_AT_sibling     : <0x80c>
 <2><801>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <802>   DW_AT_type        : <0x80c>
 <2><806>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <807>   DW_AT_type        : <0xaa>
 <2><80b>: Abbrev Number: 0
 <1><80c>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <80d>   DW_AT_byte_size   : 4
    <80d>   DW_AT_type        : <0x171>
 <1><811>: Abbrev Number: 17 (DW_TAG_subprogram)
    <812>   DW_AT_external    : 1
    <812>   DW_AT_name        : (indirect string, offset: 0x74078): osDelay
    <816>   DW_AT_decl_file   : 10
    <817>   DW_AT_decl_line   : 459
    <819>   DW_AT_decl_column : 12
    <81a>   DW_AT_prototyped  : 1
    <81a>   DW_AT_type        : <0x6e9>
    <81e>   DW_AT_declaration : 1
    <81e>   DW_AT_sibling     : <0x828>
 <2><822>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <823>   DW_AT_type        : <0xb6>
 <2><827>: Abbrev Number: 0
 <1><828>: Abbrev Number: 24 (DW_TAG_subprogram)
    <829>   DW_AT_external    : 1
    <829>   DW_AT_name        : (indirect string, offset: 0x8f90): HAL_GPIO_Init
    <82d>   DW_AT_decl_file   : 9
    <82d>   DW_AT_decl_line   : 224
    <82e>   DW_AT_decl_column : 7
    <82f>   DW_AT_prototyped  : 1
    <82f>   DW_AT_declaration : 1
    <82f>   DW_AT_sibling     : <0x83e>
 <2><833>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <834>   DW_AT_type        : <0x80c>
 <2><838>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <839>   DW_AT_type        : <0x83e>
 <2><83d>: Abbrev Number: 0
 <1><83e>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <83f>   DW_AT_byte_size   : 4
    <83f>   DW_AT_type        : <0x4f1>
 <1><843>: Abbrev Number: 24 (DW_TAG_subprogram)
    <844>   DW_AT_external    : 1
    <844>   DW_AT_name        : (indirect string, offset: 0x70e4): HAL_GPIO_WritePin
    <848>   DW_AT_decl_file   : 9
    <848>   DW_AT_decl_line   : 235
    <849>   DW_AT_decl_column : 6
    <84a>   DW_AT_prototyped  : 1
    <84a>   DW_AT_declaration : 1
    <84a>   DW_AT_sibling     : <0x85e>
 <2><84e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <84f>   DW_AT_type        : <0x80c>
 <2><853>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <854>   DW_AT_type        : <0xaa>
 <2><858>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <859>   DW_AT_type        : <0x518>
 <2><85d>: Abbrev Number: 0
 <1><85e>: Abbrev Number: 17 (DW_TAG_subprogram)
    <85f>   DW_AT_external    : 1
    <85f>   DW_AT_name        : (indirect string, offset: 0x34784): HAL_RCC_ClockConfig
    <863>   DW_AT_decl_file   : 8
    <864>   DW_AT_decl_line   : 1246
    <866>   DW_AT_decl_column : 19
    <867>   DW_AT_prototyped  : 1
    <867>   DW_AT_type        : <0x368>
    <86b>   DW_AT_declaration : 1
    <86b>   DW_AT_sibling     : <0x87a>
 <2><86f>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <870>   DW_AT_type        : <0x87a>
 <2><874>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <875>   DW_AT_type        : <0xb6>
 <2><879>: Abbrev Number: 0
 <1><87a>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <87b>   DW_AT_byte_size   : 4
    <87b>   DW_AT_type        : <0x4a2>
 <1><87f>: Abbrev Number: 17 (DW_TAG_subprogram)
    <880>   DW_AT_external    : 1
    <880>   DW_AT_name        : (indirect string, offset: 0x22cb1): HAL_RCC_OscConfig
    <884>   DW_AT_decl_file   : 8
    <885>   DW_AT_decl_line   : 1245
    <887>   DW_AT_decl_column : 19
    <888>   DW_AT_prototyped  : 1
    <888>   DW_AT_type        : <0x368>
    <88c>   DW_AT_declaration : 1
    <88c>   DW_AT_sibling     : <0x896>
 <2><890>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <891>   DW_AT_type        : <0x896>
 <2><895>: Abbrev Number: 0
 <1><896>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <897>   DW_AT_byte_size   : 4
    <897>   DW_AT_type        : <0x447>
 <1><89b>: Abbrev Number: 25 (DW_TAG_subprogram)
    <89c>   DW_AT_external    : 1
    <89c>   DW_AT_name        : (indirect string, offset: 0x524af): osKernelStart
    <8a0>   DW_AT_decl_file   : 10
    <8a0>   DW_AT_decl_line   : 302
    <8a2>   DW_AT_decl_column : 12
    <8a2>   DW_AT_prototyped  : 1
    <8a2>   DW_AT_type        : <0x6e9>
    <8a6>   DW_AT_declaration : 1
 <1><8a6>: Abbrev Number: 17 (DW_TAG_subprogram)
    <8a7>   DW_AT_external    : 1
    <8a7>   DW_AT_name        : (indirect string, offset: 0x5788): osThreadNew
    <8ab>   DW_AT_decl_file   : 10
    <8ac>   DW_AT_decl_line   : 349
    <8ae>   DW_AT_decl_column : 14
    <8af>   DW_AT_prototyped  : 1
    <8af>   DW_AT_type        : <0x6f5>
    <8b3>   DW_AT_declaration : 1
    <8b3>   DW_AT_sibling     : <0x8c7>
 <2><8b7>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <8b8>   DW_AT_type        : <0x69f>
 <2><8bc>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <8bd>   DW_AT_type        : <0x524>
 <2><8c1>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <8c2>   DW_AT_type        : <0x8c7>
 <2><8c6>: Abbrev Number: 0
 <1><8c7>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <8c8>   DW_AT_byte_size   : 4
    <8c8>   DW_AT_type        : <0x797>
 <1><8cc>: Abbrev Number: 25 (DW_TAG_subprogram)
    <8cd>   DW_AT_external    : 1
    <8cd>   DW_AT_name        : (indirect string, offset: 0x4ee38): osKernelInitialize
    <8d1>   DW_AT_decl_file   : 10
    <8d1>   DW_AT_decl_line   : 287
    <8d3>   DW_AT_decl_column : 12
    <8d3>   DW_AT_prototyped  : 1
    <8d3>   DW_AT_type        : <0x6e9>
    <8d7>   DW_AT_declaration : 1
 <1><8d7>: Abbrev Number: 35 (DW_TAG_subprogram)
    <8d8>   DW_AT_external    : 1
    <8d8>   DW_AT_name        : (indirect string, offset: 0x411c1): HAL_Init
    <8dc>   DW_AT_decl_file   : 11
    <8dd>   DW_AT_decl_line   : 219
    <8de>   DW_AT_decl_column : 19
    <8df>   DW_AT_prototyped  : 1
    <8df>   DW_AT_type        : <0x368>
    <8e3>   DW_AT_declaration : 1
 <1><8e3>: Abbrev Number: 36 (DW_TAG_subprogram)
    <8e4>   DW_AT_external    : 1
    <8e4>   DW_AT_name        : (indirect string, offset: 0x648cd): Error_Handler
    <8e8>   DW_AT_decl_file   : 1
    <8e9>   DW_AT_decl_line   : 321
    <8eb>   DW_AT_decl_column : 6
    <8ec>   DW_AT_prototyped  : 1
    <8ec>   DW_AT_low_pc      : 0x80007e8
    <8f0>   DW_AT_high_pc     : 0xc
    <8f4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8f6>   DW_AT_call_all_calls: 1
    <8f6>   DW_AT_sibling     : <0x90c>
 <2><8fa>: Abbrev Number: 37 (DW_TAG_inlined_subroutine)
    <8fb>   DW_AT_abstract_origin: <0xa59>
    <8ff>   DW_AT_low_pc      : 0x80007ec
    <903>   DW_AT_high_pc     : 0x4
    <907>   DW_AT_call_file   : 1
    <908>   DW_AT_call_line   : 325
    <90a>   DW_AT_call_column : 3
 <2><90b>: Abbrev Number: 0
 <1><90c>: Abbrev Number: 26 (DW_TAG_subprogram)
    <90d>   DW_AT_external    : 1
    <90d>   DW_AT_name        : (indirect string, offset: 0x40acf): StartTask02
    <911>   DW_AT_decl_file   : 1
    <911>   DW_AT_decl_line   : 303
    <913>   DW_AT_decl_column : 6
    <913>   DW_AT_prototyped  : 1
    <913>   DW_AT_low_pc      : 0x80007b8
    <917>   DW_AT_high_pc     : 0x30
    <91b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <91d>   DW_AT_call_all_tail_calls: 1
    <91d>   DW_AT_sibling     : <0x931>
 <2><921>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <922>   DW_AT_name        : (indirect string, offset: 0x58469): argument
    <926>   DW_AT_decl_file   : 1
    <926>   DW_AT_decl_line   : 303
    <928>   DW_AT_decl_column : 24
    <929>   DW_AT_type        : <0x524>
    <92d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><930>: Abbrev Number: 0
 <1><931>: Abbrev Number: 26 (DW_TAG_subprogram)
    <932>   DW_AT_external    : 1
    <932>   DW_AT_name        : (indirect string, offset: 0xf82): StartDefaultTask
    <936>   DW_AT_decl_file   : 1
    <936>   DW_AT_decl_line   : 259
    <938>   DW_AT_decl_column : 6
    <938>   DW_AT_prototyped  : 1
    <938>   DW_AT_low_pc      : 0x80006b8
    <93c>   DW_AT_high_pc     : 0x100
    <940>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <942>   DW_AT_call_all_tail_calls: 1
    <942>   DW_AT_sibling     : <0x98c>
 <2><946>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <947>   DW_AT_name        : (indirect string, offset: 0x58469): argument
    <94b>   DW_AT_decl_file   : 1
    <94b>   DW_AT_decl_line   : 259
    <94d>   DW_AT_decl_column : 29
    <94e>   DW_AT_type        : <0x524>
    <952>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><955>: Abbrev Number: 28 (DW_TAG_variable)
    <956>   DW_AT_name        : (indirect string, offset: 0x20593): digitPatterns
    <95a>   DW_AT_decl_file   : 1
    <95a>   DW_AT_decl_line   : 264
    <95c>   DW_AT_decl_column : 16
    <95d>   DW_AT_type        : <0x98c>
    <961>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><964>: Abbrev Number: 21 (DW_TAG_lexical_block)
    <965>   DW_AT_low_pc      : 0x80006d2
    <969>   DW_AT_high_pc     : 0xc6
 <3><96d>: Abbrev Number: 38 (DW_TAG_variable)
    <96e>   DW_AT_name        : x
    <970>   DW_AT_decl_file   : 1
    <971>   DW_AT_decl_line   : 278
    <973>   DW_AT_decl_column : 14
    <974>   DW_AT_type        : <0x86>
    <978>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><97b>: Abbrev Number: 28 (DW_TAG_variable)
    <97c>   DW_AT_name        : (indirect string, offset: 0x6e0e8): pattern
    <980>   DW_AT_decl_file   : 1
    <980>   DW_AT_decl_line   : 279
    <982>   DW_AT_decl_column : 18
    <983>   DW_AT_type        : <0x99>
    <987>   DW_AT_location    : 2 byte block: 91 73 	(DW_OP_fbreg: -13)
 <3><98a>: Abbrev Number: 0
 <2><98b>: Abbrev Number: 0
 <1><98c>: Abbrev Number: 13 (DW_TAG_array_type)
    <98d>   DW_AT_type        : <0xa5>
    <991>   DW_AT_sibling     : <0x99c>
 <2><995>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <996>   DW_AT_type        : <0x92>
    <99a>   DW_AT_upper_bound : 9
 <2><99b>: Abbrev Number: 0
 <1><99c>: Abbrev Number: 39 (DW_TAG_subprogram)
    <99d>   DW_AT_name        : (indirect string, offset: 0x73ea7): MX_GPIO_Init
    <9a1>   DW_AT_decl_file   : 1
    <9a2>   DW_AT_decl_line   : 206
    <9a3>   DW_AT_decl_column : 13
    <9a4>   DW_AT_prototyped  : 1
    <9a4>   DW_AT_low_pc      : 0x8000620
    <9a8>   DW_AT_high_pc     : 0x98
    <9ac>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9ae>   DW_AT_call_all_tail_calls: 1
    <9ae>   DW_AT_sibling     : <0x9d9>
 <2><9b2>: Abbrev Number: 10 (DW_TAG_variable)
    <9b3>   DW_AT_name        : (indirect string, offset: 0x26587): GPIO_InitStruct
    <9b7>   DW_AT_decl_file   : 1
    <9b7>   DW_AT_decl_line   : 208
    <9b8>   DW_AT_decl_column : 20
    <9b9>   DW_AT_type        : <0x4f1>
    <9bd>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><9c0>: Abbrev Number: 21 (DW_TAG_lexical_block)
    <9c1>   DW_AT_low_pc      : 0x8000634
    <9c5>   DW_AT_high_pc     : 0x1c
 <3><9c9>: Abbrev Number: 10 (DW_TAG_variable)
    <9ca>   DW_AT_name        : (indirect string, offset: 0x6a17b): tmpreg
    <9ce>   DW_AT_decl_file   : 1
    <9ce>   DW_AT_decl_line   : 214
    <9cf>   DW_AT_decl_column : 3
    <9d0>   DW_AT_type        : <0xc2>
    <9d4>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><9d7>: Abbrev Number: 0
 <2><9d8>: Abbrev Number: 0
 <1><9d9>: Abbrev Number: 40 (DW_TAG_subprogram)
    <9da>   DW_AT_external    : 1
    <9da>   DW_AT_name        : (indirect string, offset: 0x783dd): SystemClock_Config
    <9de>   DW_AT_decl_file   : 1
    <9df>   DW_AT_decl_line   : 164
    <9e0>   DW_AT_decl_column : 6
    <9e1>   DW_AT_prototyped  : 1
    <9e1>   DW_AT_low_pc      : 0x8000560
    <9e5>   DW_AT_high_pc     : 0xc0
    <9e9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9eb>   DW_AT_call_all_tail_calls: 1
    <9eb>   DW_AT_sibling     : <0xa43>
 <2><9ef>: Abbrev Number: 10 (DW_TAG_variable)
    <9f0>   DW_AT_name        : (indirect string, offset: 0x3d9e2): RCC_OscInitStruct
    <9f4>   DW_AT_decl_file   : 1
    <9f4>   DW_AT_decl_line   : 166
    <9f5>   DW_AT_decl_column : 22
    <9f6>   DW_AT_type        : <0x43b>
    <9fa>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><9fd>: Abbrev Number: 10 (DW_TAG_variable)
    <9fe>   DW_AT_name        : (indirect string, offset: 0x4b1b0): RCC_ClkInitStruct
    <a02>   DW_AT_decl_file   : 1
    <a02>   DW_AT_decl_line   : 167
    <a03>   DW_AT_decl_column : 22
    <a04>   DW_AT_type        : <0x496>
    <a08>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><a0c>: Abbrev Number: 41 (DW_TAG_lexical_block)
    <a0d>   DW_AT_low_pc      : 0x8000584
    <a11>   DW_AT_high_pc     : 0x1c
    <a15>   DW_AT_sibling     : <0xa29>
 <3><a19>: Abbrev Number: 10 (DW_TAG_variable)
    <a1a>   DW_AT_name        : (indirect string, offset: 0x6a17b): tmpreg
    <a1e>   DW_AT_decl_file   : 1
    <a1e>   DW_AT_decl_line   : 171
    <a1f>   DW_AT_decl_column : 3
    <a20>   DW_AT_type        : <0xc2>
    <a24>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <3><a28>: Abbrev Number: 0
 <2><a29>: Abbrev Number: 21 (DW_TAG_lexical_block)
    <a2a>   DW_AT_low_pc      : 0x80005a0
    <a2e>   DW_AT_high_pc     : 0x20
 <3><a32>: Abbrev Number: 10 (DW_TAG_variable)
    <a33>   DW_AT_name        : (indirect string, offset: 0x6a17b): tmpreg
    <a37>   DW_AT_decl_file   : 1
    <a37>   DW_AT_decl_line   : 172
    <a38>   DW_AT_decl_column : 3
    <a39>   DW_AT_type        : <0xc2>
    <a3d>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <3><a41>: Abbrev Number: 0
 <2><a42>: Abbrev Number: 0
 <1><a43>: Abbrev Number: 42 (DW_TAG_subprogram)
    <a44>   DW_AT_external    : 1
    <a44>   DW_AT_name        : (indirect string, offset: 0x13b07): main
    <a48>   DW_AT_decl_file   : 1
    <a49>   DW_AT_decl_line   : 81
    <a4a>   DW_AT_decl_column : 5
    <a4b>   DW_AT_prototyped  : 1
    <a4b>   DW_AT_type        : <0x86>
    <a4f>   DW_AT_low_pc      : 0x800050c
    <a53>   DW_AT_high_pc     : 0x54
    <a57>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a59>   DW_AT_call_all_tail_calls: 1
 <1><a59>: Abbrev Number: 43 (DW_TAG_subprogram)
    <a5a>   DW_AT_name        : (indirect string, offset: 0x6b55c): __disable_irq
    <a5e>   DW_AT_decl_file   : 2
    <a5f>   DW_AT_decl_line   : 960
    <a61>   DW_AT_decl_column : 27
    <a62>   DW_AT_prototyped  : 1
    <a62>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><a63>: Abbrev Number: 0
  Compilation Unit @ offset 0xa64:
   Length:        0x445 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x2c4
   Pointer Size:  4
 <0><a70>: Abbrev Number: 11 (DW_TAG_compile_unit)
    <a71>   DW_AT_producer    : (indirect string, offset: 0x75822): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <a75>   DW_AT_language    : 29	(C11)
    <a76>   DW_AT_name        : (indirect string, offset: 0x827c0): ../Core/Src/stm32f4xx_hal_msp.c
    <a7a>   DW_AT_comp_dir    : (indirect string, offset: 0x34613): D:/Personal studies/ITI embedded/workspace/my_Code/Debug
    <a7e>   DW_AT_ranges      : 0x40
    <a82>   DW_AT_low_pc      : 0
    <a86>   DW_AT_stmt_list   : 0x99d
    <a8a>   DW_AT_macros      : 0x56a
 <1><a8e>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <a8f>   DW_AT_encoding    : 5	(signed)
    <a90>   DW_AT_byte_size   : 1
    <a91>   DW_AT_type        : <0xc1d>
    <a95>   DW_AT_decl_file   : 2
    <a96>   DW_AT_decl_line   : 66
    <a97>   DW_AT_decl_column : 1
    <a98>   DW_AT_sibling     : <0xc1d>
 <2><a9c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a9d>   DW_AT_name        : (indirect string, offset: 0x8283f): NonMaskableInt_IRQn
    <aa1>   DW_AT_const_value : -14
 <2><aa2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <aa3>   DW_AT_name        : (indirect string, offset: 0x824d2): MemoryManagement_IRQn
    <aa7>   DW_AT_const_value : -12
 <2><aa8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <aa9>   DW_AT_name        : (indirect string, offset: 0x825af): BusFault_IRQn
    <aad>   DW_AT_const_value : -11
 <2><aae>: Abbrev Number: 4 (DW_TAG_enumerator)
    <aaf>   DW_AT_name        : (indirect string, offset: 0x82884): UsageFault_IRQn
    <ab3>   DW_AT_const_value : -10
 <2><ab4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ab5>   DW_AT_name        : (indirect string, offset: 0x8253c): SVCall_IRQn
    <ab9>   DW_AT_const_value : -5
 <2><aba>: Abbrev Number: 4 (DW_TAG_enumerator)
    <abb>   DW_AT_name        : (indirect string, offset: 0x82560): DebugMonitor_IRQn
    <abf>   DW_AT_const_value : -4
 <2><ac0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ac1>   DW_AT_name        : (indirect string, offset: 0x82853): PendSV_IRQn
    <ac5>   DW_AT_const_value : -2
 <2><ac6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ac7>   DW_AT_name        : (indirect string, offset: 0x827ec): SysTick_IRQn
    <acb>   DW_AT_const_value : -1
 <2><acc>: Abbrev Number: 1 (DW_TAG_enumerator)
    <acd>   DW_AT_name        : (indirect string, offset: 0x82711): WWDG_IRQn
    <ad1>   DW_AT_const_value : 0
 <2><ad2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ad3>   DW_AT_name        : (indirect string, offset: 0x82824): PVD_IRQn
    <ad7>   DW_AT_const_value : 1
 <2><ad8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ad9>   DW_AT_name        : (indirect string, offset: 0x826d3): TAMP_STAMP_IRQn
    <add>   DW_AT_const_value : 2
 <2><ade>: Abbrev Number: 1 (DW_TAG_enumerator)
    <adf>   DW_AT_name        : (indirect string, offset: 0x82641): RTC_WKUP_IRQn
    <ae3>   DW_AT_const_value : 3
 <2><ae4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ae5>   DW_AT_name        : (indirect string, offset: 0x82524): FLASH_IRQn
    <ae9>   DW_AT_const_value : 4
 <2><aea>: Abbrev Number: 1 (DW_TAG_enumerator)
    <aeb>   DW_AT_name        : (indirect string, offset: 0x8268b): RCC_IRQn
    <aef>   DW_AT_const_value : 5
 <2><af0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af1>   DW_AT_name        : (indirect string, offset: 0x82894): EXTI0_IRQn
    <af5>   DW_AT_const_value : 6
 <2><af6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af7>   DW_AT_name        : (indirect string, offset: 0x825a4): EXTI1_IRQn
    <afb>   DW_AT_const_value : 7
 <2><afc>: Abbrev Number: 1 (DW_TAG_enumerator)
    <afd>   DW_AT_name        : (indirect string, offset: 0x8265c): EXTI2_IRQn
    <b01>   DW_AT_const_value : 8
 <2><b02>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b03>   DW_AT_name        : (indirect string, offset: 0x82548): EXTI3_IRQn
    <b07>   DW_AT_const_value : 9
 <2><b08>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b09>   DW_AT_name        : (indirect string, offset: 0x82789): EXTI4_IRQn
    <b0d>   DW_AT_const_value : 10
 <2><b0e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b0f>   DW_AT_name        : (indirect string, offset: 0x82625): DMA1_Stream0_IRQn
    <b13>   DW_AT_const_value : 11
 <2><b14>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b15>   DW_AT_name        : (indirect string, offset: 0x826ad): DMA1_Stream1_IRQn
    <b19>   DW_AT_const_value : 12
 <2><b1a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b1b>   DW_AT_name        : (indirect string, offset: 0x82751): DMA1_Stream2_IRQn
    <b1f>   DW_AT_const_value : 13
 <2><b20>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b21>   DW_AT_name        : (indirect string, offset: 0x82806): DMA1_Stream3_IRQn
    <b25>   DW_AT_const_value : 14
 <2><b26>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b27>   DW_AT_name        : (indirect string, offset: 0x824e8): DMA1_Stream4_IRQn
    <b2b>   DW_AT_const_value : 15
 <2><b2c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b2d>   DW_AT_name        : (indirect string, offset: 0x825bd): DMA1_Stream5_IRQn
    <b31>   DW_AT_const_value : 16
 <2><b32>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b33>   DW_AT_name        : (indirect string, offset: 0x82679): DMA1_Stream6_IRQn
    <b37>   DW_AT_const_value : 17
 <2><b38>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b39>   DW_AT_name        : (indirect string, offset: 0x82780): ADC_IRQn
    <b3d>   DW_AT_const_value : 18
 <2><b3e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b3f>   DW_AT_name        : (indirect string, offset: 0x82794): EXTI9_5_IRQn
    <b43>   DW_AT_const_value : 23
 <2><b44>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b45>   DW_AT_name        : (indirect string, offset: 0x82511): TIM1_BRK_TIM9_IRQn
    <b49>   DW_AT_const_value : 24
 <2><b4a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b4b>   DW_AT_name        : (indirect string, offset: 0x82763): TIM1_UP_TIM10_IRQn
    <b4f>   DW_AT_const_value : 25
 <2><b50>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b51>   DW_AT_name        : (indirect string, offset: 0x825f0): TIM1_TRG_COM_TIM11_IRQn
    <b55>   DW_AT_const_value : 26
 <2><b56>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b57>   DW_AT_name        : (indirect string, offset: 0x827f9): TIM1_CC_IRQn
    <b5b>   DW_AT_const_value : 27
 <2><b5c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b5d>   DW_AT_name        : (indirect string, offset: 0x8285f): TIM2_IRQn
    <b61>   DW_AT_const_value : 28
 <2><b62>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b63>   DW_AT_name        : (indirect string, offset: 0x82572): TIM3_IRQn
    <b67>   DW_AT_const_value : 29
 <2><b68>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b69>   DW_AT_name        : (indirect string, offset: 0x82637): TIM4_IRQn
    <b6d>   DW_AT_const_value : 30
 <2><b6e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b6f>   DW_AT_name        : (indirect string, offset: 0x8252f): I2C1_EV_IRQn
    <b73>   DW_AT_const_value : 31
 <2><b74>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b75>   DW_AT_name        : (indirect string, offset: 0x8264f): I2C1_ER_IRQn
    <b79>   DW_AT_const_value : 32
 <2><b7a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b7b>   DW_AT_name        : (indirect string, offset: 0x827a1): I2C2_EV_IRQn
    <b7f>   DW_AT_const_value : 33
 <2><b80>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b81>   DW_AT_name        : (indirect string, offset: 0x824fa): I2C2_ER_IRQn
    <b85>   DW_AT_const_value : 34
 <2><b86>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b87>   DW_AT_name        : (indirect string, offset: 0x8257c): SPI1_IRQn
    <b8b>   DW_AT_const_value : 35
 <2><b8c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b8d>   DW_AT_name        : (indirect string, offset: 0x826f5): SPI2_IRQn
    <b91>   DW_AT_const_value : 36
 <2><b92>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b93>   DW_AT_name        : (indirect string, offset: 0x82818): USART1_IRQn
    <b97>   DW_AT_const_value : 37
 <2><b98>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b99>   DW_AT_name        : (indirect string, offset: 0x82694): USART2_IRQn
    <b9d>   DW_AT_const_value : 38
 <2><b9e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b9f>   DW_AT_name        : (indirect string, offset: 0x8272d): EXTI15_10_IRQn
    <ba3>   DW_AT_const_value : 40
 <2><ba4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ba5>   DW_AT_name        : (indirect string, offset: 0x825cf): RTC_Alarm_IRQn
    <ba9>   DW_AT_const_value : 41
 <2><baa>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bab>   DW_AT_name        : (indirect string, offset: 0x82614): OTG_FS_WKUP_IRQn
    <baf>   DW_AT_const_value : 42
 <2><bb0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bb1>   DW_AT_name        : (indirect string, offset: 0x826ff): DMA1_Stream7_IRQn
    <bb5>   DW_AT_const_value : 47
 <2><bb6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bb7>   DW_AT_name        : (indirect string, offset: 0x44651): SDIO_IRQn
    <bbb>   DW_AT_const_value : 49
 <2><bbc>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bbd>   DW_AT_name        : (indirect string, offset: 0x826bf): TIM5_IRQn
    <bc1>   DW_AT_const_value : 50
 <2><bc2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bc3>   DW_AT_name        : (indirect string, offset: 0x826c9): SPI3_IRQn
    <bc7>   DW_AT_const_value : 51
 <2><bc8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bc9>   DW_AT_name        : (indirect string, offset: 0x8271b): DMA2_Stream0_IRQn
    <bcd>   DW_AT_const_value : 56
 <2><bce>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bcf>   DW_AT_name        : (indirect string, offset: 0x827ae): DMA2_Stream1_IRQn
    <bd3>   DW_AT_const_value : 57
 <2><bd4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bd5>   DW_AT_name        : (indirect string, offset: 0x82872): DMA2_Stream2_IRQn
    <bd9>   DW_AT_const_value : 58
 <2><bda>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bdb>   DW_AT_name        : (indirect string, offset: 0x82586): DMA2_Stream3_IRQn
    <bdf>   DW_AT_const_value : 59
 <2><be0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <be1>   DW_AT_name        : (indirect string, offset: 0x82667): DMA2_Stream4_IRQn
    <be5>   DW_AT_const_value : 60
 <2><be6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <be7>   DW_AT_name        : (indirect string, offset: 0x82608): OTG_FS_IRQn
    <beb>   DW_AT_const_value : 67
 <2><bec>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bed>   DW_AT_name        : (indirect string, offset: 0x826e3): DMA2_Stream5_IRQn
    <bf1>   DW_AT_const_value : 68
 <2><bf2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bf3>   DW_AT_name        : (indirect string, offset: 0x825de): DMA2_Stream6_IRQn
    <bf7>   DW_AT_const_value : 69
 <2><bf8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bf9>   DW_AT_name        : (indirect string, offset: 0x8282d): DMA2_Stream7_IRQn
    <bfd>   DW_AT_const_value : 70
 <2><bfe>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bff>   DW_AT_name        : (indirect string, offset: 0x82598): USART6_IRQn
    <c03>   DW_AT_const_value : 71
 <2><c04>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c05>   DW_AT_name        : (indirect string, offset: 0x826a0): I2C3_EV_IRQn
    <c09>   DW_AT_const_value : 72
 <2><c0a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c0b>   DW_AT_name        : (indirect string, offset: 0x82553): I2C3_ER_IRQn
    <c0f>   DW_AT_const_value : 73
 <2><c10>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c11>   DW_AT_name        : (indirect string, offset: 0x82869): FPU_IRQn
    <c15>   DW_AT_const_value : 81
 <2><c16>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c17>   DW_AT_name        : (indirect string, offset: 0x82776): SPI4_IRQn
    <c1b>   DW_AT_const_value : 84
 <2><c1c>: Abbrev Number: 0
 <1><c1d>: Abbrev Number: 3 (DW_TAG_base_type)
    <c1e>   DW_AT_byte_size   : 1
    <c1f>   DW_AT_encoding    : 6	(signed char)
    <c20>   DW_AT_name        : (indirect string, offset: 0x61676): signed char
 <1><c24>: Abbrev Number: 5 (DW_TAG_typedef)
    <c25>   DW_AT_name        : (indirect string, offset: 0x82507): IRQn_Type
    <c29>   DW_AT_decl_file   : 2
    <c2a>   DW_AT_decl_line   : 133
    <c2b>   DW_AT_decl_column : 3
    <c2c>   DW_AT_type        : <0xa8e>
 <1><c30>: Abbrev Number: 3 (DW_TAG_base_type)
    <c31>   DW_AT_byte_size   : 1
    <c32>   DW_AT_encoding    : 8	(unsigned char)
    <c33>   DW_AT_name        : (indirect string, offset: 0x5d82b): unsigned char
 <1><c37>: Abbrev Number: 3 (DW_TAG_base_type)
    <c38>   DW_AT_byte_size   : 2
    <c39>   DW_AT_encoding    : 5	(signed)
    <c3a>   DW_AT_name        : (indirect string, offset: 0x4ede): short int
 <1><c3e>: Abbrev Number: 3 (DW_TAG_base_type)
    <c3f>   DW_AT_byte_size   : 2
    <c40>   DW_AT_encoding    : 7	(unsigned)
    <c41>   DW_AT_name        : (indirect string, offset: 0x41361): short unsigned int
 <1><c45>: Abbrev Number: 3 (DW_TAG_base_type)
    <c46>   DW_AT_byte_size   : 4
    <c47>   DW_AT_encoding    : 5	(signed)
    <c48>   DW_AT_name        : (indirect string, offset: 0x19f16): long int
 <1><c4c>: Abbrev Number: 5 (DW_TAG_typedef)
    <c4d>   DW_AT_name        : (indirect string, offset: 0x39268): __uint32_t
    <c51>   DW_AT_decl_file   : 3
    <c52>   DW_AT_decl_line   : 79
    <c53>   DW_AT_decl_column : 25
    <c54>   DW_AT_type        : <0xc58>
 <1><c58>: Abbrev Number: 3 (DW_TAG_base_type)
    <c59>   DW_AT_byte_size   : 4
    <c5a>   DW_AT_encoding    : 7	(unsigned)
    <c5b>   DW_AT_name        : (indirect string, offset: 0x4cbe4): long unsigned int
 <1><c5f>: Abbrev Number: 3 (DW_TAG_base_type)
    <c60>   DW_AT_byte_size   : 8
    <c61>   DW_AT_encoding    : 5	(signed)
    <c62>   DW_AT_name        : (indirect string, offset: 0x33c0c): long long int
 <1><c66>: Abbrev Number: 3 (DW_TAG_base_type)
    <c67>   DW_AT_byte_size   : 8
    <c68>   DW_AT_encoding    : 7	(unsigned)
    <c69>   DW_AT_name        : (indirect string, offset: 0x2c20c): long long unsigned int
 <1><c6d>: Abbrev Number: 13 (DW_TAG_base_type)
    <c6e>   DW_AT_byte_size   : 4
    <c6f>   DW_AT_encoding    : 5	(signed)
    <c70>   DW_AT_name        : int
 <1><c74>: Abbrev Number: 3 (DW_TAG_base_type)
    <c75>   DW_AT_byte_size   : 4
    <c76>   DW_AT_encoding    : 7	(unsigned)
    <c77>   DW_AT_name        : (indirect string, offset: 0x46411): unsigned int
 <1><c7b>: Abbrev Number: 5 (DW_TAG_typedef)
    <c7c>   DW_AT_name        : (indirect string, offset: 0x3297f): uint32_t
    <c80>   DW_AT_decl_file   : 4
    <c81>   DW_AT_decl_line   : 48
    <c82>   DW_AT_decl_column : 20
    <c83>   DW_AT_type        : <0xc4c>
 <1><c87>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <c88>   DW_AT_type        : <0xc7b>
 <1><c8c>: Abbrev Number: 8 (DW_TAG_array_type)
    <c8d>   DW_AT_type        : <0xc7b>
    <c91>   DW_AT_sibling     : <0xc9c>
 <2><c95>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <c96>   DW_AT_type        : <0xc74>
    <c9a>   DW_AT_upper_bound : 0
 <2><c9b>: Abbrev Number: 0
 <1><c9c>: Abbrev Number: 8 (DW_TAG_array_type)
    <c9d>   DW_AT_type        : <0xc7b>
    <ca1>   DW_AT_sibling     : <0xcac>
 <2><ca5>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <ca6>   DW_AT_type        : <0xc74>
    <caa>   DW_AT_upper_bound : 1
 <2><cab>: Abbrev Number: 0
 <1><cac>: Abbrev Number: 15 (DW_TAG_structure_type)
    <cad>   DW_AT_byte_size   : 144
    <cae>   DW_AT_decl_file   : 2
    <caf>   DW_AT_decl_line   : 335
    <cb1>   DW_AT_decl_column : 9
    <cb2>   DW_AT_sibling     : <0xe36>
 <2><cb6>: Abbrev Number: 6 (DW_TAG_member)
    <cb7>   DW_AT_name        : CR
    <cba>   DW_AT_decl_file   : 2
    <cba>   DW_AT_decl_line   : 337
    <cbc>   DW_AT_decl_column : 17
    <cbc>   DW_AT_type        : <0xc87>
    <cc0>   DW_AT_data_member_location: 0
 <2><cc1>: Abbrev Number: 2 (DW_TAG_member)
    <cc2>   DW_AT_name        : (indirect string, offset: 0x356e0): PLLCFGR
    <cc6>   DW_AT_decl_file   : 2
    <cc6>   DW_AT_decl_line   : 338
    <cc8>   DW_AT_decl_column : 17
    <cc8>   DW_AT_type        : <0xc87>
    <ccc>   DW_AT_data_member_location: 4
 <2><ccd>: Abbrev Number: 2 (DW_TAG_member)
    <cce>   DW_AT_name        : (indirect string, offset: 0x65488): CFGR
    <cd2>   DW_AT_decl_file   : 2
    <cd2>   DW_AT_decl_line   : 339
    <cd4>   DW_AT_decl_column : 17
    <cd4>   DW_AT_type        : <0xc87>
    <cd8>   DW_AT_data_member_location: 8
 <2><cd9>: Abbrev Number: 6 (DW_TAG_member)
    <cda>   DW_AT_name        : CIR
    <cde>   DW_AT_decl_file   : 2
    <cde>   DW_AT_decl_line   : 340
    <ce0>   DW_AT_decl_column : 17
    <ce0>   DW_AT_type        : <0xc87>
    <ce4>   DW_AT_data_member_location: 12
 <2><ce5>: Abbrev Number: 2 (DW_TAG_member)
    <ce6>   DW_AT_name        : (indirect string, offset: 0x55d41): AHB1RSTR
    <cea>   DW_AT_decl_file   : 2
    <cea>   DW_AT_decl_line   : 341
    <cec>   DW_AT_decl_column : 17
    <cec>   DW_AT_type        : <0xc87>
    <cf0>   DW_AT_data_member_location: 16
 <2><cf1>: Abbrev Number: 2 (DW_TAG_member)
    <cf2>   DW_AT_name        : (indirect string, offset: 0x6a38a): AHB2RSTR
    <cf6>   DW_AT_decl_file   : 2
    <cf6>   DW_AT_decl_line   : 342
    <cf8>   DW_AT_decl_column : 17
    <cf8>   DW_AT_type        : <0xc87>
    <cfc>   DW_AT_data_member_location: 20
 <2><cfd>: Abbrev Number: 2 (DW_TAG_member)
    <cfe>   DW_AT_name        : (indirect string, offset: 0x7f33f): AHB3RSTR
    <d02>   DW_AT_decl_file   : 2
    <d02>   DW_AT_decl_line   : 343
    <d04>   DW_AT_decl_column : 17
    <d04>   DW_AT_type        : <0xc87>
    <d08>   DW_AT_data_member_location: 24
 <2><d09>: Abbrev Number: 2 (DW_TAG_member)
    <d0a>   DW_AT_name        : (indirect string, offset: 0xf7cb): RESERVED0
    <d0e>   DW_AT_decl_file   : 2
    <d0e>   DW_AT_decl_line   : 344
    <d10>   DW_AT_decl_column : 17
    <d10>   DW_AT_type        : <0xc7b>
    <d14>   DW_AT_data_member_location: 28
 <2><d15>: Abbrev Number: 2 (DW_TAG_member)
    <d16>   DW_AT_name        : (indirect string, offset: 0x195cb): APB1RSTR
    <d1a>   DW_AT_decl_file   : 2
    <d1a>   DW_AT_decl_line   : 345
    <d1c>   DW_AT_decl_column : 17
    <d1c>   DW_AT_type        : <0xc87>
    <d20>   DW_AT_data_member_location: 32
 <2><d21>: Abbrev Number: 2 (DW_TAG_member)
    <d22>   DW_AT_name        : (indirect string, offset: 0xae4c): APB2RSTR
    <d26>   DW_AT_decl_file   : 2
    <d26>   DW_AT_decl_line   : 346
    <d28>   DW_AT_decl_column : 17
    <d28>   DW_AT_type        : <0xc87>
    <d2c>   DW_AT_data_member_location: 36
 <2><d2d>: Abbrev Number: 2 (DW_TAG_member)
    <d2e>   DW_AT_name        : (indirect string, offset: 0xf7f0): RESERVED1
    <d32>   DW_AT_decl_file   : 2
    <d32>   DW_AT_decl_line   : 347
    <d34>   DW_AT_decl_column : 17
    <d34>   DW_AT_type        : <0xc9c>
    <d38>   DW_AT_data_member_location: 40
 <2><d39>: Abbrev Number: 2 (DW_TAG_member)
    <d3a>   DW_AT_name        : (indirect string, offset: 0x684a9): AHB1ENR
    <d3e>   DW_AT_decl_file   : 2
    <d3e>   DW_AT_decl_line   : 348
    <d40>   DW_AT_decl_column : 17
    <d40>   DW_AT_type        : <0xc87>
    <d44>   DW_AT_data_member_location: 48
 <2><d45>: Abbrev Number: 2 (DW_TAG_member)
    <d46>   DW_AT_name        : (indirect string, offset: 0x16266): AHB2ENR
    <d4a>   DW_AT_decl_file   : 2
    <d4a>   DW_AT_decl_line   : 349
    <d4c>   DW_AT_decl_column : 17
    <d4c>   DW_AT_type        : <0xc87>
    <d50>   DW_AT_data_member_location: 52
 <2><d51>: Abbrev Number: 2 (DW_TAG_member)
    <d52>   DW_AT_name        : (indirect string, offset: 0x13e8): AHB3ENR
    <d56>   DW_AT_decl_file   : 2
    <d56>   DW_AT_decl_line   : 350
    <d58>   DW_AT_decl_column : 17
    <d58>   DW_AT_type        : <0xc87>
    <d5c>   DW_AT_data_member_location: 56
 <2><d5d>: Abbrev Number: 2 (DW_TAG_member)
    <d5e>   DW_AT_name        : (indirect string, offset: 0x522ce): RESERVED2
    <d62>   DW_AT_decl_file   : 2
    <d62>   DW_AT_decl_line   : 351
    <d64>   DW_AT_decl_column : 17
    <d64>   DW_AT_type        : <0xc7b>
    <d68>   DW_AT_data_member_location: 60
 <2><d69>: Abbrev Number: 2 (DW_TAG_member)
    <d6a>   DW_AT_name        : (indirect string, offset: 0x25c25): APB1ENR
    <d6e>   DW_AT_decl_file   : 2
    <d6e>   DW_AT_decl_line   : 352
    <d70>   DW_AT_decl_column : 17
    <d70>   DW_AT_type        : <0xc87>
    <d74>   DW_AT_data_member_location: 64
 <2><d75>: Abbrev Number: 2 (DW_TAG_member)
    <d76>   DW_AT_name        : (indirect string, offset: 0x5318c): APB2ENR
    <d7a>   DW_AT_decl_file   : 2
    <d7a>   DW_AT_decl_line   : 353
    <d7c>   DW_AT_decl_column : 17
    <d7c>   DW_AT_type        : <0xc87>
    <d80>   DW_AT_data_member_location: 68
 <2><d81>: Abbrev Number: 2 (DW_TAG_member)
    <d82>   DW_AT_name        : (indirect string, offset: 0x522d8): RESERVED3
    <d86>   DW_AT_decl_file   : 2
    <d86>   DW_AT_decl_line   : 354
    <d88>   DW_AT_decl_column : 17
    <d88>   DW_AT_type        : <0xc9c>
    <d8c>   DW_AT_data_member_location: 72
 <2><d8d>: Abbrev Number: 2 (DW_TAG_member)
    <d8e>   DW_AT_name        : (indirect string, offset: 0x2591c): AHB1LPENR
    <d92>   DW_AT_decl_file   : 2
    <d92>   DW_AT_decl_line   : 355
    <d94>   DW_AT_decl_column : 17
    <d94>   DW_AT_type        : <0xc87>
    <d98>   DW_AT_data_member_location: 80
 <2><d99>: Abbrev Number: 2 (DW_TAG_member)
    <d9a>   DW_AT_name        : (indirect string, offset: 0x59417): AHB2LPENR
    <d9e>   DW_AT_decl_file   : 2
    <d9e>   DW_AT_decl_line   : 356
    <da0>   DW_AT_decl_column : 17
    <da0>   DW_AT_type        : <0xc87>
    <da4>   DW_AT_data_member_location: 84
 <2><da5>: Abbrev Number: 2 (DW_TAG_member)
    <da6>   DW_AT_name        : (indirect string, offset: 0x6622c): AHB3LPENR
    <daa>   DW_AT_decl_file   : 2
    <daa>   DW_AT_decl_line   : 357
    <dac>   DW_AT_decl_column : 17
    <dac>   DW_AT_type        : <0xc87>
    <db0>   DW_AT_data_member_location: 88
 <2><db1>: Abbrev Number: 2 (DW_TAG_member)
    <db2>   DW_AT_name        : (indirect string, offset: 0x522e2): RESERVED4
    <db6>   DW_AT_decl_file   : 2
    <db6>   DW_AT_decl_line   : 358
    <db8>   DW_AT_decl_column : 17
    <db8>   DW_AT_type        : <0xc7b>
    <dbc>   DW_AT_data_member_location: 92
 <2><dbd>: Abbrev Number: 2 (DW_TAG_member)
    <dbe>   DW_AT_name        : (indirect string, offset: 0x67adf): APB1LPENR
    <dc2>   DW_AT_decl_file   : 2
    <dc2>   DW_AT_decl_line   : 359
    <dc4>   DW_AT_decl_column : 17
    <dc4>   DW_AT_type        : <0xc87>
    <dc8>   DW_AT_data_member_location: 96
 <2><dc9>: Abbrev Number: 2 (DW_TAG_member)
    <dca>   DW_AT_name        : (indirect string, offset: 0x8055e): APB2LPENR
    <dce>   DW_AT_decl_file   : 2
    <dce>   DW_AT_decl_line   : 360
    <dd0>   DW_AT_decl_column : 17
    <dd0>   DW_AT_type        : <0xc87>
    <dd4>   DW_AT_data_member_location: 100
 <2><dd5>: Abbrev Number: 2 (DW_TAG_member)
    <dd6>   DW_AT_name        : (indirect string, offset: 0x522ec): RESERVED5
    <dda>   DW_AT_decl_file   : 2
    <dda>   DW_AT_decl_line   : 361
    <ddc>   DW_AT_decl_column : 17
    <ddc>   DW_AT_type        : <0xc9c>
    <de0>   DW_AT_data_member_location: 104
 <2><de1>: Abbrev Number: 2 (DW_TAG_member)
    <de2>   DW_AT_name        : (indirect string, offset: 0x82117): BDCR
    <de6>   DW_AT_decl_file   : 2
    <de6>   DW_AT_decl_line   : 362
    <de8>   DW_AT_decl_column : 17
    <de8>   DW_AT_type        : <0xc87>
    <dec>   DW_AT_data_member_location: 112
 <2><ded>: Abbrev Number: 6 (DW_TAG_member)
    <dee>   DW_AT_name        : CSR
    <df2>   DW_AT_decl_file   : 2
    <df2>   DW_AT_decl_line   : 363
    <df4>   DW_AT_decl_column : 17
    <df4>   DW_AT_type        : <0xc87>
    <df8>   DW_AT_data_member_location: 116
 <2><df9>: Abbrev Number: 2 (DW_TAG_member)
    <dfa>   DW_AT_name        : (indirect string, offset: 0x9091): RESERVED6
    <dfe>   DW_AT_decl_file   : 2
    <dfe>   DW_AT_decl_line   : 364
    <e00>   DW_AT_decl_column : 17
    <e00>   DW_AT_type        : <0xc9c>
    <e04>   DW_AT_data_member_location: 120
 <2><e05>: Abbrev Number: 2 (DW_TAG_member)
    <e06>   DW_AT_name        : (indirect string, offset: 0x6e9b5): SSCGR
    <e0a>   DW_AT_decl_file   : 2
    <e0a>   DW_AT_decl_line   : 365
    <e0c>   DW_AT_decl_column : 17
    <e0c>   DW_AT_type        : <0xc87>
    <e10>   DW_AT_data_member_location: 128
 <2><e11>: Abbrev Number: 2 (DW_TAG_member)
    <e12>   DW_AT_name        : (indirect string, offset: 0xd87f): PLLI2SCFGR
    <e16>   DW_AT_decl_file   : 2
    <e16>   DW_AT_decl_line   : 366
    <e18>   DW_AT_decl_column : 17
    <e18>   DW_AT_type        : <0xc87>
    <e1c>   DW_AT_data_member_location: 132
 <2><e1d>: Abbrev Number: 2 (DW_TAG_member)
    <e1e>   DW_AT_name        : (indirect string, offset: 0x52329): RESERVED7
    <e22>   DW_AT_decl_file   : 2
    <e22>   DW_AT_decl_line   : 367
    <e24>   DW_AT_decl_column : 17
    <e24>   DW_AT_type        : <0xc8c>
    <e28>   DW_AT_data_member_location: 136
 <2><e29>: Abbrev Number: 2 (DW_TAG_member)
    <e2a>   DW_AT_name        : (indirect string, offset: 0x65485): DCKCFGR
    <e2e>   DW_AT_decl_file   : 2
    <e2e>   DW_AT_decl_line   : 368
    <e30>   DW_AT_decl_column : 17
    <e30>   DW_AT_type        : <0xc87>
    <e34>   DW_AT_data_member_location: 140
 <2><e35>: Abbrev Number: 0
 <1><e36>: Abbrev Number: 16 (DW_TAG_typedef)
    <e37>   DW_AT_name        : (indirect string, offset: 0x1ad02): RCC_TypeDef
    <e3b>   DW_AT_decl_file   : 2
    <e3c>   DW_AT_decl_line   : 369
    <e3e>   DW_AT_decl_column : 3
    <e3f>   DW_AT_type        : <0xcac>
 <1><e43>: Abbrev Number: 3 (DW_TAG_base_type)
    <e44>   DW_AT_byte_size   : 8
    <e45>   DW_AT_encoding    : 4	(float)
    <e46>   DW_AT_name        : (indirect string, offset: 0x8860e): long double
 <1><e4a>: Abbrev Number: 17 (DW_TAG_subprogram)
    <e4b>   DW_AT_external    : 1
    <e4b>   DW_AT_name        : (indirect string, offset: 0x8273c): HAL_NVIC_SetPriority
    <e4f>   DW_AT_decl_file   : 5
    <e50>   DW_AT_decl_line   : 261
    <e52>   DW_AT_decl_column : 6
    <e53>   DW_AT_prototyped  : 1
    <e53>   DW_AT_declaration : 1
    <e53>   DW_AT_sibling     : <0xe67>
 <2><e57>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <e58>   DW_AT_type        : <0xc24>
 <2><e5c>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <e5d>   DW_AT_type        : <0xc7b>
 <2><e61>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <e62>   DW_AT_type        : <0xc7b>
 <2><e66>: Abbrev Number: 0
 <1><e67>: Abbrev Number: 18 (DW_TAG_subprogram)
    <e68>   DW_AT_external    : 1
    <e68>   DW_AT_name        : (indirect string, offset: 0x827e0): HAL_MspInit
    <e6c>   DW_AT_decl_file   : 1
    <e6d>   DW_AT_decl_line   : 63
    <e6e>   DW_AT_decl_column : 6
    <e6f>   DW_AT_prototyped  : 1
    <e6f>   DW_AT_low_pc      : 0x80007f4
    <e73>   DW_AT_high_pc     : 0x58
    <e77>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e79>   DW_AT_call_all_tail_calls: 1
 <2><e79>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <e7a>   DW_AT_low_pc      : 0x80007fa
    <e7e>   DW_AT_high_pc     : 0x1c
    <e82>   DW_AT_sibling     : <0xe94>
 <3><e86>: Abbrev Number: 10 (DW_TAG_variable)
    <e87>   DW_AT_name        : (indirect string, offset: 0x6a17b): tmpreg
    <e8b>   DW_AT_decl_file   : 1
    <e8b>   DW_AT_decl_line   : 70
    <e8c>   DW_AT_decl_column : 3
    <e8c>   DW_AT_type        : <0xc87>
    <e90>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><e93>: Abbrev Number: 0
 <2><e94>: Abbrev Number: 20 (DW_TAG_lexical_block)
    <e95>   DW_AT_low_pc      : 0x8000816
    <e99>   DW_AT_high_pc     : 0x1c
 <3><e9d>: Abbrev Number: 10 (DW_TAG_variable)
    <e9e>   DW_AT_name        : (indirect string, offset: 0x6a17b): tmpreg
    <ea2>   DW_AT_decl_file   : 1
    <ea2>   DW_AT_decl_line   : 71
    <ea3>   DW_AT_decl_column : 3
    <ea3>   DW_AT_type        : <0xc87>
    <ea7>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><eaa>: Abbrev Number: 0
 <2><eab>: Abbrev Number: 0
 <1><eac>: Abbrev Number: 0
  Compilation Unit @ offset 0xead:
   Length:        0x116 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x3dd
   Pointer Size:  4
 <0><eb9>: Abbrev Number: 4 (DW_TAG_compile_unit)
    <eba>   DW_AT_producer    : (indirect string, offset: 0x75822): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <ebe>   DW_AT_language    : 29	(C11)
    <ebf>   DW_AT_name        : (indirect string, offset: 0x82907): ../Core/Src/stm32f4xx_it.c
    <ec3>   DW_AT_comp_dir    : (indirect string, offset: 0x34613): D:/Personal studies/ITI embedded/workspace/my_Code/Debug
    <ec7>   DW_AT_ranges      : 0x53
    <ecb>   DW_AT_low_pc      : 0
    <ecf>   DW_AT_stmt_list   : 0x109b
    <ed3>   DW_AT_macros      : 0x724
 <1><ed7>: Abbrev Number: 1 (DW_TAG_base_type)
    <ed8>   DW_AT_byte_size   : 1
    <ed9>   DW_AT_encoding    : 6	(signed char)
    <eda>   DW_AT_name        : (indirect string, offset: 0x61676): signed char
 <1><ede>: Abbrev Number: 1 (DW_TAG_base_type)
    <edf>   DW_AT_byte_size   : 1
    <ee0>   DW_AT_encoding    : 8	(unsigned char)
    <ee1>   DW_AT_name        : (indirect string, offset: 0x5d82b): unsigned char
 <1><ee5>: Abbrev Number: 1 (DW_TAG_base_type)
    <ee6>   DW_AT_byte_size   : 2
    <ee7>   DW_AT_encoding    : 5	(signed)
    <ee8>   DW_AT_name        : (indirect string, offset: 0x4ede): short int
 <1><eec>: Abbrev Number: 1 (DW_TAG_base_type)
    <eed>   DW_AT_byte_size   : 2
    <eee>   DW_AT_encoding    : 7	(unsigned)
    <eef>   DW_AT_name        : (indirect string, offset: 0x41361): short unsigned int
 <1><ef3>: Abbrev Number: 1 (DW_TAG_base_type)
    <ef4>   DW_AT_byte_size   : 4
    <ef5>   DW_AT_encoding    : 5	(signed)
    <ef6>   DW_AT_name        : (indirect string, offset: 0x19f16): long int
 <1><efa>: Abbrev Number: 1 (DW_TAG_base_type)
    <efb>   DW_AT_byte_size   : 4
    <efc>   DW_AT_encoding    : 7	(unsigned)
    <efd>   DW_AT_name        : (indirect string, offset: 0x4cbe4): long unsigned int
 <1><f01>: Abbrev Number: 1 (DW_TAG_base_type)
    <f02>   DW_AT_byte_size   : 8
    <f03>   DW_AT_encoding    : 5	(signed)
    <f04>   DW_AT_name        : (indirect string, offset: 0x33c0c): long long int
 <1><f08>: Abbrev Number: 1 (DW_TAG_base_type)
    <f09>   DW_AT_byte_size   : 8
    <f0a>   DW_AT_encoding    : 7	(unsigned)
    <f0b>   DW_AT_name        : (indirect string, offset: 0x2c20c): long long unsigned int
 <1><f0f>: Abbrev Number: 5 (DW_TAG_base_type)
    <f10>   DW_AT_byte_size   : 4
    <f11>   DW_AT_encoding    : 5	(signed)
    <f12>   DW_AT_name        : int
 <1><f16>: Abbrev Number: 1 (DW_TAG_base_type)
    <f17>   DW_AT_byte_size   : 4
    <f18>   DW_AT_encoding    : 7	(unsigned)
    <f19>   DW_AT_name        : (indirect string, offset: 0x46411): unsigned int
 <1><f1d>: Abbrev Number: 1 (DW_TAG_base_type)
    <f1e>   DW_AT_byte_size   : 8
    <f1f>   DW_AT_encoding    : 4	(float)
    <f20>   DW_AT_name        : (indirect string, offset: 0x8860e): long double
 <1><f24>: Abbrev Number: 6 (DW_TAG_typedef)
    <f25>   DW_AT_name        : (indirect string, offset: 0x8909d): BaseType_t
    <f29>   DW_AT_decl_file   : 4
    <f2a>   DW_AT_decl_line   : 56
    <f2b>   DW_AT_decl_column : 14
    <f2c>   DW_AT_type        : <0xef3>
 <1><f30>: Abbrev Number: 1 (DW_TAG_base_type)
    <f31>   DW_AT_byte_size   : 1
    <f32>   DW_AT_encoding    : 8	(unsigned char)
    <f33>   DW_AT_name        : (indirect string, offset: 0x7e703): char
 <1><f37>: Abbrev Number: 3 (DW_TAG_subprogram)
    <f38>   DW_AT_external    : 1
    <f38>   DW_AT_name        : (indirect string, offset: 0x828d6): xPortSysTickHandler
    <f3c>   DW_AT_decl_file   : 2
    <f3d>   DW_AT_decl_line   : 54
    <f3e>   DW_AT_decl_column : 8
    <f3f>   DW_AT_prototyped  : 1
    <f3f>   DW_AT_declaration : 1
 <1><f3f>: Abbrev Number: 7 (DW_TAG_subprogram)
    <f40>   DW_AT_external    : 1
    <f40>   DW_AT_name        : (indirect string, offset: 0x82951): xTaskGetSchedulerState
    <f44>   DW_AT_decl_file   : 5
    <f45>   DW_AT_decl_line   : 2450
    <f47>   DW_AT_decl_column : 12
    <f48>   DW_AT_prototyped  : 1
    <f48>   DW_AT_type        : <0xf24>
    <f4c>   DW_AT_declaration : 1
 <1><f4c>: Abbrev Number: 3 (DW_TAG_subprogram)
    <f4d>   DW_AT_external    : 1
    <f4d>   DW_AT_name        : (indirect string, offset: 0x82934): HAL_IncTick
    <f51>   DW_AT_decl_file   : 3
    <f52>   DW_AT_decl_line   : 232
    <f53>   DW_AT_decl_column : 6
    <f54>   DW_AT_prototyped  : 1
    <f54>   DW_AT_declaration : 1
 <1><f54>: Abbrev Number: 8 (DW_TAG_subprogram)
    <f55>   DW_AT_external    : 1
    <f55>   DW_AT_name        : (indirect string, offset: 0x82968): SysTick_Handler
    <f59>   DW_AT_decl_file   : 1
    <f5a>   DW_AT_decl_line   : 159
    <f5b>   DW_AT_decl_column : 6
    <f5c>   DW_AT_prototyped  : 1
    <f5c>   DW_AT_low_pc      : 0x8000882
    <f60>   DW_AT_high_pc     : 0x1a
    <f64>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f66>   DW_AT_call_all_tail_calls: 1
 <1><f66>: Abbrev Number: 2 (DW_TAG_subprogram)
    <f67>   DW_AT_external    : 1
    <f67>   DW_AT_name        : (indirect string, offset: 0x828ea): DebugMon_Handler
    <f6b>   DW_AT_decl_file   : 1
    <f6b>   DW_AT_decl_line   : 146
    <f6c>   DW_AT_decl_column : 6
    <f6c>   DW_AT_prototyped  : 1
    <f6c>   DW_AT_low_pc      : 0x8000874
    <f70>   DW_AT_high_pc     : 0xe
    <f74>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f76>   DW_AT_call_all_calls: 1
 <1><f76>: Abbrev Number: 2 (DW_TAG_subprogram)
    <f77>   DW_AT_external    : 1
    <f77>   DW_AT_name        : (indirect string, offset: 0x828b1): UsageFault_Handler
    <f7b>   DW_AT_decl_file   : 1
    <f7b>   DW_AT_decl_line   : 131
    <f7c>   DW_AT_decl_column : 6
    <f7c>   DW_AT_prototyped  : 1
    <f7c>   DW_AT_low_pc      : 0x800086c
    <f80>   DW_AT_high_pc     : 0x8
    <f84>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f86>   DW_AT_call_all_calls: 1
 <1><f86>: Abbrev Number: 2 (DW_TAG_subprogram)
    <f87>   DW_AT_external    : 1
    <f87>   DW_AT_name        : (indirect string, offset: 0x82940): BusFault_Handler
    <f8b>   DW_AT_decl_file   : 1
    <f8b>   DW_AT_decl_line   : 116
    <f8c>   DW_AT_decl_column : 6
    <f8c>   DW_AT_prototyped  : 1
    <f8c>   DW_AT_low_pc      : 0x8000864
    <f90>   DW_AT_high_pc     : 0x8
    <f94>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f96>   DW_AT_call_all_calls: 1
 <1><f96>: Abbrev Number: 2 (DW_TAG_subprogram)
    <f97>   DW_AT_external    : 1
